{"bookmarked": 18, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "k107gzh7chf6zg", "type": "create", "uid_a": "a_0", "when": "2019-09-26T04:36:54Z"}, {"anon": "stud", "to": "k107gzh4svy6zf", "type": "followup", "uid_a": "a_1", "when": "2019-09-26T16:48:42Z"}, {"anon": "no", "to": "k107gzh4svy6zf", "type": "feedback", "uid": "is0vls53gakb4", "when": "2019-09-26T18:23:38Z"}, {"anon": "stud", "to": "k107gzh4svy6zf", "type": "feedback", "uid_a": "a_1", "when": "2019-09-26T18:38:31Z"}, {"anon": "no", "to": "k107gzh4svy6zf", "type": "feedback", "uid": "is0vls53gakb4", "when": "2019-09-26T18:51:07Z"}, {"anon": "no", "to": "k107gzh4svy6zf", "type": "feedback", "uid": "is0vls53gakb4", "when": "2019-09-26T18:55:21Z"}, {"anon": "stud", "to": "k107gzh4svy6zf", "type": "feedback", "uid_a": "a_2", "when": "2019-09-26T19:09:54Z"}, {"anon": "no", "to": "k107gzh4svy6zf", "type": "followup", "uid": "jktvfof2jqx4j5", "when": "2019-09-26T21:02:10Z"}, {"anon": "no", "to": "k107gzh4svy6zf", "type": "feedback", "uid": "jktvfof2jqx4j5", "when": "2019-09-26T21:07:50Z"}, {"anon": "no", "to": "k107gzh4svy6zf", "type": "feedback", "uid": "jjrg5e90hle587", "when": "2019-09-26T23:50:28Z"}, {"anon": "stud", "to": "k107gzh4svy6zf", "type": "feedback", "uid_a": "a_3", "when": "2019-09-27T00:04:12Z"}, {"anon": "stud", "to": "k107gzh4svy6zf", "type": "followup", "uid_a": "a_4", "when": "2019-09-27T00:23:30Z"}, {"anon": "stud", "to": "k107gzh4svy6zf", "type": "feedback", "uid_a": "a_5", "when": "2019-09-27T00:36:03Z"}, {"anon": "stud", "to": "k107gzh4svy6zf", "type": "feedback", "uid_a": "a_4", "when": "2019-09-27T00:40:32Z"}, {"anon": "stud", "to": "k107gzh4svy6zf", "type": "feedback", "uid_a": "a_6", "when": "2019-09-27T00:41:44Z"}, {"anon": "stud", "to": "k107gzh4svy6zf", "type": "feedback", "uid_a": "a_5", "when": "2019-09-27T00:52:04Z"}, {"anon": "no", "data": "k11su3kgegp6k2", "to": "k107gzh4svy6zf", "type": "s_answer", "uid": "gj3b0ds4tG4", "when": "2019-09-27T07:22:43Z"}, {"anon": "no", "data": "k12ou6vgtwf6v6", "type": "s_answer_update", "uid": "gj3b0ds4tG4", "when": "2019-09-27T22:18:35Z"}, {"anon": "stud", "to": "k107gzh4svy6zf", "type": "followup", "uid_a": "a_7", "when": "2019-09-28T04:44:08Z"}, {"anon": "stud", "to": "k107gzh4svy6zf", "type": "feedback", "uid_a": "a_7", "when": "2019-09-28T04:46:14Z"}, {"anon": "stud", "cid": "kz2w14pi8cd50l", "to": "k107gzh4svy6zf", "type": "followup", "uid_a": "a_8", "when": "2022-01-31T16:09:56Z"}], "children": [{"anon": "stud", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [{"anon": "no", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [], "config": {}, "created": "2019-09-26T18:23:38Z", "data": {"embed_links": null}, "folders": [], "id": "k11106jfj9l40o", "subject": "<p>I can&#39;t believe you just said this, did you even read OP&#39;s post? People not succeeding at Berkeley CS or having a hard time to succeed has nothing to do with self-confidence, but rather extremely high expectations for students that might not be properly prepared. Not all people come to Berkeley with the same knowledge and not everyone is good at the same things (some people are very good with theoretical CS but suck at systems and vice versa). Make up your mind, there is a reason why classes have to push their original deadlines sometimes (like 162 last week) and I guarantee you it has nothing to do with self-confidence issues in apparently 450 students that decided to take the class this semester. There are very hard expectations that are hard to meet for students that are also taking other classes and that might not have had the same exposure to CS that you had in the past. Stop being part of the problem and be considerate of your other peers with less experience or that have a harder time understanding the concepts in your classes</p>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "j84vts9t9a719k", "name": "Vivek Datta", "photo": null, "photo_url": null, "role": "student", "us": false}], "tag_good_arr": ["j84vts9t9a719k"], "type": "feedback", "uid": "is0vls53gakb4", "updated": "2019-09-26T18:23:38Z"}, {"anon": "stud", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [], "config": {}, "created": "2019-09-26T18:38:31Z", "data": {"embed_links": null}, "folders": [], "id": "k111jbhzs7x4lq", "subject": "<p>You are asking to lower the bar and expectations for all CS students. That notion is ridiculous and would be unfair to all CS/EECS grads that have gone through the same process. If anything it should be harder in order to weed out those who do not have what it takes to major in EECS/CS. You should major in something else if you think this is too tough for you.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_1", "updated": "2019-09-26T18:38:31Z"}, {"anon": "no", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [], "config": {}, "created": "2019-09-26T18:51:07Z", "data": {"embed_links": null}, "folders": [], "id": "k111ziomfdu17i", "subject": "<p>You are super elitist. In most countries that are not the US, CS is not taught in HS at all, and the ugrad career is not as popular as here. Even outside of California, CS is not that common either. You cannot just make it impossible and weed everyone out. There are ways to provide a challenging environment for students that want that challenging environment: stretch problems, side-projects, perhaps doing the optional readings and the problems of the book, doing research, taking grad courses, finishing hw early. The problem is that the minimum requirements and the deadlines for some courses (CS 162, CS 189 w/o Shewchuk, EE 126, etc) are highyly unmanageable for a big part of the student body in the CS department. If you want extra challenges they could be made available in courses the way I mentioned before, however, the amount of workload on some courses goes overboard and some students will end up teaching, having a midterm, a project and a homework, all in upper div courses, in a day or two. This is not healthy and the courses should not be made more difficult every semester to cater to the top 10% of classes</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "is0vls53gakb4", "updated": "2019-09-26T18:51:07Z"}, {"anon": "no", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [], "config": {}, "created": "2019-09-26T18:55:21Z", "data": {"embed_links": null}, "folders": [], "id": "k1124z7092q63", "subject": "<p>You cannot expect everyone to digest the material as fast as you and have the same preparation as you. Also, mind that a lot of students will have more difficulties digesting the material because for some courses there is not enough office hours and they are crammed with people working on projects. This only causes students that are behind or having a hard time to find it even harder to get the material and catch up. There is a problem of help provisioning and most students struggling with the material have nothing to do with incapability or self-confidence, but rather the lack of resources available to them and them coming from a different technical background</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "is0vls53gakb4", "updated": "2019-09-26T18:55:21Z"}, {"anon": "stud", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [], "config": {}, "created": "2019-09-26T19:09:54Z", "data": {"embed_links": null}, "folders": [], "id": "k112noje8ly1pr", "subject": "<p>The first anon is probably the most common response to students wanting ease Berkeley&#39;s difficulty. So we should probably get better at responding to this sort of criticism without insulting each other.</p>\n<p></p>\n<p>Here are my thoughts:</p>\n<p></p>\n<p>Let&#39;s ignore startups for now, because OP&#39;s point was that the lack of startups is due to lack of confidence. Helping boost students&#39; confidence should be the focus of this discussion.</p>\n<p><br />Personally, the classes I&#39;ve been most confident in were the ones in which I attended homework party regularly and worked on problems with friends often. The general consensus on how difficult a class is didn&#39;t really have an effect on my confidence. </p>\n<p></p>\n<p>I think this is because a large part of Berkeley CS is learning how to solve problems - what we are taught is essentially when to apply a certain approach. This means a growth mindset isn&#39;t about effort - it&#39;s about &#34;trying new strategies and seeking input from others when stuck.&#34; In a way, this is the definition of education when applied to <br />engineering.</p>\n<p></p>\n<p>I think that all our classes need to do is find a way to tell students “Let’s talk about what you’ve tried, and what you can try next.&#34; It took me forever to realize that to succeed in 61A, you just need to understand what tools you have access to and then how to combine tools to solve a problem. The students who succeed</p>\n<p>early on are the ones who tend to already think this way. Once you truly understand this, working with others and discussing problems isn&#39;t a huge necessity because you can do it in your head (the people who succeed by working solo don&#39;t understand the appeal of working in groups because they&#39;ve already understood this method of learning).</p>\n<p></p>\n<p>Basically everything here is from Carol Dweck&#39;s <a href=\"https://www.edweek.org/ew/articles/2015/09/23/carol-dweck-revisits-the-growth-mindset.html\" target=\"_blank\" rel=\"noopener noreferrer\">article</a> on the growth mindset - at this point, everyone&#39;s heard of growth vs fixed mindset, but it seems very few people have actually understood its implications for learning.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_2", "updated": "2019-09-26T19:09:54Z"}, {"anon": "no", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [], "config": {}, "created": "2019-09-26T21:07:50Z", "data": {"embed_links": null}, "folders": [], "id": "k116vckhuwo79p", "subject": "<p>In response to the very first comment, I think it would be more accurate to say that startups are more common at Stanford because starting around World War II, Stanford started giving people all of the workspace and resources they needed to start companies in exchange for stock in the companies. The university actively made themselves a natural place to start a company in Silicon Valley, and was much more positioned to do so than Berkeley since Stanford is private and thus has fewer restrictions on how they manage their money.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "jktvfof2jqx4j5", "updated": "2019-09-26T21:07:50Z"}, {"anon": "stud", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [], "config": {}, "created": "2019-09-27T00:41:44Z", "data": {"embed_links": null}, "folders": [], "id": "k11eif2chq7100", "subject": "<p>Re third anon, well, isn&#39;t the growth mindset really <a href=\"https://aeon.co/essays/schools-love-the-idea-of-a-growth-mindset-but-does-it-work\" target=\"_blank\" rel=\"noopener noreferrer\">dubious</a> on its efficiacy? </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_6", "updated": "2019-09-27T00:41:44Z"}], "config": {}, "created": "2019-09-26T16:48:42Z", "data": {"embed_links": null}, "folders": [], "id": "k10xm3qdcfp2w3", "no_answer": 0, "no_upvotes": 0, "subject": "<p>The reason the startup scene flourishes at Stanford is because the country&#39;s wealthy elite (mostly white) congregate there, not because of their courseload..</p>\n<p></p>\n<p>Also, Berkeley CS should not lower the bar just to help with your self-confidence issues.. You should go to a therapist for that.</p>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jz9gltnmf1358i", "name": "Andrew Lin", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jz9gltnmf1358i"], "type": "followup", "uid_a": "a_1", "updated": "2019-09-26T16:48:42Z"}, {"anon": "no", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [{"anon": "no", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [], "config": {}, "created": "2019-09-26T23:50:28Z", "data": {"embed_links": null}, "folders": [], "id": "k11coi1bkqv2md", "subject": "Thank you for sharing. I agree with ur sentiments; creating a startup involves a lot of heavy commitments (especially time). If students are constantly bogged down by work, then of course very few will try out creating their own company or real product in the little spare time they have. ", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "jjrg5e90hle587", "updated": "2019-09-26T23:50:28Z"}, {"anon": "stud", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [], "config": {}, "created": "2019-09-27T00:04:12Z", "data": {"embed_links": null}, "folders": [], "id": "k11d65f5hgi3np", "subject": "<p><em>&#34;If instead the department consisted only of people who were there because &#34;I just really love thinking about algorithms&#34; or &#34;I really love exploring different programming languages&#34;, etc. then I think there would be fewer of these extreme problems.&#34;</em></p>\n<p></p>\n<p>You&#39;re right in that for some students, the only goal of being at Berkeley is to get a degree. <strong>This might come as a shock to you, but most people come to college because they want to get a college degree.</strong></p>\n<p></p>\n<p>All snark aside, while I understand the intent behind your statements, I&#39;d just warn us all to be careful of making judgements of why people choose to study CS. Just because you love a subject doesn&#39;t take away from the burden of being a first-generation student taking out loans to be here, or being a non-traditional student with a family to support after graduation, etc. </p>\n<p></p>\n<p>Statements like the ones above heavily imply that it&#39;s wrong or shameful or impure to be taking financial considerations or other life factors into account while choosing what to study. <strong>Not everyone comes into this department with the type of safety net that allows them to just completely forget about &#39;real-world&#39; considerations and just focus solely on learning for learning&#39;s sake </strong>; rather, many people are acutely aware of the short-term and long-term consequences of the decisions they make as college students<strong>. </strong>Some students sacrifice and risk so much to be able to get that degree or study that subject in the first place.</p>\n<p><strong></strong></p>\n<p><strong>Let&#39;s not go around making moral judgements on our peers; at the end of the day, all of us come into this department from very diverse backgrounds and lived experiences, but leave with the same diploma in hand.</strong></p>\n<p></p>\n<p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2019-09-27T00:04:12Z"}], "config": {"editor": "rte"}, "created": "2019-09-26T21:02:10Z", "data": {"embed_links": null}, "folders": [], "id": "k116o1pj6lj3v3", "no_answer": 0, "no_upvotes": 0, "subject": "<p>.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "jktvfof2jqx4j5", "updated": "2019-09-26T21:02:10Z"}, {"anon": "stud", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [{"anon": "stud", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [], "config": {}, "created": "2019-09-27T00:36:03Z", "data": {"embed_links": null}, "folders": [], "id": "k11eb3vzw1y6x2", "subject": "<p>&#34;Stanford grads do well despite an easy curriculum because they’ve already cleared a very high admissions bar. Berkeley can’t do that, &#34;</p>\n<p></p>\n<p>I made this point in the AMA with Chancellor Christ yesterday, that we should increase our bar for admissions. Our campus resources are overstressed, and we should be enrolling less people. We should be admitting less people and devoting more resources to those who are, whether it&#39;s financial aid or on campus resources. If UCLA can do that, then so can we.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_5", "updated": "2019-09-27T00:36:03Z"}, {"anon": "stud", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [], "config": {}, "created": "2019-09-27T00:40:32Z", "data": {"embed_links": null}, "folders": [], "id": "k11egvpdm5u107", "subject": "We legally cannot do that. UCLA “raised its bar” because the number of applicants went way up. Unless that happens to us too, afaik we can’t shrink our incoming class.<div><br /></div><div>Also, I believe the absolute top end opportunities for business and stem careers are stil better for Berkeley than they are for la. </div>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_4", "updated": "2019-09-27T00:40:32Z"}, {"anon": "stud", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [], "config": {}, "created": "2019-09-27T00:52:04Z", "data": {"embed_links": null}, "folders": [], "id": "k11evpuxxa21e2", "subject": "<p>That&#39;s untrue. UCLA applications did go up in 2017, but not last year. Look at the following table. They enrolled 2,300 less people, a staggering 15% of its admitted class of 2018 this year.</p>\n<p></p>\n<p><img src=\"/redirect/s3?bucket=uploads&amp;prefix=attach%2Fhyq0br1u3kx7dg%2Fjwv9ymdgu4p13m%2Fk11ev6qhgqof%2FUC.png\" alt=\"\" /></p>\n<p><img src=\"/redirect/s3?bucket=uploads&amp;prefix=attach%2Fhyq0br1u3kx7dg%2Fjwv9ymdgu4p13m%2Fk11evmd491dl%2FUCS.png\" alt=\"\" /></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_5", "updated": "2019-09-27T00:52:04Z"}], "config": {}, "created": "2019-09-27T00:23:30Z", "data": {"embed_links": null}, "folders": [], "id": "k11duypyg64ui", "no_answer": 0, "no_upvotes": 0, "subject": "I’ll start by saying that I strongly disagree with your premise that Berkeley should become easier. Stanford grads do well despite an easy curriculum because they’ve already cleared a very high admissions bar. Berkeley can’t do that, and if you water down the curriculum you destroy a big part of why employers like Berkeley grads so much. You destroy much of Berkeley’s academic reputation. And perhaps more importantly, you meaningfully worsen their educational experience. I’ve done well in my classes here, but the number one thing that makes homeworks enjoyable for me here versus high school is that they’re not just busywork. Even for the top students, homework problems in a class like 70 or 170 are legitimately challenging.<div><br /></div><div>What needs to change is not Berkeleys curriculum, but rather people’s own expectations of themselves. Not being able to do a really difficult homework problem after hours of effort is *perfectly* ok. The problem doesn’t need to become easier, what needs to change is the culture of expecting to get everything correct right away. (And the nature of a 1000 person class is sure, some people will get it right away. Doesn’t mean you have to, some people are bound to be better at the material.)</div><div><br /></div><div>If you’re talking about final grades rather than the actual difficulty of the material, imo at least the grading in most cs classes is very fair. Most classes are curved to a B&#43;, and very few people score below a B-.</div>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_4", "updated": "2019-09-27T00:23:30Z"}, {"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2019-09-27T07:22:43Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "no", "content": "<p>Some thoughts about your post:</p>\n<ul><li><em>&#34;But I fear the difficulty is too much for others.&#34;<br /></em>Your entire post rests on this claim, but you will need to actually support this point with something to make a compelling argument. You fear this is too much for others—but that&#39;s not sufficient to support your point (otherwise the problem to solve would be resolving your fear itself).<br />Are the people you have in mind actually failing to succeed in some way in the long term, or merely struggling with self confidence in the beginning?<br />To be honest, your post currently reads like success stories in the making—you&#39;re worried about something going wrong in the long term, and yet your stories suggest that it&#39;s actually turning out fine in the end!</li><li>Nothing in the post seems CS-specific to me. Is CS too difficult compared to other majors? Do you have evidence to back your response to the previous question?<br />While I have limited familiarity with other departments and majors, my experience hasn&#39;t really suggested to me that ours is the most difficult one at Berkeley. I feel there are other majors that have more rough rides than CS, and yet, I do feel I disproportionately hear from CS. Of course there are a <em>lot</em> of things that could explain this, including the sheer class sizes, and including something I&#39;ll elaborate on below, but it&#39;s something that needs to be accounted for either way, whether we are to conclude that this department&#39;s courses are overly difficult or if (conversely) we&#39;re suggesting that there is a genuine problem across the whole university.</li><li>The comparison to Stanford doesn&#39;t really help the argument. It&#39;s hardly established that being big on startups is the Right Thing to do (though this doesn&#39;t imply it&#39;s the <em>wrong</em> thing to do either). Their approach obviously has upsides, but we could easily argue why that approach has downsides too. In the end, different places have different histories and personalities that make them do things differently, and each one has its own merits. Given the grass is always greener on the other side of the fence, I feel it doesn&#39;t really support the idea.</li></ul>\n<p></p>\n<p>Here is what I will say though: there <em>are</em> things that I feel <em>are</em> wrong in our department in particular. The most major one (not sure if pun intended?) is the major GPA threshold, which goes hand-in-hand with there being more students than the department seems to be able to handle well.</p>\n<p>As I see it, that is wrong in so many ways, including:</p>\n<ul><li>In principle: <em>no one</em> should have to go through College Admissions 2.0 just to pick your major after you&#39;ve already enrolled and paid tuition.</li><li>In terms of solving the intended problem: it&#39;s arguably unsustainable and delaying a problem that needs to be solved during admission.</li><li>In terms of collateral damage: it seems to me that it&#39;s been generating <em>far</em> too much stress and artificial competition and perceived difficulty between students that is <em>outside</em> the difficulty of the curriculum itself, and in all honesty, it seems plausible to me that if your friends are genuinely dismayed in the program, this may well be one of the root causes of the problem, rather than the course difficulty or something like that.<br />My reason: it&#39;s harder to become discouraged if doing poorly on a homework or an exam doesn&#39;t have a potentially catastrophic consequence lingering in front of you.</li><li>In terms of legality: I don&#39;t know much about law, but I can imagine at least a decent grilling in court, should Berkeley ever need to defend someone not being able to get into their major despite paying the tuition and coming in with that expectation.</li></ul>\n<p>IMHO,<em> no one</em> should have to put up with this, and honestly it&#39;s a testament to students&#39; resilience and patience (and their parents&#39;!) that they already do.</p>\n<p>However: before you get angry <em>at</em> the department, realize that they don&#39;t control everything here. In fact, the department has been unrealistically effective at adapting to the most unreasonable expectations thrown at them by entities that seem to be higher up (potentially <em>far</em> higher up, potentially all the way to the state government level).</p>\n<p>That&#39;s not to say the department doesn&#39;t play a role, but my point is, it&#39;s a complicated mess, and the solution is going to be far, far more complicated than &#34;make things easier&#34; or &#34;remove the cap&#34; or anything remotely similar to those. And in fact, approaches like those could well exacerbate a lot of issues instead of solving them.</p>\n<p><b>Edit</b><strong>:</strong> I had no clue, but it seems the chancellor already <a href=\"https://www.reddit.com/r/berkeley/comments/d8cvx2/i_am_uc_berkeley_chancellor_carol_christ_ask_me/f1fudz7/\" target=\"_blank\" rel=\"noopener noreferrer\">explained this in more detail than I was aware of on Reddit yesterday,</a> so you should just read that instead.</p>", "created": "2019-09-27T22:18:35Z", "subject": "", "uid": "gj3b0ds4tG4"}, {"anon": "no", "content": "<p>Some thoughts about your post:</p>\n<ul><li><em>&#34;But I fear the difficulty is too much for others.&#34;<br /></em>Your entire post rests on this claim, but you will need to actually support this point with something to make a compelling argument. You fear this is too much for others—but that&#39;s not sufficient to support your point (otherwise the problem to solve would be resolving your fear itself).<br />Are the people you have in mind actually failing to succeed in some way in the long term, or merely struggling with self confidence in the beginning?<br />To be honest, your post currently reads like success stories in the making—you&#39;re worried about something going wrong in the long term, and yet your stories suggest that it&#39;s actually turning out fine in the end!</li><li>Nothing in the post seems CS-specific to me. Is CS too difficult compared to other majors? Do you have evidence to back your response to the previous question?<br />While I have limited familiarity with other departments and majors, my experience hasn&#39;t really suggested to me that ours is the most difficult one at Berkeley. I feel there are other majors that have more rough rides than CS, and yet, I do feel I disproportionately hear from CS. Of course there are a <em>lot</em> of things that could explain this, including the sheer class sizes, and including something I&#39;ll elaborate on below, but it&#39;s something that needs to be accounted for either way, whether we are to conclude that this department&#39;s courses are overly difficult or if (conversely) we&#39;re suggesting that there is a genuine problem across the whole university.</li><li>The comparison to Stanford doesn&#39;t really help the argument. It&#39;s hardly established that being big on startups is the Right Thing to do (though this doesn&#39;t imply it&#39;s the <em>wrong</em> thing to do either). Their approach obviously has upsides, but we could easily argue why that approach has downsides too. In the end, different places have different histories and personalities that make them do things differently, and each one has its own merits. Given the grass is always greener on the other side of the fence, I feel it doesn&#39;t really support the idea.</li></ul>\n<p></p>\n<p>Here is what I will say though: there <em>are</em> things that I feel <em>are</em> wrong in our department in particular. The most major one (not sure if pun intended?) is the major GPA threshold, which goes hand-in-hand with there being more students than the department seems to be able to handle well.</p>\n<p>As I see it, that is wrong in so many ways, including:</p>\n<ul><li>In principle: <em>no one</em> should have to go through College Admissions 2.0 just to pick your major after you&#39;ve already enrolled and paid tuition.</li><li>In terms of solving the intended problem: it&#39;s arguably unsustainable and delaying a problem that needs to be solved during admission.</li><li>In terms of collateral damage: it seems to me that it&#39;s been generating <em>far</em> too much stress and artificial competition and perceived difficulty between students that is <em>outside</em> the difficulty of the curriculum itself, and in all honesty, it seems plausible to me that if your friends are genuinely dismayed in the program, this may well be one of the root causes of the problem, rather than the course difficulty or something like that.<br />My reason: it&#39;s harder to become discouraged if doing poorly on a homework or an exam doesn&#39;t have a potentially catastrophic consequence lingering in front of you.</li><li>In terms of legality: I don&#39;t know much about law, but I can imagine at least a decent grilling in court, should Berkeley ever need to defend someone not being able to get into their major despite paying the tuition and coming in with that expectation.</li></ul>\n<p>IMHO,<em> no one</em> should have to put up with this, and honestly it&#39;s a testament to students&#39; resilience and patience (and their parents&#39;!) that they already do.</p>\n<p>However: before you get angry <em>at</em> the department, realize that they don&#39;t control everything here. In fact, the department has been unrealistically effective at adapting to the most unreasonable expectations thrown at them by entities that seem to be higher up (potentially <em>far</em> higher up, potentially all the way to the state government level).</p>\n<p>That&#39;s not to say the department doesn&#39;t play a role, but my point is, it&#39;s a complicated mess, and the solution is going to be far, far more complicated than &#34;make things easier&#34; or &#34;remove the cap&#34; or anything remotely similar to those. And in fact, approaches like those could well exacerbate a lot of issues instead of solving them.</p>", "created": "2019-09-27T07:22:43Z", "subject": "", "uid": "gj3b0ds4tG4"}], "history_size": 2, "id": "k11su3k61jy6k1", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvfof2jqx4j5", "name": "Jon Hillery", "photo": "1536631838_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/jktvfof2jqx4j5/1536631838_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"hyq0br1u3kx7dg": 1548279114}, "facebook_id": null, "id": "iy0l2muelq84t9", "name": "Tarun", "photo": "1584659390_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/iy0l2muelq84t9/1584659390_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"global": 1553809534, "j5zp8esecm31rr": 1513138336, "jkjku77a1h451b": 1536436466, "jps21q5aago51y": 1553809456, "jza9erz2ojy3qr": 1576486118, "k509eg2kx302ol": 1583277374}, "facebook_id": null, "id": "j6nu3zjqzc63t8", "name": "Rachel De Jaen", "photo": "1549844268_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/j6nu3zjqzc63t8/1549844268_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p6y4cble5r5", "name": "Dinesh Parimi", "photo": "1536104810_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/is6p6y4cble5r5/1536104810_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6kj5diz672n1", "name": "Dylan Alberto Chima-Sanchez", "photo": "1548713323_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/j6kj5diz672n1/1548713323_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "ijj65y73ymb5i", "name": "Amy Mendelsohn", "photo": null, "photo_url": null, "published": true, "role": "", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p84nlmub6nj", "name": "Timothy Liu", "photo": "1514331656_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/is6p84nlmub6nj/1514331656_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "ipxjx49hzgs1di", "name": "Jennifer Zou", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvhopc26l6a8", "name": "Laiming Huang", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jz9gltnmf1358i", "name": "Andrew Lin", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["jktvfof2jqx4j5", "iy0l2muelq84t9", "j6nu3zjqzc63t8", "is6p6y4cble5r5", "j6kj5diz672n1", "ijj65y73ymb5i", "is6p84nlmub6nj", "ipxjx49hzgs1di", "jktvhopc26l6a8", "jz9gltnmf1358i"], "type": "s_answer"}, {"anon": "stud", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [{"anon": "stud", "bucket_name": "Week 9/22 - 9/28", "bucket_order": 139, "children": [], "config": {}, "created": "2019-09-28T04:46:14Z", "data": {"embed_links": null}, "folders": [], "id": "k132op7k9an49u", "subject": "<p>Not to mention a lot of CS classes are giving out 40% A and A&#43; in recent semesters...</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_7", "updated": "2019-09-28T04:46:14Z"}], "config": {}, "created": "2019-09-28T04:44:08Z", "data": {"embed_links": null}, "folders": [], "id": "k132lznqac22ge", "no_answer": 0, "no_upvotes": 0, "subject": "<p>A lot of people talked about CS experience before college, but Berkeley had been putting a lot of effort on this ! We have CS10 and Data8 to help student who wants additional exposure, plus CSM&#39;s help. Lowering standard definitely won&#39;t solve the problem. We should instead look at the positive part.  </p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_7", "updated": "2019-09-28T04:44:08Z"}, {"anon": "stud", "bucket_name": "Week 1/30 - 2/5", "bucket_order": 16, "children": [], "config": {"editor": "rte"}, "created": "2022-01-31T16:09:56Z", "data": {"embed_links": null}, "folders": [], "id": "kz2w14pi8cd50l", "no_answer": 0, "no_upvotes": 0, "subject": "<p>A message to future CS students:</p>\n<p></p>\n<div>\n<p dir=\"ltr\">I graduated from a terrible Oakland High School before coming to Berkeley. I mean terrible! 15 of us graduated that year, maybe less. Then I came to Berkeley and went through Admissions 2.0 to declare a major in CS. I studied CS because when I looked at the list of majors offered at Berkeley my first real thought was, &#34;Wow, the rest of these look boring AF!&#34; So I chose CS as my major and Math as my backup major incase things went South.</p>\n</div>\n<p dir=\"ltr\"></p>\n<div>\n<p dir=\"ltr\">What a stressful four years! And no one in my family believed me until a student on another campus killed himself.</p>\n</div>\n<p dir=\"ltr\"></p>\n<div>\n<p dir=\"ltr\">Here&#39;s my point: I am from a community of people that rarely get the things we hope for. So I planned for failure. Whatever the solution is, they won&#39;t find it before you declare OR before you graduate. And a lot of people won&#39;t acknowledge your struggle until you&#39;re long gone. It&#39;s time to move on.</p>\n</div>\n<p dir=\"ltr\"></p>\n<div>\n<p dir=\"ltr\">When you get to Berkeley your past goes out the window and the wheels start moving quick on this new adventure. If I, a student with very little education in basic math and nothing in CS because of my bad High School, can find the grit and will to declare, graduate, and find a job in my field then anyone with passion or determination can too.</p>\n</div>\n<p dir=\"ltr\"></p>\n<div>\n<p dir=\"ltr\">Sure, join CS for the money afterwards. That&#39;s fine. That just needs to be a strong enough thought and desire to motivate you to push past 2am and keep going. There will be many 2am&#39;s that you&#39;ll need to get through. All anyone is saying is that usually when 2am hits, you&#39;ve made 0 progress from where you were 24 hours ago, all your slip days are gone and the project is due tomorrow it&#39;s usually a passion and love for CS that gets you through it, not usually the thought that 3-5 years from now I&#39;ll have a well paying job.</p>\n</div>\n<p dir=\"ltr\"></p>\n<div>\n<p dir=\"ltr\">But I&#39;m not criticizing anyone for why they study CS. I&#39;m just telling you that whatever the reason, it has to be enough to motivate you because nothing will change in time for you to notice or care.</p>\n</div>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_8", "updated": "2022-01-31T16:09:56Z"}], "config": {}, "created": "2019-09-26T04:36:54Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["other"], "history": [{"anon": "stud", "content": "<p>I am currently a senior student and was helping a friend with homework for a CS class. I however noticed he was distraught with the homework and he didn&#39;t think he would be able to finish in time. And if this was the first homework, how would he be able to do all the other homeworks, and the tests, questioning why did he try to become a CS major in the first place.</p>\n<p></p>\n<p>He really enjoyed math in high school and CS made good money so it was a perfect reason to major in CS. I did so for the exact same reason and I&#39;m sure many other students did so as well.</p>\n<p></p>\n<p>I told me it would be ok, I had been in the same place, many times in the class I had felt lost and hopeless, but I was able to push through the difficulties and pass. Many other students had been in the same place as well, but they had all pushed through it and passed.</p>\n<p></p>\n<p>I had another friend that I encouraged to apply to Google. He didn&#39;t really want to because he thought he warn&#39;t good enough and he had no shot to get in. I had been in the same place before, I had applied to another big company and didn&#39;t think I would get in. But I still did it on the slim chance it could happen. I did get an interview which I was super nervous about and thought I would fail, but still did it. Even after the interview I thought I had failed and would have to continue looking for another internship. But to my surprise, and I&#39;m still surprised, I passed and was offered an internship. I was so happy I told all my friends and they congratulated me telling me they knew I had it in me even when I didn&#39;t believe it. Just try and you never know.</p>\n<p></p>\n<p>My point is I&#39;ve noticed this is so common with Berkeley students. It&#39;s so difficult it crushes people&#39;s confidence. As a senior, I&#39;ve experienced that I can do it if I push through and believe in myself. But I fear the difficulty is too much for others. My friend who I recommend to apply to Google, I know he can do it, but he doesn&#39;t believe in himself. My friend who struggles in the CS class, I know he can pass the class.</p>\n<p></p>\n<p>Berkeley CS teaches tenacity and grit, incredible skills for life. But tenacity and grit mean nothing if you lose confidence to try new hard things, to do the things worth struggling for.</p>\n<p></p>\n<p>People joke about Stanford, how once you&#39;re in it&#39;s a breeze, you ride the grade inflation, and get internships practically handed to you. Of course this isn&#39;t the case, but I don&#39;t think the difficulty is as bad as Berkeley CS, or at least you have a better TA to student ratio to help students when they are struggling.</p>\n<p></p>\n<p>Why are Startups such a big thing at Stanford? Startups require huge confidence and irrational belief you can take on the world and win. Startups in practice are filled with difficult trenches where you need tenacity and grit to keep pushing through. Berkeley CS teaches this but it feels like Berkeley crushes you so hard you lose the freshman confidence you will change the world and go ing through the struggle of being right. Stanford puts you through the tests, but never crushes you that you lose that dream to change the world.</p>\n<p></p>\n<p>I was able to surpass the struggles, I went to counseling because CS 162 was so difficult and I didn&#39;t know if I would be able to finish the projects. And this was after I had the confidence boost from interning at a dream company. Even know, I am taking easier classes but they are still difficult. At least now I have the confidence that I can work through and succeed.</p>\n<p></p>\n<p>It makes me sad is there are so many bright Berkeley students that lose their passion, their dream, their confidence as they face the difficulties of Berkeley CS. Some decide CS isn&#39;t for them and never look at it again as their experiences were too painful. For you freshman doubting yourselves in CS 61A, YOU CAN DO IT. We have all been there.</p>\n<p></p>\n<p>I feel Berkeley CS doesn&#39;t have to be so difficult. Yes, I&#39;ve learned a lot. I went from knowing no CS to becoming proficient in just 4 years which is crazy to me. But I could have learned it with it being easier and not as frustrating. Spending 4 hours on a problem and trying different methods of help but still not being to solve it is demoralizing. This can be better and hopefully help Berkeley students hold that passion, and make a positive difference in the world.</p>\n<p></p>\n<p><a href=\"https://www.reddit.com/r/cscareerquestions/comments/67mdln/berkeleys_cs61b_is_difficult_af/\">https://www.reddit.com/r/cscareerquestions/comments/67mdln/berkeleys_cs61b_is_difficult_af/</a><a href=\"https://www.reddit.com/r/cscareerquestions/comments/67mdln/berkeleys_cs61b_is_difficult_af/\"></a></p>\n<p></p>\n<p><a href=\"https://nymag.com/intelligencer/2019/09/how-to-network-through-stanford-university.html\">https://nymag.com/intelligencer/2019/09/how-to-network-through-stanford-university.html</a></p>", "created": "2019-09-26T04:36:54Z", "subject": "Berkeley&#39;s Difficulty is Detrimental to Berkeley", "uid_a": "a_0"}], "history_size": 1, "i_edits": [], "id": "k107gzh4svy6zf", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 10301, "num_favorites": 30, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654545717023, "tag_good": [{"admin": false, "endorser": {"global": 1542387698, "j6bczj0pmoo4mk": 1512278032, "jaepthp7wf44nh": 1525327897, "jkieu4nv1t55g8": 1538161283, "jr1f3sutei62un": 1550805110, "jz2c8op4xqq4z3": 1576298894}, "facebook_id": null, "id": "ixwrh8mz7qt1nn", "name": "Brian Hung", "photo": null, "photo_url": null, "role": "student", "us": false}, {"admin": false, "endorser": {"global": 1619985606, "j9ladzzp4wmh": 1524243875, "jyq487ctcwuk8": 1571117164}, "facebook_id": null, "id": "is6p9a8vasskl", "name": "Alex Thomas", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"global": 1555916150, "jpslgn3m4lsk6": 1550591579, "jr9vegl92h23af": 1554699626, "jw6kndsic346lm": 1563171921, "jyz1vzhx2on2wq": 1570078500}, "facebook_id": null, "id": "j3jk4zjmiay6xs", "name": "Wesley Deng", "photo": "1567572313_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/j3jk4zjmiay6xs/1567572313_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jv62jqtohi06uz", "name": "Andrew White", "photo": null, "photo_url": null, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "iy2fd7c99x41w5", "name": "Randy Fan", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "ipf2ezhjrt956a", "name": "Urvi Guglani", "photo": "1520734378_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/ipf2ezhjrt956a/1520734378_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "idrin4yxhispa", "name": "Lakshya Jain", "photo": "1474747210_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/idrin4yxhispa/1474747210_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvex6279x3zb", "name": "Maxwell Chen", "photo": "1579165146_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jktvex6279x3zb/1579165146_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jl5p1gz8iux6ah", "name": "Kayla Luna", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6nu3l1tkcr3k5", "name": "Owen Bai", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jc88lkur5zo23j", "name": "Gregory Jerian", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6vdgnbhgcc2to", "name": "David Yi", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6wdztpg2l2v0", "name": "Ryan Deng", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p8k3kizno", "name": "Brian Ho", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"inpjqrbfv3n67o": 1}, "facebook_id": null, "id": "ib1dv5jrbcc12j", "name": "Steven Lin", "photo": "1508577785_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/ib1dv5jrbcc12j/1508577785_35.png", "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p815tz306kj", "name": "Averal Kandala", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is0vls53gakb4", "name": "Rafael A. Felix Mendez", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6d4uldivan68h", "name": "Jason Jiang", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvgthztc95d5", "name": "Joycelin Liaw", "photo": "1632629480_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jktvgthztc95d5/1632629480_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"jhw82c92o5p1dh": 1532404312}, "facebook_id": null, "id": "hzd1lb5fiuc2sq", "name": "Nimalen Sivapalan", "photo": "1456610056_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/hzd1lb5fiuc2sq/1456610056_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jjrg5e90hle587", "name": "Akhil Sharma", "photo": "1549038388_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/jjrg5e90hle587/1549038388_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"ji0gwp9m57omr": 1544911320, "jw6kndsic346lm": 1564280741}, "facebook_id": null, "id": "j6nu5gnx9ya4tl", "name": "Sanchit Kapoor", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jl4it1hygcw2rz", "name": "Stephen Yang", "photo": null, "photo_url": null, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6lew05k7pb2ir", "name": "Annie Zhang", "photo": "1566875739_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/j6lew05k7pb2ir/1566875739_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvieq29la703", "name": "Labanya Mukhopadhyay", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"global": 1570093295, "jq33x9vemkj5xj": 1550003048, "jxzgoek4x4j4u6": 1570093295}, "facebook_id": null, "id": "jjm5sqotm026wq", "name": "shoumik", "photo": "1617229401_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jjm5sqotm026wq/1617229401_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"global": 1540863270, "jk0lkpnwfvy29g": 1536629358, "jkjku77a1h451b": 1535513008, "jq44ivlnyun5jd": 1550358717, "jv2vuii0vhwgy": 1572390260}, "facebook_id": null, "id": "iptcfdj3fri51o", "name": "Tyler Zhu", "photo": "1630624212_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/iptcfdj3fri51o/1630624212_200.jpg", "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p7lai7g669b", "name": "Ariel Hirschberg", "photo": "1579576991_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/is6p7lai7g669b/1579576991_200.jpg", "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is0qs3i1eg729a", "name": "Bardia Barahman", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j62qn8lp70n2wj", "name": "Nick Bourlier", "photo": "1506810236_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/j62qn8lp70n2wj/1506810236_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"jkjku77a1h451b": 1541309987}, "facebook_id": null, "id": "j6lew3t2yx2kw", "name": "Julia Yu", "photo": "1580518625_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/j6lew3t2yx2kw/1580518625_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvhopc26l6a8", "name": "Laiming Huang", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p8jylx2fl", "name": "Xinyun Zhang", "photo": null, "photo_url": null, "role": "student", "us": false}, {"admin": false, "endorser": {"jkjt85cc6fc4jx": 1538388286, "jqr7hfmf4v74e": 1549790163}, "facebook_id": null, "id": "jktvffh6kow4cy", "name": "Praveen Batra", "photo": "1581148970_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jktvffh6kow4cy/1581148970_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j5x7odf43ze772", "name": "Dhanush Patel", "photo": "1503736904_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/j5x7odf43ze772/1503736904_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jgzrvhr0eop6on", "name": "Vidhan Jain", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p6nezwwv5jd", "name": "Aryana Shabestari", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "ipxjx49hzgs1di", "name": "Jennifer Zou", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jyjlc51vyz21x8", "name": "Farhad Alemi", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6fsddab80l55o", "name": "Xinlin Zhou", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvhcjpozd5xg", "name": "Atharva Mehendale", "photo": "1596323170_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jktvhcjpozd5xg/1596323170_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jxe5fr1xbyh10k", "name": "Kyle Zhang", "photo": "1600390869_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jxe5fr1xbyh10k/1600390869_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"jc9f97h7meo5pq": 1521433550}, "facebook_id": null, "id": "j52tu6m8x47le", "name": "Rahul Rathi", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvgw2lrsc5g2", "name": "Aditya Ramkumar", "photo": null, "photo_url": null, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j84vts9t9a719k", "name": "Vivek Datta", "photo": null, "photo_url": null, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jwv9tv79yyn5ok", "name": "Agam Jolly", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jzkuzswa1f86qr", "name": "Yash", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jl3yd63s27551w", "name": "Namrata Kantamneni", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvfscfmpf4ma", "name": "Sonali Loomba", "photo": "1594783523_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jktvfscfmpf4ma/1594783523_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jyeqkpt0e8023s", "name": "Lucy Wan", "photo": "1599950541_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jyeqkpt0e8023s/1599950541_200.jpg", "published": true, "role": "student", "us": false}], "tag_good_arr": ["ixwrh8mz7qt1nn", "is6p9a8vasskl", "j3jk4zjmiay6xs", "jv62jqtohi06uz", "iy2fd7c99x41w5", "ipf2ezhjrt956a", "idrin4yxhispa", "jktvex6279x3zb", "jl5p1gz8iux6ah", "j6nu3l1tkcr3k5", "jc88lkur5zo23j", "j6vdgnbhgcc2to", "is6wdztpg2l2v0", "is6p8k3kizno", "ib1dv5jrbcc12j", "is6p815tz306kj", "is0vls53gakb4", "j6d4uldivan68h", "jktvgthztc95d5", "hzd1lb5fiuc2sq", "jjrg5e90hle587", "j6nu5gnx9ya4tl", "jl4it1hygcw2rz", "j6lew05k7pb2ir", "jktvieq29la703", "jjm5sqotm026wq", "iptcfdj3fri51o", "is6p7lai7g669b", "is0qs3i1eg729a", "j62qn8lp70n2wj", "j6lew3t2yx2kw", "jktvhopc26l6a8", "is6p8jylx2fl", "jktvffh6kow4cy", "j5x7odf43ze772", "jgzrvhr0eop6on", "is6p6nezwwv5jd", "ipxjx49hzgs1di", "jyjlc51vyz21x8", "j6fsddab80l55o", "jktvhcjpozd5xg", "jxe5fr1xbyh10k", "j52tu6m8x47le", "jktvgw2lrsc5g2", "j84vts9t9a719k", "jwv9tv79yyn5ok", "jzkuzswa1f86qr", "jl3yd63s27551w", "jktvfscfmpf4ma", "jyeqkpt0e8023s"], "tags": ["other", "student"], "type": "question", "unique_views": 1025}