{"bookmarked": 8, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "k1v4s2jfdph22f", "type": "create", "uid_a": "a_0", "when": "2019-10-17T20:02:23Z"}, {"anon": "stud", "data": "k1v7e1qx8vd448", "to": "k1v4s2jcsc822e", "type": "s_answer", "uid_a": "a_1", "when": "2019-10-17T21:15:28Z"}, {"anon": "no", "to": "k1v4s2jcsc822e", "type": "followup", "uid": "jktvhsa2ggv6dj", "when": "2019-10-19T22:49:17Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2019-10-17T21:15:28Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>I&#39;m currently taking CS W186, CS C100, and CS 170. My experience so far may or may not be applicable to other professors, semesters, and is dependent on which courses you&#39;ve taken previously. Also, this is only the middle of the semester, so I&#39;ve only seen half of what&#39;s to come. </p>\n<p></p>\n<p>Question 1:</p>\n<p>I can&#39;t really speak to how applicable the skills you build in CS W186 and CS C100 are to internships/recruiting (hasn&#39;t come up). That said, my intuition says that the CS W186 would be more helpful. The coding assignments in CS W186 require you to quickly become familiar with existing code and read documentation before you are able to implement your own functions. Further, the material taught in the course (SQL, Memory, B&#43; Trees, Query parsing) seem more relevant to software engineering.</p>\n<p></p>\n<p>In CS C100, you use Pandas to manipulate data and draw meaningful conclusions from that. However, the format of and analysis in these assignments is very structured in that it leads you to conclusions rather than making you draw them yourselves. There is significant value in the material covered in this course, but comparatively less than CS W186 in regards to software engineering.</p>\n<p></p>\n<p>Question 2:</p>\n<p>To preface this, I have taken CS 61A/B/C, CS 70, EE16A/B, all of which have made these classes easier than they would be otherwise. CS170 earns it&#39;s reputation as being notoriously hard, and I can&#39;t imagine the difficulty curve without having taken CS 70. My initial reaction says that either of the classes would pale in comparison difficulty-wise (conceptually and workload) next to a CS 170 taken under those circumstances. Though it&#39;s just weekly homeworks and exams, every problem requires some level of mental gymnastics.</p>\n<p></p>\n<p>CS W186 features a heavy emphasis on weekly edX assignments and bi-monthly homework assignments that you have about a week to complete. The edX assignments require a basic understanding of the material, and the homework often requires significant understanding of the material. The exams are like the edX assignments, but test your understanding of the material thoroughly but fairly. As this is an online class, you have to keep yourself on track and pace your learning in this course, or else you&#39;ll fall behind.</p>\n<p></p>\n<p>CS C100 has weekly labs (1 - 2 hour guided coding assignment), vitamins (short quizzes), and bi-monthly homeworks (2 - 5 hour guided coding assignments). Collectively, these build your understanding of the lecture and textbook material up for the exams. Like in CS W186, the exams are very fair, but do require understanding and practice. Though there&#39;s a similar amount of material as there is in CS W186, the topics here are not as directly connected do not build on each other.</p>\n<p></p>\n<p>In short: CS W186 is probably more helpful for software engineering and internships, but is, in my opinion, harder. If you want more time to dedicate to CS 170, I&#39;d take CS C100. But if you want to maximize how much you  ̶s̶u̶f̶f̶e̶r̶  learn, then take CS W186. </p>\n<p></p>", "created": "2019-10-17T21:15:28Z", "subject": "", "uid_a": "a_1"}], "id": "k1v7e1qpkc3447", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvex6279x3zb", "name": "Maxwell Chen", "photo": "1579165146_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jktvex6279x3zb/1579165146_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j9u9cphgdri3nr", "name": "Priyam Mohanty", "photo": "1568403351_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/j9u9cphgdri3nr/1568403351_200.jpg", "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["jktvex6279x3zb", "j9u9cphgdri3nr"], "type": "s_answer"}, {"anon": "no", "bucket_name": "Week 10/13 - 10/19", "bucket_order": 23, "children": [], "config": {}, "created": "2019-10-19T22:49:17Z", "data": {"embed_links": null}, "folders": [], "id": "k1y5me6knidas", "no_answer": 0, "no_upvotes": 0, "subject": "<p>&#43;1 to Student answer^, but really consider taking 61C and 70 before taking those courses. Not only are they prerequisites to most upper divs, including the ones you mentioned you&#39;re interested in, but you also shouldn&#39;t underestimate the workload of any one of those courses. You also mentioned taking 61C, 70, and and upper div in the summer? I hope that means over multiple summers, because otherwise that sounds pretty impossible to do in one summer. I did 70 with an R1B course over the summer, and I didn&#39;t sleep much or do anything fun for the whole duration of the summer session. You may very well be a star student, but 61C is quite a monster in terms of workload and 70 taught over the summer is a lot of information to take in during so little time. This sounds extremely overwhelming not to mention taking an upper div on top of all of that. I know many students who took either 61C or 70 <strong>alone</strong> during the summer and dropped last minute--the workload of just one summer course is far from trivial, especially for those.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "jktvhsa2ggv6dj", "updated": "2019-10-19T22:49:17Z"}], "config": {}, "created": "2019-10-17T20:02:23Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["other", "enrollments", "faculty_advising", "cs-intended"], "history": [{"anon": "stud", "content": "<p>Hello! I&#39;m in a bit of unique situation: non-CS senior wanting to take crucial classes to prepare for recruiting for a tech internship.</p>\n<p></p>\n<p>At the moment, I am debating btwn taking either CS W186 or CS C100 while balancing the courseload for CS170.</p>\n<p></p>\n<p><strong>I&#39;d like to ask this community about:</strong></p>\n<p><strong>- Which of the two courses (CS W186 or CS C100) would you consider more &#34;essential&#34; to becoming a software engineer / landing a tech internship?</strong></p>\n<p><strong>- How is the courseload of CS W186 or CS C100 in relation to CS170, since I would be taking them together?</strong></p>\n<p><strong></strong></p>\n<p>For more information:</p>\n<p>I haven&#39;t taken CS61C or CS70 yet but I&#39;m planning to take CS170 for sure next semester (I know that CS70 is a prereq but I&#39;m currently emailing professors about taking it anyways). Because I want to keep the option of finishing the CS minor in the summer (in case I don&#39;t get a summer internship), I would take CS61C, CS70, and one more upper division course <em><strong>in the summer.</strong></em></p>", "created": "2019-10-17T20:02:23Z", "subject": "CS W186 or CS C100?", "uid_a": "a_0"}], "i_edits": [], "id": "k1v4s2jcsc822e", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 10445, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654545568189, "tag_good": [], "tag_good_arr": [], "tags": ["cs-intended", "enrollments", "faculty_advising", "other", "student"], "type": "question", "unique_views": 338}