{"bookmarked": 6, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "k229564atx24o3", "type": "create", "uid_a": "a_0", "when": "2019-10-22T19:38:56Z"}, {"anon": "stud", "data": "k229a01oz436ff", "type": "update", "uid_a": "a_0", "when": "2019-10-22T19:42:42Z"}, {"anon": "stud", "to": "k2295647bf4o2", "type": "followup", "uid_a": "a_1", "when": "2019-10-22T20:00:03Z"}, {"anon": "stud", "to": "k2295647bf4o2", "type": "feedback", "uid_a": "a_1", "when": "2019-10-22T20:01:14Z"}, {"anon": "no", "to": "k2295647bf4o2", "type": "followup", "uid": "is9ein4lpno52m", "when": "2019-10-22T20:50:53Z"}, {"anon": "stud", "to": "k2295647bf4o2", "type": "feedback", "uid_a": "a_0", "when": "2019-10-24T02:16:25Z"}, {"anon": "no", "to": "k2295647bf4o2", "type": "feedback", "uid": "is9ein4lpno52m", "when": "2019-10-24T02:52:15Z"}, {"anon": "stud", "to": "k2295647bf4o2", "type": "feedback", "uid_a": "a_2", "when": "2019-11-02T20:31:32Z"}], "children": [{"anon": "stud", "bucket_name": "Week 10/20 - 10/26", "bucket_order": 22, "children": [{"anon": "stud", "bucket_name": "Week 10/20 - 10/26", "bucket_order": 22, "children": [], "config": {}, "created": "2019-10-22T20:01:14Z", "data": {"embed_links": null}, "folders": [], "id": "k229xum0gdq5xt", "subject": "<p>Same poster^: Also, sorry about not being able to recommend classes, but hopefully that question will be answered after engaging in just a few conversations and research texts.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_1", "updated": "2019-10-22T20:01:14Z"}], "config": {}, "created": "2019-10-22T20:00:03Z", "data": {"embed_links": null}, "folders": [], "id": "k229wbuh6b04ib", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Posting down here because I am not planning to get a PhD in CS (someone who is should also comment), but I am preparing to get a PhD/go into academia in another field using my CS degree as an interdisciplinary means for research. I think you should talk to faculty or doctorate students if you can. The only way I could begin to get a sense of the kind of thing I wanted to commit to doing (I&#39;m sure are well aware of the kind of a commitment financially, physically, mentally a PhD is), was to talk to people who had been through it and had a good sense of the people, programs, and research involved. Just applying is a process on its own, but since you have been doing research you probably have at least the acquiring LoRs, some connections, people, etc. component down. Make sure you consult with your faculty connections if you have them, or make them now as much as you can. The professors I&#39;ve spoken to and continue to consult with regularly help me figure out what I am interested, who to talk to, what concepts to learn, and where to apply. I wouldn&#39;t stress this as much were you to, say, do the 5th year MS program, as while there is a strong research component to it, applying to and doing a PhD is typically a much greater effort. Also, keep in mind you would have to identify a research interest that you can commit to over 4-5&#43; years, invest money into it, use your passion for this particular research question to get people to give lots of grant money to you, appeal to professors who get a lot of demand from grads who want them to be their adviser, etc.</p>\n<p></p>\n<p>It seems from your questions about classes that you have some time but also some way to go in terms of identifying this interest: I would say talk to professors (from other schools as well, if there is someone elsewhere who aligns more with your research interests), get them to recommend research, dissertations, etc. scholarly texts that you can read to get a sense of the current academic/industry climate in ML and the open questions you are interested in answering. Then go back to those people and discuss this, and they may even become invested in you enough to write letters of rec., and provide other misc. support (which you will need for a PhD). Your application and career as a PhD will likely be dependent on other individuals and specific areas of ML research--try to insert yourself into this space now if possible.</p>\n<p></p>\n<p>TL;DR: Talk to people, read stuff, talk to people. Try to do it before senior year when you have to apply.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_1", "updated": "2019-10-22T20:00:03Z"}, {"anon": "no", "bucket_name": "Week 10/20 - 10/26", "bucket_order": 22, "children": [{"anon": "stud", "bucket_name": "Week 10/20 - 10/26", "bucket_order": 22, "children": [], "config": {}, "created": "2019-10-24T02:16:25Z", "data": {"embed_links": null}, "folders": [], "id": "k242s69k6724da", "subject": "<p>Interesting. In your opinion, how important/fundamental is Math 104 to ML? I&#39;ll probably switch around my schedule too if it&#39;s incredibly high workload. I don&#39;t want to die haha.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_0", "updated": "2019-10-24T02:16:25Z"}, {"anon": "no", "bucket_name": "Week 10/20 - 10/26", "bucket_order": 22, "children": [], "config": {}, "created": "2019-10-24T02:52:15Z", "data": {"embed_links": null}, "folders": [], "id": "k24429ea6zrdl", "subject": "<p>Math104 is strongly recommended by the statistics department if you want to get a masters in statistics, and its basically required if you want a PhD in Statistics. Its also a prerequisite for Stat210A, which is the first year PhD level course about hypothesis testing. </p>\n<p>So I think its required for a lot of high level statistical thinking, especially in relation to probability theory (I was just told a relation about limits and sequences and the law of averages today which was interesting). </p>\n<p></p>\n<p>However, I don&#39;t think I&#39;ve actually taken (or got to ) the high enough level of ML courses to see the Math104 in use. It might depend on the subsection of ML you&#39;re working on, so in this case I think a professor in the field is a much better person to ask about this topic. </p>\n<p></p>\n<p>Also caveat: Math104 is very hard for me but I might not just the right person to wrap my head around this stuff. If you do take it, try to take it with someone who know and work well with, as this is a topic I&#39;ve found works best discussing concepts with others. </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "is9ein4lpno52m", "updated": "2019-10-24T02:52:15Z"}, {"anon": "stud", "bucket_name": "Week 10/27 - 11/2", "bucket_order": 21, "children": [], "config": {}, "created": "2019-11-02T20:31:32Z", "data": {"embed_links": null}, "folders": [], "id": "k2i0v6rjf2mlr", "subject": "<p>Is it a must to EECS 127 to do well in CS 189. I have taken Math 110 and Math54.Will that be enough?</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_2", "updated": "2019-11-02T20:31:32Z"}], "config": {}, "created": "2019-10-22T20:50:53Z", "data": {"embed_links": null}, "folders": [], "id": "k22bpolydh222r", "no_answer": 0, "no_upvotes": 0, "subject": "<p>EE127 and 189 are totally doable in the same semester (I did that last spring) but heads up adding Math104 to the mix can add a lot of work depending on the professor. Just be aware of what you&#39;re committing yourself to - that will be a lot of math, minus the coding parts of Shewchuk&#39;s homework assignments.</p>\n<p></p>\n<p>I am taking Math104 this fall with two other (lighter) techs and its incredibly difficult. I&#39;m taking it with Professor Rui Wang, and I really like her lectures, but its a hard subject (for me at least to wrap my head around). </p>\n<p></p>\n<p>I&#39;ve also taken Math110, and I really enjoyed it as I love linear algebra and it allowed me to delve deeply into slightly more theoretical aspects of the subject ( such as adjoint transformations) not covered in the more practical linear algebra of 127 and 189. However, if you don&#39;t love the subject, an depending on what other linear algebra courses you&#39;ve taken (54, 16ab etc), it may not be necessary after 127 and 189, but it is the course that made me the mathematical maturity to write proofs that I need today (though I took it before courses such as 127, 189 so again it might not be relevant if you were considering taking this after). </p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "is9ein4lpno52m", "updated": "2019-10-22T20:50:53Z"}], "config": {}, "created": "2019-10-22T19:38:56Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["eecs", "suggestion_box", "faculty_advising", "lscs"], "history": [{"anon": "stud", "content": "<p>I am currently a junior and want to pursue a PhD somewhere in the field of AI/ML (I know the field is very broad, but I don&#39;t know what I want to specialize in). I&#39;m also pursuing a physics minor (I was a double major but switched down). I&#39;ve seen all the various posts about course recommendations and there seems to be a lot of mixed reviews about what classes to take. I am currently doing research in ML, but I want to take classes that will best prepare me for a (hopefully) good program in the future.</p>\n<p></p>\n<p>Currently, this is what I have in terms of upper divs planned:</p>\n<p>Fall 2019: CS170, EE126, CS188</p>\n<p>Spring 2020: CS189, EE127, Math 104</p>\n<p>Fall 2020: CS182, CSC281A, (some other course idk)</p>\n<p>Spring 2021: I don&#39;t know</p>\n<p></p>\n<p>1. How useful is CS162? I took it off my course plan recently, because I have gotten the impression that it&#39;s not as useful as other classes considering my current goals.</p>\n<p></p>\n<p>2. Should I take Math 104 or Math 110? Or both? Or neither? Does my experience with math from physics make any of these redundant?</p>\n<p></p>\n<p>3. What other classes (both undergraduate and graduate) should I take to build a good foundation for the PhD in ML? </p>\n<p></p>\n<p>4. Even though I enjoy it, I don&#39;t want to be stuck doing math...ALL day. Will these courses give me a balance between math and coding (similar to how 188 is structured)? </p>", "created": "2019-10-22T19:42:42Z", "subject": "PhD ML/AI Course Recommendations", "uid_a": "a_0"}, {"anon": "stud", "content": "<p>I am currently a junior and want to pursue a PhD somewhere in the field of AI/ML (I know the field is very broad, but I don&#39;t know what I want to specialize in). I&#39;ve seen all the various posts about course recommendations and there seems to be a lot of mixed reviews about what classes to take. I am currently doing research in ML, but I want to take classes that will best prepare me for a (hopefully) good program in the future.</p>\n<p></p>\n<p>Currently, this is what I have in terms of upper divs planned:</p>\n<p>Fall 2019: CS170, EE126, CS188</p>\n<p>Spring 2020: CS189, EE127, Math 104</p>\n<p>Fall 2020: CS182, CSC281A, (some other course idk)</p>\n<p>Spring 2021: I don&#39;t know</p>\n<p></p>\n<p>1. How useful is CS162? I took it off my course plan recently, because I have gotten the impression that it&#39;s not as useful as other classes considering my current goals.</p>\n<p></p>\n<p>2. Should I take Math 104 or Math 110? Or both? Or neither? </p>\n<p></p>\n<p>3. What other classes (both undergraduate and graduate) should I take to build a good foundation for the PhD in ML? </p>\n<p></p>\n<p>4. Even though I enjoy it, I don&#39;t want to be stuck doing math...ALL day. Will these courses give me a balance between math and coding (similar to how 188 is structured)? </p>", "created": "2019-10-22T19:38:56Z", "subject": "PhD ML/AI Course Recommendations", "uid_a": "a_0"}], "i_edits": [], "id": "k2295647bf4o2", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 1, "no_answer_followup": 0, "nr": 10514, "num_favorites": 5, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654545443120, "tag_good": [], "tag_good_arr": [], "tags": ["eecs", "faculty_advising", "lscs", "student", "suggestion_box", "unanswered"], "type": "question", "unique_views": 476}