{"bookmarked": 8, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "k28hrlt8g8fvr", "type": "create", "uid_a": "a_0", "when": "2019-10-27T04:26:57Z"}, {"anon": "no", "to": "k28hrlt4lghvq", "type": "followup", "uid": "jl5gfwcvxxp6mr", "when": "2019-10-27T06:18:16Z"}, {"anon": "stud", "to": "k28hrlt4lghvq", "type": "followup", "uid_a": "a_1", "when": "2019-10-27T19:42:15Z"}, {"anon": "stud", "to": "k28hrlt4lghvq", "type": "followup", "uid_a": "a_2", "when": "2019-10-28T02:29:26Z"}], "children": [{"anon": "no", "bucket_name": "Week 10/20 - 10/26", "bucket_order": 91, "children": [], "config": {}, "created": "2019-10-27T06:18:16Z", "data": {"embed_links": null}, "folders": [], "id": "k28lqr5dzhm6mu", "no_answer": 0, "no_upvotes": 0, "subject": "&#43;1. I’m currently a sophomore and am currently pursuing a history minor. My case may be a little different than yours, because although I like CS, I’m not as deeply passionate about it as many are here. My history classes are very much a way to keep myself sane and in touch with a community outside of CS/STEM, and thus far I have not regretted my decision. ", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "jl5gfwcvxxp6mr", "updated": "2019-10-27T06:18:16Z"}, {"anon": "stud", "bucket_name": "Week 10/27 - 11/2", "bucket_order": 90, "children": [], "config": {}, "created": "2019-10-27T19:42:15Z", "data": {"embed_links": null}, "folders": [], "id": "k29egoj6lw54d7", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Personally, I am not as concerned about my &#34;depth&#34; of CS education as an undergrad here, because the courses here do go very deep into topics even as undergrad courses, and most students pick a &#34;focus&#34; like ML, SE, graphics, EE, systems, signals, etc. Also, there is always grad school, which is a good way to get a &#34;depth&#34; of knowledge and have it actually count towards your career (I don&#39;t think your pay will go up because you took more CS classes as an <em>undergrad</em>, but in some cases getting your masters places you at a higher position when you enter a company, an dit may be easier to receive a promotion, etc.--at least that&#39;s what my brother, who works at Google as a TPM says). </p>\n<p></p>\n<p>If you end up liking another subject, I would recommend exploring it. Berkeley outputs a lot of CS students to tech industry and research fields, but I would argue most other academic fields you can explore at Berkeley may also benefit/are benefitting from computer science innovations. It can&#39;t hurt to have a depth of knowledge in another field, or a breadth of knowledge in many. Learning a language or two will open career/life opportunities in other countries, going into a humanities or social science topic will at the very least make you a much better writer and reader/researcher, or getting into another STEM field will certainly allow you to go into a career that will probably involve both your CS degree and your STEM knowledge (so many fields like medicine, chemical industry, etc. rely on hardware and software).</p>\n<p></p>\n<p>Personally, I am double majoring in CS and a humanities degree, and I am finding very interesting ways to combine those topics and having very interesting conversations with faculty here about the intersection between them. I am also able to focus each degree to complement the other, e.g. focusing on graphics in CS and focusing on theoretical/mathematical aspects of my humanities major. I am having a fun time and I recommend you explore as well! I just wouldn&#39;t drop your CS degree entirely since you are at a great place for it and its a cushion for your career.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_1", "updated": "2019-10-27T19:42:15Z"}, {"anon": "stud", "bucket_name": "Week 10/27 - 11/2", "bucket_order": 90, "children": [], "config": {}, "created": "2019-10-28T02:29:26Z", "data": {"embed_links": null}, "folders": [], "id": "k29t0c75zp86g3", "no_answer": 0, "no_upvotes": 0, "subject": "<p>I&#39;m a double major in CS and DS.  My main objective is CS, but I decided to go with the strategy of using breadths to cover some of the requirements for DS (I&#39;m using Cognition as my domain emphasis), plus pick up additional CS classes to fulfill the DS requirements.  By doing this, I&#39;ve gotten more in depth with CS along with getting the extra degree in data science (not sure if it&#39;s worth that much extra combined with CS) and at the same time picking up some domain knowledge in Cognitive Science.  And for me it comes out to one extra semester&#39;s worth of classes (well, 5 extra classes actually).</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_2", "updated": "2019-10-28T02:29:26Z"}], "config": {}, "created": "2019-10-27T04:26:57Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["enrollments", "faculty_advising", "peer_directed", "lscs", "eecs"], "history": [{"anon": "stud", "content": "<p>Hi everyone. Considering how course selection is coming up soon, I was hoping to get some insight from students who might have once been in my place about the track I should follow for the next 2.5 years at Berkeley (I&#39;m currently a sophomore).</p>\n<p></p>\n<p>So the main problem for me right now is that I am kind of confused about whether I want to focus completely on CS, making use of the excellent opportunity I have, to get as much technical knowledge that I can. Or should I sacrifice some of that CS depth to explore other fields in Berkeley which also have world-class departments, an opportunity I would probably not be able to get later.</p>\n<p></p>\n<p>In particular, if I decide to go for greater breadth, I was planning the following: take two tech courses (will almost always be CS Upper Divs but once or twice might be a Math class like 104) and two &#39;breadths&#39;. For example, I wanted to get a survey of most of the other fields, so I planned on taking Phil 25 A and B, English 45 B and C, History 4 A and B, alongside the International Breadth and AC course. All these courses serve as a broad overview/introduction to their respective fields. This way, my workload is very well balanced and I can enjoy learning about different subjects while also comfortably understanding my CS classes (since I will have a lot of time to work on them). </p>\n<p></p>\n<p>The other option is the following: I take 3 techs every semester and choose the easiest, most efficient breadths I need to satisfy the L&amp;S requirements. That way, I graduate in 3 years and enroll in the department&#39;s 5th-year Masters plan to get an MS in CS as well. By doing so, I can explore CS much, much more in-depth and since I&#39;m very interested in research (and maybe persuing a PhD) expose myself to intensive CS research (currently doing research as well but much more basic). The only issue is that since I will be taking 3 courses it will be pretty hard but considering my semesters so far I believe I can manage it. I will just not be as comfortable and will need much more discipline/focus than the first option.</p>\n<p></p>\n<p>My reasoning for the second situation is also because I realize that I can explore other subjects that interest me later by taking online courses and self-studying them through departments that are equally as good as Berkeley&#39;s (such as Harvard or MITs online courses). However, it would be very hard for me to self-study the technical courses online since they require a much greater level of interaction and guidance as compared to the breadths. </p>\n<p></p>\n<p> What do you guys think is the best option to go with? For some students who have been in such a situation previously, what path did you end up taking and why? Would you recommend it to your juniors? </p>", "created": "2019-10-27T04:26:57Z", "subject": "Dilemma between focusing on CS or exploring other subjects", "uid_a": "a_0"}], "history_size": 1, "i_edits": [], "id": "k28hrlt4lghvq", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 1, "no_answer_followup": 0, "nr": 10580, "num_favorites": 4, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654545516914, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvex6279x3zb", "name": "Maxwell Chen", "photo": "1579165146_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jktvex6279x3zb/1579165146_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"jyq487ctcwuk8": 1576702519}, "facebook_id": null, "id": "jl5gfwcvxxp6mr", "name": "Jessica Yu", "photo": "1576804504_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jl5gfwcvxxp6mr/1576804504_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "ji4zyrg94hv49t", "name": "Yasoob Khalid Niazi", "photo": "1530981380_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/ji4zyrg94hv49t/1530981380_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jz9gltnmf1358i", "name": "Andrew Lin", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"kaww3dlpw6n2fg": 1597045529}, "facebook_id": null, "id": "jzlnpumlqaf2qb", "name": "Esther Cai", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jktvex6279x3zb", "jl5gfwcvxxp6mr", "ji4zyrg94hv49t", "jz9gltnmf1358i", "jzlnpumlqaf2qb"], "tags": ["eecs", "enrollments", "faculty_advising", "lscs", "peer_directed", "student", "unanswered"], "type": "question", "unique_views": 414}