{"bookmarked": 5, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "k2l9uag93zl7m6", "type": "create", "uid_a": "a_0", "when": "2019-11-05T03:06:06Z"}, {"anon": "stud", "data": "k2lgdaod1edqy", "to": "k2l9uag7bor7m5", "type": "s_answer", "uid_a": "a_1", "when": "2019-11-05T06:08:50Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2019-11-05T06:08:50Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>I mean both basically give you projects to talk about during interviews or to put on resumes. 160 is obvi good for UI especially, while from what I&#39;ve heard 169 is like a class-based software engineering project, so similar to an internship I guess. Both can give you a leg up, but if you are caring about career in the short-term, it doesn&#39;t matter the most if you&#39;re on top of everything, as a lot of people start interviews for post-graduation jobs in the fall, and grad apps are also in the fall, so your last semester isn&#39;t always seen. With 170, you know enough to get any non-specialized SWE internship; 61b can get you most, but 170 can get you the big companies like Facebook, Amazon, Google, Apple, and Microsoft. If you do get a SWE internship for next summer and it turns out to be decent, I wouldn&#39;t recommend taking 169 later. It wouldn&#39;t boost your resume at that point and I&#39;m not sure how much gain you would get from it that you didn&#39;t get from hands on experience interning.</p>\n<p></p>\n<p>In general, I&#39;d say see what you might wanna specialize or focus more on if you feel like you have a good breadth of courses, or go for a course that is less applicable but could be fun or interesting. If you like UI, go for 160. If you wanna take a grad class, go for it, but note that if you wanna apply for grad school directly after college, you should take it earlier so it can get on your apps. Maybe touch circuits with 105 (pass no pass as that stuff is scary haha). Some of my favorite courses are 106a (fall only), 128, 161, and 184. Go wild</p>", "created": "2019-11-05T06:08:50Z", "subject": "", "uid_a": "a_1"}], "id": "k2lgdao4owlqx", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "iscem14kbsu5vi", "name": "Keerthi Bhattaram", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["iscem14kbsu5vi"], "type": "s_answer"}], "config": {}, "created": "2019-11-05T03:06:06Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["eecs"], "history": [{"anon": "stud", "content": "<p>Right now I&#39;m in 120/170/149 (my first set of upper divs). Next Semester I&#39;m going to take 162/123/189. The semester after that, my last, I&#39;ll definitely take 126 and 127 and one more class. I know I don&#39;t want to pursue hardware engineering so I&#39;ve been focusing mostly on signals/ML/SWE. I&#39;ll have my ML signals and systems foundation in check, and my hope is to do a SWE internship this coming summer, so I was wondering if I&#39;d benefit from taking 160/169 in my last semester or possibly taking a grad class instead. </p>\n<p></p>\n<p>If someone&#39;s to have done a swe internship in the summer already, would they get any benefit out of taking either 160 or 169? Can anyone who&#39;s taken these classes go in depth in what they teach exactly and what benefit you guys got out of it? Thanks! </p>", "created": "2019-11-05T03:06:06Z", "subject": "160 vs 169", "uid_a": "a_0"}], "i_edits": [], "id": "k2l9uag7bor7m5", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 10739, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654545196139, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "iscem14kbsu5vi", "name": "Keerthi Bhattaram", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["iscem14kbsu5vi"], "tags": ["eecs", "student"], "type": "question", "unique_views": 455}