{"bookmarked": 7, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "k4945hd9eos7au", "type": "create", "uid_a": "a_0", "when": "2019-12-17T00:13:01Z"}, {"anon": "stud", "data": "k499z3xmqdav7", "to": "k4945hd6q7m7at", "type": "s_answer", "uid_a": "a_1", "when": "2019-12-17T02:56:01Z"}, {"anon": "stud", "data": "k49a1lymgnp1lc", "type": "s_answer_update", "uid_a": "a_1", "when": "2019-12-17T02:57:58Z"}, {"anon": "stud", "data": "k49apfq1lin30p", "type": "update", "uid_a": "a_0", "when": "2019-12-17T03:16:29Z"}, {"anon": "stud", "to": "k4945hd6q7m7at", "type": "followup", "uid_a": "a_2", "when": "2019-12-17T19:01:45Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2019-12-17T02:56:01Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>I think ultimately, you have two options: go back to your old profession or make a career change.</p>\n<p></p>\n<p>If you will ultimately be going back to ur old profession then I would say try to experience as much CS as possible. Try to leverage ur position now into another internship or something.</p>\n<p></p>\n<p>If u are considering a career change it brings up the old dilemma of money vs happiness. Assuming your old profession pays more than a typical SWE position and also assuming you are more passionate about SWE than your old profession. Now this only you can decide for yourself. And if you choose career change, again, I would advise to experience as much CS as possible before settling down on one job. </p>", "created": "2019-12-17T02:57:58Z", "subject": "", "uid_a": "a_1"}, {"anon": "stud", "content": "<p>I think ultimately, you have two options: go back to your old profession or make a career change.</p>\n<p></p>\n<p>If you will ultimately be going back to ur old profession then I would say try to experience as much CS as possible. Try to leverage ur position now into another internship or something.</p>\n<p></p>\n<p>If u are considering a career change it brings up the old dilemma of money vs happiness. Assuming your old profession pays more than a typical SWE position and also assuming you are more passionate about SWE than your old profession. Now this only you can decide for yourself. </p>", "created": "2019-12-17T02:56:01Z", "subject": "", "uid_a": "a_1"}], "id": "k499z3xcay7v6", "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}, {"anon": "stud", "bucket_name": "Week 12/15 - 12/21", "bucket_order": 14, "children": [], "config": {}, "created": "2019-12-17T19:01:45Z", "data": {"embed_links": null}, "folders": [], "id": "k4a8h1ssy1j501", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Hello! In general, I wouldn&#39;t quit. I&#39;m a recent alumnus in the opposite boat, where I&#39;m not certain if programming is right for me. I think our evaluation criteria is still the same, so I figured it&#39;s still worth sharing.</p>\n<p></p>\n<p>1. Evaluate your ability to explore other opportunities if you take your current job. If you can work remotely and take any phone screen interviews or onsites easily, then there&#39;s little harm in taking the job and continuing to explore. It&#39;s the &#34;safe&#34; route, but also the reasonable one considering you could juggle both well. </p>\n<p></p>\n<p>2. Mentorship is tough to find anywhere. There&#39;s a chapter in Sheryl Sandberg&#39;s <i>Lean In</i> about how to find mentorship and grow as a result. The summary is that asking someone to mentor you is bizarre--it just tends to naturally happen if you get to work with someone. As a result, if you want to learn from someone at work, offer to help out with a project. The software engineering realm utilizes Meetups and other public interest group meetups, so if there&#39;s a language, domain, or software experience you want to pick up, you can do that outside of the classroom. </p>\n<p></p>\n<p>3. TAs are very helpful to talk to, both undergraduates and graduate students. I&#39;ve gone to my 170 TAs when I was having a hard time finding companies that actually use the algorithms we learned in the class (my favorite course, hands down). They&#39;ve done internship experiences, they&#39;ve come from unique backgrounds, and have probably advised students in similar situations. Computer science advisors are helpful too, but TAs are an uncommon source of help outside of the course they teach.</p>\n<p></p>\n<p>4. Remember why you got into programming to begin with, and see if those same reasons still apply. When you&#39;re in the thick of it, it&#39;s easy to forget why you&#39;re doing something. As long as your interest hasn&#39;t wavered, go ahead and keep pushing forward.</p>\n<p></p>\n<p>5. Utilize every connection you have. Referrals do get prioritized at large enough companies, so be sure to use them. Facebook groups like the Berkeley linked Computer Science, CS Jobs &amp; Internships, and EECS groups have alumni post job listings there. Handshake got me my first internship. Once you land the right place, you won&#39;t have to beg for referrals until you want to move. From there, be sure to return the favor to people who are in the same position you are now.</p>\n<p></p>\n<p>Hope this helps!</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_2", "updated": "2019-12-17T19:01:45Z"}], "config": {"seen": {"1443": 4, "1515": 3, "3589": 9, "4412": 0, "623": 6, "628": 1, "6578": 2, "7202": 8, "8501": 7, "9075": 5}}, "created": "2019-12-17T00:13:01Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["other"], "history": [{"anon": "stud", "content": "<p>.</p>", "created": "2019-12-17T03:16:29Z", "subject": "Career Advice? An angsty ramble?", "uid_a": "a_0"}, {"anon": "stud", "content": "<p dir=\"ltr\">Context:</p>\n<ul><li>\n<p dir=\"ltr\">First generation non-traditional student-parent in my thirties</p>\n</li><li>\n<p dir=\"ltr\">History of Art major, CS minor</p>\n</li><li>\n<p dir=\"ltr\">Attending college to accomplish a life-long goal and for general intellectual enrichment</p>\n</li><li>\n<p dir=\"ltr\">Left a successful career managing veterinary hospitals expecting to go back after graduating but discovered programming and CS while at Cal and now pursuing a career change</p>\n</li><li>\n<p dir=\"ltr\">Would change major to CS but can’t due to unit ceiling</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Question Details:</p>\n<ul><li>\n<p dir=\"ltr\">Recently completed an internship that now has the opportunity to become more. </p>\n</li><li>\n<p dir=\"ltr\">Company is NOT exciting, no real mentor, poor management, etc…</p>\n</li><li>\n<p dir=\"ltr\">Work is cool for my level of experience. I’ve been working on internal content and asset management tools. My main task during the internship was to write a script that gathered all embedded CSS in a workbook, compared the sites with and without the CSS by generating automated screen-shots, strip the non-whitelisted CSS, generate cleaned files, rebuild the json packages, and upload everything back to AWS. </p>\n</li><li>\n<p dir=\"ltr\">Management and guidance is bad but there is some opportunity for me to take ownership of a lot of the project and institute the ‘best practices’ I’m used to from Berkeley CS classes. </p>\n</li><li>\n<p dir=\"ltr\">I can work remotely and the people are generally nice</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">My Question:</p>\n<ul><li>\n<p dir=\"ltr\">I’m wondering if I should quit. I was really hoping for some mentorship and more exposure to good industry practice but that’s not happening here.</p>\n</li><li>\n<p dir=\"ltr\">I guess I worry about not getting another (better) opportunity. I see so many people struggle to get internships and positions that I don’t want to make a dumb move here. Also, ageism is a concern for me.</p>\n</li><li>\n<p dir=\"ltr\">Should I stay and make the most out of this and move on when I’m ready or just get out now? I have to admit that I’m likely not cut out for things like machine learning and grad school and that’s fine with me, I just like programming. </p>\n</li><li>\n<p dir=\"ltr\">What would you do here? Any thoughts are appreciated. </p>\n</li></ul>\n<p></p>", "created": "2019-12-17T00:13:01Z", "subject": "Career Advice? An angsty ramble?", "uid_a": "a_0"}], "i_edits": [], "id": "k4945hd6q7m7at", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 10967, "num_favorites": 2, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654544945204, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p9mf96y2ty", "name": "Henry Muller", "photo": "1484632252_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/is6p9mf96y2ty/1484632252_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"ijkj0mez6r218b": 1}, "facebook_id": null, "id": "ijlrb103ckg10v", "name": "Cher Yeoh", "photo": null, "photo_url": null, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvh8i561k5t7", "name": "Warren Alphonso", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["is6p9mf96y2ty", "ijlrb103ckg10v", "jktvh8i561k5t7"], "tags": ["other", "student"], "type": "note", "unique_views": 540}