{"bookmarked": 6, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "k4d8hi4pto63kh", "type": "create", "uid_a": "a_0", "when": "2019-12-19T21:25:25Z"}, {"anon": "stud", "data": "k4j334dq5dg32a", "to": "k4d8hi4lty83kg", "type": "s_answer", "uid_a": "a_1", "when": "2019-12-23T23:40:53Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2019-12-23T23:40:53Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>Um, ok?</p>\n<p></p>\n<p>So there are 3 fields here, but 2 majors, one of which has two specializations. To get this part out of the way, EECS has CSE (computer science and engineering) and ECE (electrical and computer engineering). Does it matter? Not really; I just put EECS on my resume. This label is only for your diploma and basically says if you wanna focus on EE (ECE) or CS (CSE). The difference between CS focused EECS (CSE) and L&amp;S CS is the college, so EECS has to take more physics and math but less general breadth, while L&amp;S has their general breadth. Also for L&amp;S you have to apply to your major to get in, which with the 3.5 min GPA on intro cs courses is difficult. For EECS, you apply to the major when applying for college, so once you&#39;re in, you&#39;re in.</p>\n<p></p>\n<p>Material wise, there are a couple main fields in both EE and CS, that I can explain slightly simplified in a broad manner:</p>\n<p></p>\n<p>EE:</p>\n<p>    Signals and systems: the 12X courses; fourier transforms, control systems, digital signal processing, linear systems theory. Signals are just a series of values, with the most traditional one being a sine wave, while systems are how you model the relationship between two signals, e.g. the input and output of a circuit or a processor. Design comes into play mainly in control systems, where you implement techniques to control the output given some input. The examples from the control systems labs include levitating a metal ball with magnetism and using a motorized cart on a track to invert and balance a metal pole.</p>\n<p>    Circuits: 105, 130, and the 14X courses; they take concepts rooted in physics and model the devices to allow for design of more complex signal processing and analysis, such as filters, amplifiers, solar power, and such. This is not being an electrician: you are learning how to design circuits, not wire a house (although there are courses on power electronics).</p>\n<p></p>\n<p>CS:</p>\n<p>    Computer systems: The 160X series, namely 162. These courses are all about how to design computers to do the stuff we want, such as OS programming, parallelization, designing compilers and programming languages, and how to enable interfacing with other devices and the internet. These are increasingly moving towards distributed processing (doing things on many computers). 186 with databases would probably fall into this area as well. These classes are less math focused, but tend to require the ability to analyze design choices and weigh the pros and cons of each</p>\n<p>    Software engineering: There aren&#39;t exact courses on this, but 61b, 160 and 169 are useful, with 170 being good for passing the interviews. This is programming software as a product, so what people typically think of when wanting to work at a big tech company.</p>\n<p>    AI: The main applied CS area besides stuff that falls into computer systems. Normal AI algorithms, data science, machine learning, natural language processing, computer vision, reinforcement learning, robotics. Optimization and probability theory are the basis of all this stuff, which are also based in linear algebra and multivariable calculus. Easily the most math heavy area in CS. While this has been being used in every field, often it is abstracted away, where people learn basic knowledge as needed and throw data into the algorithms. These courses here is how the math actually works and how to design new systems. Working in this field is difficult as it is so popular; people can be getting A&#39;s in these classes and still not find research positions here, and grad school is basically required to specialize in this stuff.</p>\n<p></p>\n<p>There are some overlapping areas. Optimization and probability math (EECS 126 and 127) are the core math to EE and CS (once you know linear algebra and multivariable calculus). Robotics uses EE math at times but also is a lot of programming and machine learning now. Computer engineering can be viewed from the computer architecture/design side or the circuit level, so either CS or EE.</p>\n<p></p>\n<p>Regardless, both are how we do cool stuff with computers. EE is more modeling (how to represent complex stuff with abstract models, namely as circuits) and implementing (how to do cool stuff with abstract models), while CS is abstracts away EE and focuses on design (how to make computers even better) and computation (what you can do know that you have computer).</p>", "created": "2019-12-23T23:40:53Z", "subject": "", "uid_a": "a_1"}], "history_size": 1, "id": "k4j334dhzti329", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvgwu8z5z5gy", "name": "Ashwin Vangipuram", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jzlnpfrl2qk2e6", "name": "Justin Xia", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["jktvgwu8z5z5gy", "jzlnpfrl2qk2e6"], "type": "s_answer"}], "config": {"seen": {"10243": 4, "10448": 3, "3214": 1, "3848": 8, "4395": 5, "5031": 2, "6893": 7, "7044": 0, "8329": 6}}, "created": "2019-12-19T21:25:25Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["eecs", "other"], "history": [{"anon": "stud", "content": "<p>^</p>", "created": "2019-12-19T21:25:25Z", "subject": "Difference between EECS/CS/EL ENG", "uid_a": "a_0"}], "history_size": 1, "i_edits": [], "id": "k4d8hi4lty83kg", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 10983, "num_favorites": 2, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654544963226, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p9mf96y2ty", "name": "Henry Muller", "photo": "1484632252_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/is6p9mf96y2ty/1484632252_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jzlnpfrl2qk2e6", "name": "Justin Xia", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["is6p9mf96y2ty", "jzlnpfrl2qk2e6"], "tags": ["eecs", "other", "student"], "type": "question", "unique_views": 447}