{"bookmarked": 7, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "k7zw8xcfvt6kf", "type": "create", "uid_a": "a_0", "when": "2020-03-20T08:00:38Z"}, {"anon": "no", "data": "k80kruuspib1ca", "to": "k7zw8xcbjxx6ke", "type": "s_answer", "uid": "ipg4v9637934v6", "when": "2020-03-20T19:27:12Z"}, {"anon": "no", "to": "k7zw8xcbjxx6ke", "type": "followup", "uid": "j2m25r6zde162z", "when": "2020-03-21T18:52:24Z"}, {"anon": "stud", "to": "k7zw8xcbjxx6ke", "type": "followup", "uid_a": "a_1", "when": "2020-03-21T22:41:58Z"}, {"anon": "stud", "to": "k7zw8xcbjxx6ke", "type": "feedback", "uid_a": "a_0", "when": "2020-03-22T18:21:19Z"}, {"anon": "no", "to": "k7zw8xcbjxx6ke", "type": "feedback", "uid": "j2m25r6zde162z", "when": "2020-03-22T21:06:46Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2020-03-20T19:27:12Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "no", "content": "not doable imo. class &#43; reader is doable.\n\nlonger: \nthe question u should ask yourself is not whether it is doable but whether you want to do it. it is *doable* but you may not want to do it. so my answer is no. why do you want to do two things over the summer? just doing one thing well is hard enough. your swe internship is &#39;just&#39; 40 hours but work is not like school, 40 hours is going to be more tiring than you expect and you will not want to do work after you finish your internship stuff. WFH means you have to sit at the computer for 8 hours and it&#39;s really draining. just try to do a good job w/ your internship. i know people who have tried similar and while it&#39;s doable, it&#39;s really stressful and not fun and *why* are you even doing it?", "created": "2020-03-20T19:27:12Z", "subject": "", "uid": "ipg4v9637934v6"}], "id": "k80kruujpsf1c8", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {"global": 1567211949, "jq33x9vemkj5xj": 1548611054, "jxzgoek4x4j4u6": 1567647586}, "facebook_id": null, "id": "jjzd0ebjf50lh", "name": "Aishani Sil", "photo": "1572839448_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jjzd0ebjf50lh/1572839448_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"hyq0br1u3kx7dg": 1586922894}, "facebook_id": null, "id": "is6p9qynt5gz9", "name": "Suraj Rampure", "photo": "1592327340_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/is6p9qynt5gz9/1592327340_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6nu3l1tkcr3k5", "name": "Owen Bai", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["jjzd0ebjf50lh", "is6p9qynt5gz9", "j6nu3l1tkcr3k5"], "type": "s_answer"}, {"anon": "no", "bucket_name": "Week 3/15 - 3/21", "bucket_order": 23, "children": [{"anon": "stud", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 22, "children": [], "config": {}, "created": "2020-03-22T18:21:19Z", "data": {"embed_links": null}, "folders": [], "id": "k83dau1wr0l54i", "subject": "<p>hello nathaniel! op here, thanks for your thoughts. to clarify some things:</p>\n<p></p>\n<p>I&#39;ve decided I want to enter industry after undergrad but I&#39;m not sure what specifically I want to do, so I&#39;m hoping my internship helps me get some exposure to how things work at an industry level so I can figure that out. I do want to learn something. granted, it is a medium company in santa clara (it&#39;s doing pretty well I believe but more of my friends than not <em>haven&#39;t</em> heard of it, if that gives you an idea) but I think any industry exposure would actually help me figure out what I&#39;d like to do moving forward.</p>\n<p></p>\n<p>the point about being in berkeley opens up a much larger discussion, but in my experience I haven&#39;t really had just the berkeley name get me much success in terms of recruiting at all. however, I am a second year now so perhaps my lack of experience and technical knowledge simply outweighs any benefit that the berkeley brand would provide for me? ://</p>\n<p></p>\n<p>I&#39;m leaning toward not applying for the reader thing because I do want to do my best at my internship (given it will still be on) and I don&#39;t want to stress myself out too much after all the crazy stuff happening this semester. I&#39;m just trying hard to get on course staff for a course I&#39;m passionate about (I really do enjoy helping out and doing stuff for that course, and csm doesn&#39;t happen over the summer), but I guess I shouldn&#39;t risk having a super stressful summer to do so.</p>\n<p></p>\n<p>re: classes, would you then recommend maybe getting a degree requirement out of the way or something? maybe a class that&#39;s not super important to me but something I need to take anyway? I just don&#39;t want to waste my summer in the worst case, and I&#39;ve never been able to have the dedication to just do personal projects :((</p>\n<p></p>\n<p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_0", "updated": "2020-03-22T18:21:19Z"}, {"anon": "no", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 22, "children": [], "config": {}, "created": "2020-03-22T21:06:46Z", "data": {"embed_links": null}, "folders": [], "id": "k83j7lvmss973n", "subject": "<p>Most small and middle companies want to hire intern from junior or senior, since they may return after one year (when they graduate).</p>\n<p>Most big tech also, but they have university program for sophomore, which is a 10-weeks program that has mentor guiding a group for doing project.</p>\n<p></p>\n<p>So, it is normal that if you do not have too much success in second year.</p>\n<p>When you are in junior level, even with mediocre resume, you will have OAs from twitter, oracle, IBM, amazon, etc.</p>\n<p>Once you have the OAs, then it is your coding preparation but not the resume that matters.</p>\n<p></p>\n<p>for class, yup, maybe taking some AC classes during summer to fulfill the graduation requirement. If you choose to take classes in summer, you may also do the reader, so you may be able to be a uGSI in next semester if it is your plan.</p>\n<p></p>\n<p>If you want to know about how things work in the industry, for front end, 169 is a good class (but the class has very low expectation on students, so you will need to push yourself a lot to learn the materials.) For backend and infrastructure, then 162, 164, 186. And then join ocf for some real project.</p>\n<p></p>\n<p>======</p>\n<p></p>\n<p>I mostly mention about big tech, not because they are better, but they are easier to enter.</p>\n<p></p>\n<p>Small and middle companies usually do not have resource to train the internee and are looking for students that already have experience on specific software and tools that their companies are using.</p>\n<p></p>\n<p>If going to small and middle companies is your goal, spend some time on looking at the companies that you are interested and really spend time to learn the framework or tools that they put into the job description. </p>\n<p></p>\n<p>If going to big companies is your goal, well, being in Berkeley is enough to get the OA. Focusing on preparing of Amazon interview. (Amazon does something like FCFS. As long as you can finish the coding questions, they will give you offer if they still have headcount, or putting you to wait list if they do not.) </p>\n<p></p>\n<p>A lot of people have their first intern in Amazon. With that experience, it is really easy to get the second intern in Facebook / Apple / Microsoft. (Or full time in other big tech using Amazon return offer as competing offer.) </p>\n<p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "j2m25r6zde162z", "updated": "2020-03-22T21:06:46Z"}], "config": {}, "created": "2020-03-21T18:52:24Z", "data": {"embed_links": null}, "folders": [], "id": "k81yyy6jrcb68e", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Some opinions.</p>\n<p></p>\n<p>First, anything is doable, just the matter of the quality and the stress. For example, I saw people doing {5 leetcode/day plus 3 techs 1 ac, job hunting &#43; research &#43; 2 techs 2 decal,4 techs 1 ac} in EVERY semester.</p>\n<p></p>\n<p>I think the most important thing is knowing what you really want to do when you graduate, since it also affects how much you are willing to put yourself out of your comfort zone.</p>\n<p></p>\n<p>For example, you mention about doing intern in the summer or co-op if your offer is cancelled.</p>\n<p>Have you already planned to go to industry? </p>\n<p>Are you doing intern mostly for resume sugar, or you really want to learn something in industry?</p>\n<p>If your goal of the intern is mostly for resume sugar, is your intern offer for big tech or small/middle companies? Since you are in Berkeley, you don&#39;t really need resume sugar if it is small/middle company intern. A return offer from Amazon intern is enough for you to go to any company. </p>\n<p></p>\n<p>And, for classes, personally do not recommend taking any tech class that is important for you in the summer. The time is just too short to learn and absorb the materials.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "j2m25r6zde162z", "updated": "2020-03-21T18:52:24Z"}, {"anon": "stud", "bucket_name": "Week 3/15 - 3/21", "bucket_order": 23, "children": [], "config": {}, "created": "2020-03-21T22:41:58Z", "data": {"embed_links": null}, "folders": [], "id": "k82766874lq3gs", "no_answer": 0, "no_upvotes": 0, "subject": "<p>I&#39;m considering remote internship &#43; reader as well if everything ends up being online.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_1", "updated": "2020-03-21T22:41:58Z"}], "config": {"seen": {"11430": 3, "11476": 6, "1493": 9, "3682": 1, "6975": 5, "7052": 0, "8178": 2, "8647": 7, "9698": 4, "9897": 8}}, "created": "2020-03-20T08:00:38Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["lscs", "peer_directed"], "history": [{"anon": "stud", "content": "<p>these are <em>iff</em> everything in the summer is also shifted online like now (too early to decide but collecting all my info and applying just in case), otherwise all the commuting would be too stressful for me. </p>\n<p></p>\n<p>does anyone have opinions on whether a 40 hour SWE internship &#43; a 12 hour reader role would be doable over this summer? if the health situation remains bad and everything (including my internship work) shifts online?</p>\n<p></p>\n<p>what about a CS class &#43; being a reader? I don&#39;t know what CS class to take this summer in the worst case that my internship gets cancelled but I&#39;m thinking of then enrolling in summer session and taking the fall off school to do an internship instead. again, this is all up in the air but just want some advice on if that&#39;s an advisable direction to go. if so, any advice on a good class to take? so far I&#39;ve done most lower divs and 170. </p>\n<p></p>\n<p>thanks !!</p>", "created": "2020-03-20T08:00:38Z", "subject": "need advice on various summer plans please!", "uid_a": "a_0"}], "i_edits": [], "id": "k7zw8xcbjxx6ke", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 11525, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654544349011, "tag_good": [{"admin": false, "endorser": {"global": 1567211949, "jq33x9vemkj5xj": 1548611054, "jxzgoek4x4j4u6": 1567647586}, "facebook_id": null, "id": "jjzd0ebjf50lh", "name": "Aishani Sil", "photo": "1572839448_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jjzd0ebjf50lh/1572839448_200.jpg", "published": true, "role": "student", "us": false}], "tag_good_arr": ["jjzd0ebjf50lh"], "tags": ["lscs", "peer_directed", "student"], "type": "question", "unique_views": 610}