{"bookmarked": 7, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "k86nc8lbk9k298", "type": "create", "uid_a": "a_0", "when": "2020-03-25T01:25:39Z"}, {"anon": "stud", "data": "k86nfkuftt433i", "type": "update", "uid_a": "a_0", "when": "2020-03-25T01:28:15Z"}, {"anon": "stud", "to": "k86nc8l1q6e296", "type": "followup", "uid_a": "a_1", "when": "2020-03-25T02:12:55Z"}, {"anon": "stud", "to": "k86nc8l1q6e296", "type": "feedback", "uid_a": "a_1", "when": "2020-03-25T02:18:47Z"}, {"anon": "stud", "to": "k86nc8l1q6e296", "type": "feedback", "uid_a": "a_2", "when": "2020-03-25T07:47:06Z"}, {"anon": "stud", "to": "k86nc8l1q6e296", "type": "feedback", "uid_a": "a_2", "when": "2020-03-25T07:49:04Z"}, {"anon": "stud", "to": "k86nc8l1q6e296", "type": "feedback", "uid_a": "a_1", "when": "2020-03-25T09:30:48Z"}, {"anon": "stud", "to": "k86nc8l1q6e296", "type": "followup", "uid_a": "a_3", "when": "2020-03-25T09:53:07Z"}, {"anon": "stud", "to": "k86nc8l1q6e296", "type": "feedback", "uid_a": "a_4", "when": "2020-03-25T17:50:46Z"}, {"anon": "stud", "to": "k86nc8l1q6e296", "type": "feedback", "uid_a": "a_5", "when": "2020-03-25T19:29:42Z"}, {"anon": "stud", "to": "k86nc8l1q6e296", "type": "feedback", "uid_a": "a_3", "when": "2020-03-25T19:39:16Z"}, {"anon": "stud", "to": "k86nc8l1q6e296", "type": "feedback", "uid_a": "a_5", "when": "2020-03-25T20:02:15Z"}, {"anon": "stud", "to": "k86nc8l1q6e296", "type": "followup", "uid_a": "a_6", "when": "2020-03-25T22:30:37Z"}, {"anon": "stud", "to": "k86nc8l1q6e296", "type": "feedback", "uid_a": "a_3", "when": "2020-03-25T22:36:55Z"}, {"anon": "stud", "to": "k86nc8l1q6e296", "type": "feedback", "uid_a": "a_5", "when": "2020-03-25T23:16:30Z"}, {"anon": "stud", "to": "k86nc8l1q6e296", "type": "feedback", "uid_a": "a_3", "when": "2020-03-26T07:11:54Z"}], "children": [{"anon": "stud", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 8, "children": [{"anon": "stud", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 8, "children": [], "config": {}, "created": "2020-03-25T02:18:47Z", "data": {"embed_links": null}, "folders": [], "id": "k86p8kepceokz", "subject": "<p>Also, to respond to &#34;I mean, no matter how much you say this semesters grade won’t count, if a school see someone pull a straight A in 2020 and another only pull Ps they’re going to think the former is at least more tenacious.&#34;, the context of grades can never be seen on a report card. Maybe the student with all Ps lost their job in Berkeley and has to focus on finding income instead of prioritizing school work. Those Ps may have been the best they could do while prioritizing their wellbeing over school. I think any grad school admission team would be reasonable and understanding if a student applied with all Ps in spring 2020 because they had personal hardships to deal with over school. You never know someone&#39;s personal struggles. </p>\n<p></p>\n<p>Of course, the letter grade option still remains. You can do what you want for your gpa, but perhaps reflect on what your decision means to those less fortunate than you before making your decision.</p>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jkx7g4krr52435", "name": "Ava Taghizadeh", "photo": "1571609169_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jkx7g4krr52435/1571609169_200.jpg", "published": true, "role": "student", "us": false}], "tag_good_arr": ["jkx7g4krr52435"], "type": "feedback", "uid_a": "a_1", "updated": "2020-03-25T02:18:47Z"}, {"anon": "stud", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 8, "children": [], "config": {}, "created": "2020-03-25T07:47:06Z", "data": {"embed_links": null}, "folders": [], "id": "k870ys837w45ek", "subject": "<p>Most professors will keep records of what grade you WOULD have gotten had you taken it for letter grade, which grad schools would request if they need to. If grad school admissions committees really are reasonable like you say, then they wouldn&#39;t automatically take the applicant with the higher GPA because of spring 20 grades — why would taking letter grades harm those that were heavily affected, then? </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_2", "updated": "2020-03-25T07:47:06Z"}, {"anon": "stud", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 8, "children": [], "config": {}, "created": "2020-03-25T07:49:04Z", "data": {"embed_links": null}, "folders": [], "id": "k8711avsfqk727", "subject": "<p>And there&#39;s also the question of if this is the case, why did the University make it so that you can change to letter grade whenever you want rather than having to petition to do so or having mandatory P/NP.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_2", "updated": "2020-03-25T07:49:04Z"}, {"anon": "stud", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 8, "children": [], "config": {}, "created": "2020-03-25T09:30:48Z", "data": {"embed_links": null}, "folders": [], "id": "k874o4pd67l5k5", "subject": "<p>To the Beaker,</p>\n<p>I interpret &#34;why would taking letter grades harm those that were heavily affected, then?&#34; as more of a moral question than a purely number/letter grade issue. My first response focused on the grad school issue due to the nature of the original post. But as I stated before, the issue is with the lack of fairness due to the loss of students&#39; normal school routines and security. I think just looking at this from the perspective of numbers or admissions really isn&#39;t seeing the whole picture. When not all students can try their best or work at their top caliber due to personal struggles related to the pandemic, that&#39;s not fair, don&#39;t you agree? The student who can&#39;t perform at their best because of the pandemic could feel like they&#39;re at a disadvantage because they feel safest sticking to P/NP due to the nature of their circumstances while other students have the luxury of feeling like they can continue working at their best and stick to letter grades. </p>\n<p></p>\n<p>Again, the letter grade option remains. You do what you want with your gpa, but try to keep your fellow classmates who are going through hard times right now in your heart.</p>\n<p></p>\n<p>from <a href=\"/class/hyq0br1u3kx7dg?cid=11565\">&#64;11565</a>: &#34;It seems like they wanted to make it a mandatory P/NP because of the issues with accurate grading this semester but there was a lot of pushback from certain groups of students (pre-law, pre-med, etc), so they&#39;re trying to make grading majority P/NP while still catering to those groups.&#34; This is a fellow student response, and I am unsure of the actual reason as I too am just a student and not a faculty member. Best guess is probably to mitigate displeasure from grad school hopefuls or students with very strong opinions about keeping letter grades like said in the quote.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_1", "updated": "2020-03-25T09:30:48Z"}, {"anon": "stud", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 8, "children": [], "config": {}, "created": "2020-03-25T17:50:46Z", "data": {"embed_links": null}, "folders": [], "id": "k87mj39pwy651q", "subject": "<p>&#64;Poet,</p>\n<p>I&#39;m not necessarily disagreeing with you here, but isn&#39;t the idea that grades have no context true regardless of this P/NP policy? Even when school carried on and all students had more equal access to university resources (compared to very unequal home-resources), students facing circumstances out of their control are situated at a more unlikely position to do well in school. Previously, they may have gotten lower letter grades due to these hardships, but the impact of their disadvantage is still reflected in their academics, without context. The same population of students are at a disadvantage under shelter-in-place conditions (give-or-take, ie. commuter students don&#39;t need to commute anymore, but some face worse studying conditions at home than at school).</p>\n<p></p>\n<p>I guess what I&#39;m trying to say is that your argument is valid for this new P/NP policy, but it was already a reality for the original, standard grading policy, so I don&#39;t really see how opting for letter grades impacts less advantaged folks since this they were (unfortunately) impacted regardless.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_4", "updated": "2020-03-25T17:50:46Z"}, {"anon": "stud", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 8, "children": [], "config": {}, "created": "2020-03-25T19:29:42Z", "data": {"embed_links": null}, "folders": [], "id": "k87q2brhon319t", "subject": "I feel a lot of students who choose letter grading technicals this semester seems to rely on this idea of curving a class. Let me say this, you will get the grade you deserve, not a relative grade compared to others. Everyone is in a disadvantage situation. If the administrative didn’t announce the PNP policy, then the professor will probably loosen the curve and allow more A’s due to the ineffectiveness of online education; however, the fact that PNP is the default mode encourages the staff to assess you with the NORMAL standard because you are the one that decide to letter grade the course. Also, including the PNP students in the curve or not does not make any difference because the purpose of a curve is not to assign strictly 25% A’s and 40% B’s, etc. You won’t get an A by scoring 70% on the exam if the expectation from the staff to get an A is 80% on the exam, even if the PNP students all get very low scores compared to you. Since you are allowed to PNP and use PNPed classes to fulfill the requirement, you will not receive much sympathy from the staff by changing to a letter grade.<div><br /></div><div>I don’t think you should be discourage from changing to letter grades if you believe you are hardworking enough this semester. BUT, I highly suggest people who want to somehow play with the system to rethink their decision because there is not much advantage you can take from this situation.</div>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_5", "updated": "2020-03-25T19:29:42Z"}, {"anon": "stud", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 8, "children": [], "config": {}, "created": "2020-03-25T19:39:16Z", "data": {"embed_links": null}, "folders": [], "id": "k87qemvmsti3g", "subject": "<p>&#34;You won’t get an A by scoring 70% on the exam if the expectation from the staff to get an A is 80% on the exam, even if the PNP students all get very low scores compared to you.&#34; </p>\n<p></p>\n<p>Does a curve not work to assess your performance relative to that of your peers, as opposed to some predetermined benchmark? How exactly does &#34;the expectation from the staff&#34; play a role in terms of ensuring the average GPA of the course stays within the recommended range? Are you trying to imply that the staff would simply not give you an A even if you performed a deviation above the average of the entire class, merely because it didn&#39;t meet some arbitrary threshold that the staff predetermined? If so, is this just how you think things will play out this semester, or have you heard something along these lines from a reputable source?</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2020-03-25T19:39:16Z"}, {"anon": "stud", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 8, "children": [], "config": {}, "created": "2020-03-25T20:02:15Z", "data": {"embed_links": null}, "folders": [], "id": "k87r86frlaj2ge", "subject": "People in CS major (and in courses with large population) often are used to the idea of a curve; however, in smaller classes, “curve” is never a thing. You will see sometimes 40% of people getting A’s in some of the EE upper divs simply because there is not enough students to even “curve”. The reason a lot of CS classes are curved is because their is a department guideline for gpa (e.g. 3.3 average for upper div). In unprecedented cases, like this semester, there is no reason for the professor to follow the 3.3-average-gpa convention. <div><br /></div><div>Also, the example I gave about scoring 70% on the exam was meant to be more extreme; that is, you are significantly below the expectation of the staff. Regarding the expectation, of course there are things that the teaching staff would expect you to know on an exam. For instance, an A student should know how to do the harder question, etc. In this circumstance, standard deviations are not very good measure of your performance anymore because the class is not going to be distributed evenly.</div>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_5", "updated": "2020-03-25T20:02:15Z"}, {"anon": "stud", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 8, "children": [], "config": {}, "created": "2020-03-25T22:36:55Z", "data": {"embed_links": null}, "folders": [], "id": "k87wr3kw55u4yj", "subject": "<p>&#34;In unprecedented cases, like this semester, there is no reason for the professor to follow the 3.3-average-gpa convention.&#34;</p>\n<p></p>\n<p>Are these words completely your own, or have any of the faculty implied this to be the case? What I inferred from an instructor response in one of my courses was that all students, including those who end up P/NP-ing, will be included in the curve, and that the curve would resemble a past semester&#39;s.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2020-03-25T22:36:55Z"}, {"anon": "stud", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 8, "children": [], "config": {}, "created": "2020-03-25T23:16:30Z", "data": {"embed_links": null}, "folders": [], "id": "k87y5zh0rsr68s", "subject": "That’s what I interpreted from the fact that the COE faculties almost unanimously agreed on offering PNP as a default option. If a nicer curve was given, then students from previous semester would be treated unfairly. I think your professor was saying that because he or she don’t want to see a self-selected situation. A curve resemble to previous offerings, based on MY interpretation means that people who can get an A/B/C in previous semester can still get the same grade in this semester (of course, taking into account the lack of resource for everyone). It has nothing to do with whether the average gpa will be 3.3. As I have said before, all the professors have in their mind their definition of fairness, and you will get the grade you deserve. <div><br /></div><div>As mentioned in a post from the professor of 189, it would be a pain to admit a grad student who is incapable (so he suggested that people who want to do ML research letter grade 189 this semester to demonstrate the learning outcome). That being said, it will be irresponsible for any professor to give grades that students don’t deserve because that will cause exactly the same pain. </div><div><br /></div><div>I am not saying that professors should be harsh in this situation, but there is always a limit of how much you can ask for. I am sure all the professor will understand that we don’t have enough learning resource; nevertheless, there ain’t no such thing as a free lunch. </div>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_5", "updated": "2020-03-25T23:16:30Z"}, {"anon": "stud", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 8, "children": [], "config": {}, "created": "2020-03-26T07:11:54Z", "data": {"embed_links": null}, "folders": [], "id": "k88f5d31bnw13c", "subject": "<p>Funny you mention 189, because the course I was talking about was 189 haha. I guess our interpretations of curve differ, but to me the curve represents what percentile you need to be in the cohort of students you&#39;re <strong>currently</strong> taking the class with in order to attain a certain grade, not the cohort of students you could have taken the class with in any other semester. Of course this situation is unprecedented and may warrant needing to account for the circumstances when creating the curve, so all conventional definitions of the curve can be thrown out of the window for all we know.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2020-03-26T07:11:54Z"}], "config": {}, "created": "2020-03-25T02:12:55Z", "data": {"embed_links": null}, "folders": [], "id": "k86p10opy445zq", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Yes, I would say it does disadvantage other students if you keep the letter grade. This is because the students who choose to do P/NP may need to because the pandemic has forced them to leave their normal school life at Berkeley. They may not have stable wifi at their family home or wherever they have to move. They may be caring for a sick family member or may have gotten sick themselves. They may be dealing with anxiety and/or depression due to the pandemic or the loss of normal life. I must stress that all of these things are <em>out of the student&#39;s control</em>. Thus, the P/NP may be a necessity for them due to not being able to prioritize their school work because of the hardships of their personal life. A student who is not facing any of these troubles and wants to stick to letter grades, is in a more privileged position and can focus on their school work without hinderance. There is an unfairness here: the student who has the privilege to pick letter grades and continue working at their normal caliber will come out with a better gpa, but the student who needs to stay P/NP due to the circumstances they find themselves in due to the pandemic ends up not being able to give their best effort to their school work. Thus, I interpret the highly advised P/NP policy is to promote fairness for all students no matter their circumstances.</p>", "tag_good": [{"admin": false, "endorser": {"jjd5ukm1ddp6x6": 1539310233}, "facebook_id": null, "id": "j5ubio21xll1qz", "name": "Kate Sanders", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jkx7g4krr52435", "name": "Ava Taghizadeh", "photo": "1571609169_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jkx7g4krr52435/1571609169_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"global": 1573593387, "jzw8c1ne84b7li": 1567497947, "k5fwiw4wql642x": 1579917055, "k5oliztmzqy5zv": 1583949796}, "facebook_id": null, "id": "jx9vh19he786fy", "name": "Kyle Kishimoto", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvfivqsei4f2", "name": "Nicholas Berberi", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvgthztc95d5", "name": "Joycelin Liaw", "photo": "1535914662_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jktvgthztc95d5/1535914662_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"irwl7o7shzu70z": 1}, "facebook_id": null, "id": "ip7tr8jvrq678u", "name": "William Yang", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j84vts9t9a719k", "name": "Vivek Datta", "photo": null, "photo_url": null, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "iy23puwo6gig7", "name": "Melody Yan", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jjs6gwtu1da1dz", "name": "Akshara Majjiga", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["j5ubio21xll1qz", "jkx7g4krr52435", "jx9vh19he786fy", "jktvfivqsei4f2", "jktvgthztc95d5", "ip7tr8jvrq678u", "j84vts9t9a719k", "iy23puwo6gig7", "jjs6gwtu1da1dz"], "type": "followup", "uid_a": "a_1", "updated": "2020-03-25T02:12:55Z"}, {"anon": "stud", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 8, "children": [], "config": {}, "created": "2020-03-25T09:53:07Z", "data": {"embed_links": null}, "folders": [], "id": "k875gtxlobjzc", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Not quite related, but it would be funny if most people thought that the curve would be nicer because other people would likely P/NP, and so decided to not P/NP themselves, leading to most people taking courses for a grade anyhow. Only time will tell if this will be the case though.</p>", "tag_good": [{"admin": false, "endorser": {"global": 1567211949, "jq33x9vemkj5xj": 1548611054, "jxzgoek4x4j4u6": 1567647586}, "facebook_id": null, "id": "jjzd0ebjf50lh", "name": "Aishani Sil", "photo": "1572839448_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jjzd0ebjf50lh/1572839448_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"jzuapq72cws2q": 1576782386}, "facebook_id": null, "id": "j6i3o3d39ou7p0", "name": "Nagaganesh Jaladanki", "photo": "1567722611_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/j6i3o3d39ou7p0/1567722611_200.jpg", "published": true, "role": "student", "us": false}], "tag_good_arr": ["jjzd0ebjf50lh", "j6i3o3d39ou7p0"], "type": "followup", "uid_a": "a_3", "updated": "2020-03-25T09:53:07Z"}, {"anon": "stud", "bucket_name": "Week 3/22 - 3/28", "bucket_order": 8, "children": [], "config": {}, "created": "2020-03-25T22:30:37Z", "data": {"embed_links": null}, "folders": [], "id": "k87wizeyeu62o8", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Well, many classes just cancel later exams, which I think does not reflect a student&#39;s standing in the class anymore...</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_6", "updated": "2020-03-25T22:30:37Z"}], "config": {"seen": {"10194": 6, "10351": 4, "11195": 8, "11504": 2, "11510": 1, "11523": 0, "11544": 3, "2129": 5, "8464": 9, "8516": 7}}, "created": "2020-03-25T01:25:39Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["other"], "history": [{"anon": "stud", "content": "<p>Like most student doing ok in courses, I want to do the courses in letter grade, and maybe boost my gpa given the curve is probably going to be much nicer. but today some friends and I talked and they say it may put people who had to quarantine/ take care of grandparents in bad position in grad school application. I mean, no matter how much you say this semesters grade won’t count, if a school see someone pull a straight A in 2020 and another only pull Ps they’re going to think the former is at least more tenacious.</p>", "created": "2020-03-25T01:28:15Z", "subject": "Does it disadvantage other classmates to do letter grade?", "uid_a": "a_0"}, {"anon": "stud", "content": "<p>Like most student doing ok in courses, I want to do the courses in letter grade, and maybe boost my gpa given the curve is probably going to be much nicer. but today some friends and I talked and they say it may put people who had to quarantine/ take care of grandparents in bad position in grad school application. </p>", "created": "2020-03-25T01:25:39Z", "subject": "Does it disadvantage other classmates to do letter grade?", "uid_a": "a_0"}], "i_edits": [], "id": "k86nc8l1q6e296", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 1, "no_answer_followup": 0, "nr": 11566, "num_favorites": 2, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654544301899, "tag_good": [{"admin": false, "endorser": {"jzuapq72cws2q": 1576782386}, "facebook_id": null, "id": "j6i3o3d39ou7p0", "name": "Nagaganesh Jaladanki", "photo": "1567722611_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/j6i3o3d39ou7p0/1567722611_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"global": 1567211949, "jq33x9vemkj5xj": 1548611054, "jxzgoek4x4j4u6": 1567647586}, "facebook_id": null, "id": "jjzd0ebjf50lh", "name": "Aishani Sil", "photo": "1572839448_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jjzd0ebjf50lh/1572839448_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "iw9jrm9iwm56c1", "name": "Michael Lavva", "photo": "1579166933_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/iw9jrm9iwm56c1/1579166933_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6wdztpg2l2v0", "name": "Ryan Deng", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"global": 1570093295, "jq33x9vemkj5xj": 1550003048, "jxzgoek4x4j4u6": 1570093295}, "facebook_id": null, "id": "jjm5sqotm026wq", "name": "shoumik", "photo": "1570879757_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jjm5sqotm026wq/1570879757_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6nu4uhqkix4d2", "name": "joyful student 0", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p6j9n6u55fp", "name": "Katie Gu", "photo": "1513749563_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/is6p6j9n6u55fp/1513749563_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvex6279x3zb", "name": "Maxwell Chen", "photo": "1579165146_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jktvex6279x3zb/1579165146_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p8c8z13p7cd", "name": "Rishi Veerapaneni", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jjs6gwtu1da1dz", "name": "Akshara Majjiga", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["j6i3o3d39ou7p0", "jjzd0ebjf50lh", "iw9jrm9iwm56c1", "is6wdztpg2l2v0", "jjm5sqotm026wq", "j6nu4uhqkix4d2", "is6p6j9n6u55fp", "jktvex6279x3zb", "is6p8c8z13p7cd", "jjs6gwtu1da1dz"], "tags": ["other", "student", "unanswered"], "type": "question", "unique_views": 660}