{"bookmarked": 5, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "k9it79u0cjb4rb", "type": "create", "uid": "j0b75czu7362rq", "v": "all", "when": "2020-04-27T18:22:42Z"}], "children": [], "config": {"is_announcement": 1}, "created": "2020-04-27T18:22:42Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements"], "history": [{"anon": "no", "content": "<p>Since I&#39;ve gotten many questions about this over the past week, I thought a post was in order to help clarify.</p>\n<p></p>\n<p>This semester, we letting the enrollment system formally enforce pre-requisites for CS 169A. (You can check the pre-reqs on classes.berkeley.edu)</p>\n<p></p>\n<p>If you attempt to enroll into the class and do not meet the pre-reqs or their subsitutes/equivalents, you will receive an error message and NOT be allowed to join the wait list event.</p>\n<p></p>\n<p>Separately, we also have reserve capacities set on this class. Reserve capacities allow us to set aside a certain amount of seats for priority student populations (like our declared majors). Reserve capacities for undergraduate level classes apply until the Adjustment Period begins. At that time, priority seating ends and any available seats are filled solely on the wait list position.</p>\n<p></p>\n<p>If you have attempted to enroll into CS 169A and received an error message but ended up on the wait list, it is NOT the pre-requisite that is keeping you out of the class. It is because all the reserve capacity seats are full. If more seats are added prior to the adjustment period, you will still be given priority access based on your position within the group of other students who also meet the reserve capacity criteria.</p>", "created": "2020-04-27T18:22:42Z", "subject": "F20: CS 169A Pre-Requisites and Reserve Capacities", "uid": "j0b75czu7362rq"}], "i_edits": [], "id": "k9it79txlnv4ra", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 12049, "num_favorites": 1, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654543761928, "tag_good": [], "tag_good_arr": [], "tags": ["announcements", "instructor-note"], "type": "note", "unique_views": 355}