{"bookmarked": 10, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "kag9csrcn5qwq", "type": "create", "uid_a": "a_0", "v": "all", "when": "2020-05-21T04:11:17Z"}, {"anon": "stud", "to": "kag9csr89rkwp", "type": "followup", "uid_a": "a_1", "when": "2020-05-21T07:05:29Z"}, {"anon": "stud", "to": "kag9csr89rkwp", "type": "followup", "uid_a": "a_2", "when": "2020-05-23T07:40:26Z"}], "children": [{"anon": "stud", "bucket_name": "Week 5/17 - 5/23", "bucket_order": 80, "children": [], "config": {}, "created": "2020-05-21T07:05:29Z", "data": {"embed_links": null}, "folders": [], "id": "kagfktiuqzc5w4", "no_answer": 0, "no_upvotes": 0, "subject": "<p>1. You don&#39;t want to be stuck for too long. If it&#39;s a quick question, you can always ask your mentor. For project planning and design, you&#39;ll probably meet with your mentor/manager for more involved discussion, especially at the start of your internship. Daily standups are a good time to update your team on your status and any blockers you have.</p>\n<p>3. Not really. Took coffee breaks.</p>\n<p>4. Depends, but both are possible. If there are many interns on your team, it&#39;s likely you&#39;ll run into dependencies between your projects.</p>\n<p></p>\n<p>If I were you, I would discount your negative experience from last year. The startup developers probably had to prioritize their product and weren&#39;t in a position to give you real responsibilities or offer support. Also, during the summer, your attention won&#39;t be split between classes.</p>", "tag_good": [{"admin": false, "endorser": {"global": 1567211949, "jq33x9vemkj5xj": 1548611054, "jxzgoek4x4j4u6": 1567647586}, "facebook_id": null, "id": "jjzd0ebjf50lh", "name": "Aishani Sil", "photo": "1603429714_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jjzd0ebjf50lh/1603429714_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p6j9n6u55fp", "name": "Katie Gu", "photo": "1513749563_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/is6p6j9n6u55fp/1513749563_35.png", "published": true, "role": "student", "us": false}], "tag_good_arr": ["jjzd0ebjf50lh", "is6p6j9n6u55fp"], "type": "followup", "uid_a": "a_1", "updated": "2020-05-21T07:05:29Z"}, {"anon": "stud", "bucket_name": "Week 5/17 - 5/23", "bucket_order": 80, "children": [], "config": {}, "created": "2020-05-23T07:40:26Z", "data": {"embed_links": null}, "folders": [], "id": "kajbpgfz8qi1j7", "no_answer": 0, "no_upvotes": 0, "subject": "<p>1. In your first(even possibly up to second) week, you should expect to be completely confused because you need to familiarize yourself with their existing codebase, figure out what project you&#39;ll be doing, mapping out what are the necessary components in your project and what resources you&#39;ll need, and all the prerequisite stuff. This stuff you can probably find some documentation on if the company is medium to big, but it&#39;ll be much more efficient to ask these questions to your mentor, since it&#39;s specific to your internship, team, and company. IMO, &#34;communicate more&#34; means to provide updates on what you finished, what you&#39;re currently working on, and lastly, if there are any blockers.  If there are blockers, speak up and ask openly how you could get unblocked, since this could be a 30 second conversation if you ask the right question. If it&#39;s a coding issue, you can probably google it. If it&#39;s a &#34;familiarizing yourself with their frameworks&#34; issue, definitely ask. It would be whack for them to expect you to be a rockstar in by your 3rd day when you&#39;ve barely had time to meet the team, figure out what you&#39;ll be working on, and what the current codebase looks like, let alone how you&#39;ll be implementing whatever project you&#39;ll be doing.</p>\n<p></p>\n<p>2. I guess this relates to 1, where you communicate A LOT. But don&#39;t forget that you&#39;re working with human beings also, so conversations don&#39;t have to be 100% work related. Maybe like 95% work related. The remaining 5% should include more human things like jokes, weekend plans, interests, where everyone is from. The ratio isn&#39;t set btw... this is probably something you should gauge :) You should have fun learning from the project and other people you&#39;ll be working with, while building relationships during this internship too. </p>\n<p></p>\n<p>3. Ehh.... You might be overthinking the intimidation of an 8-hour day, but if you&#39;re really into what you&#39;re working on, whether your stuck debugging an issue or designing/implementing stuff, those hours will probably breeze right by. ***** But keep in mind, that I&#39;m biased because I have more of a work hard, play hard mentality. Breaks distract me and I need long hours for me to fully focus and concentrate and work efficiently and get stuff done. I usually take breaks after I finish the immediate tasks at hand. This could be completely different for you since everyone has their own working style. Figure out what&#39;s yours and you&#39;ll be set on how to get through an 8-hour day :)</p>\n<p></p>\n<p>4. Probably depends on how interconnected your project is. If there are other interns at the company, in any department, maybe create an interns group chat on Slack, mattermost, or whatever they use. That could just be the fun stuff. In terms of work-related communication, I guess you&#39;ll find out when you know what your project will be. Speaking from personal experience.... I&#39;m currently interning on the DevOps team, which means ensuring CICD(continuous integration continuous deployment) for all the software in the entire company. I help make sure all teams have their proper environments and builds set up on pipelines in jenkins/kubernetes, and naturally, it follows that I talk to a bunch of different developers(full-time and interns) to make sure their pipelines are working fine. If some of these terms confused you, it essentially means that instead of having developers run and test their apps/projects locally on their computer(which they can do by themselves), I help onboard their projects onto VMs and servers so that it could get streamlined into production for the world to eventually see. Not sure how it is from the developer POV, but there definitely is communication for repeated work since it&#39;s more efficient and productive. </p>\n<p></p>\n<p>Same as Anon Comp. Don&#39;t let your previous experience generalize across your upcoming virtual experience. It helps to turn your camera on, even if you don&#39;t like looking at yourself loll. Almost everyone in software is remote now because of the pandemic, so don&#39;t feel doomed that all virtual experiences will be bad. If anything, keep that good energy in your first paragraph and bee humbled, <strong>fortunate and thrilled</strong>. You&#39;re about to do some really cool things :)</p>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "j6lrx7lxeqz3e4", "name": "Tsai-Jwu (Judy)", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p6j9n6u55fp", "name": "Katie Gu", "photo": "1513749563_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/is6p6j9n6u55fp/1513749563_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"global": 1567211949, "jq33x9vemkj5xj": 1548611054, "jxzgoek4x4j4u6": 1567647586}, "facebook_id": null, "id": "jjzd0ebjf50lh", "name": "Aishani Sil", "photo": "1603429714_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jjzd0ebjf50lh/1603429714_200.jpg", "published": true, "role": "student", "us": false}], "tag_good_arr": ["j6lrx7lxeqz3e4", "is6p6j9n6u55fp", "jjzd0ebjf50lh"], "type": "followup", "uid_a": "a_2", "updated": "2020-05-23T07:40:26Z"}], "config": {"seen": {"10976": 4, "11239": 0, "11525": 9, "3350": 3, "5851": 5, "8173": 8, "8896": 7, "9129": 6, "937": 1, "9577": 2}}, "created": "2020-05-21T04:11:17Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["lscs"], "history": [{"anon": "stud", "content": "<p>Not directly related to eecs department but thought I&#39;d ask here for some advice. I have a remote full-time internship over the summer, which I feel both <em>very</em> fortunate and thrilled about, but I&#39;m also quite unsure about how to make the best of it. Feel free to skip the past experience rant and just answer the direct questions :))</p>\n<p></p>\n<p>---</p>\n<p></p>\n<p>Last year (freshman/sophomore year for me) I had a sort of online internship thing at a small startup-- it was flexible in terms of hours and I got a chance to talk to some of the developers and poke around in the codebase, but it was unpaid (smh) and the work they were giving me always felt like when you give your little sibling a video game console that&#39;s not plugged in to &#34;play&#34; alongside you. I was unfamiliar with the language/frameworks they were using, and I tried learning it to catch up but it was very discouraging because I&#39;d reach out for help and get a response a really long time later and it was difficult to make any progress. Plus, I was trying to do this over the school year alongside classes so it was just difficult to work out, and I&#39;m ashamed to say the company and I pretty much ended up ghosting each other. I think I could&#39;ve communicated a lot better and taken more of an initiative to figure things out myself, but the whole experience left a bad taste in my mouth and was a waste of time for everyone involved; I promised anyone who&#39;d listen that I&#39;d never take another online internship since remote work wasn&#39;t for me and I was looking for a more enriching office experience where I felt it would be easier to communicate with my team and actually get stuff done.</p>\n<p></p>\n<p>Unfortunately, I&#39;m not almighty, so I said the above not knowing that I (and many others) would end up in the same situation a year later but for different reasons. However, I&#39;m quite determined not to let my internship go downhill this time. I&#39;m just not sure how and would love advice from anyone who has done work in an online manner as a lot of us have will be doing. The gist seems to be just, communicate a lot more, but as this is my first real internship, I have some questions. </p>\n<p></p>\n<p>---</p>\n<p></p>\n<p>1. What does &#34;communicate more&#34; exactly mean? Suppose I&#39;ve been assigned something to do in the morning-- what should my workflow be if I am unsure of how to get it done? How long do I spend searching things up on my own before I reach out for help? I have a tendency to rubber-duck people even outside of coding (I try for a little bit and can&#39;t do/find something -&gt; text someone about it -&gt; immediately find the solution and send another message saying &#34;oop got it&#34;) which I&#39;m sure will get annoying fast, but I also don&#39;t want to just be stuck when it&#39;s okay to reach out for help. </p>\n<p></p>\n<p>2. How do I build a good relationship with my manager/mentor/etc...?</p>\n<p></p>\n<p>3. If it&#39;s full time, should I expect to literally sit in front of my computer and work and/or talk to people for the entire 8 hours? I&#39;m a little apprehensive about this since it sounds overwhelming. </p>\n<p></p>\n<p>4. How much communication do you usually have with your fellow interns on the same team (work-wise, not social)? I know this depends company to company, but usually would I be working on the same project (and same part of the project) with some other interns under a mentor, or would the mentor just be supervising multiple distinct projects? </p>\n<p></p>\n<p>I&#39;d appreciate help anyone has about any or all of the questions, since I&#39;m kind of scared about what to expect from next week especially given that my last online experience went terribly. Thanks!</p>", "created": "2020-05-21T04:11:17Z", "subject": "online/remote internship advice please !!", "uid_a": "a_0"}], "history_size": 1, "i_edits": [], "id": "kag9csr89rkwp", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 1, "no_answer_followup": 0, "nr": 12301, "num_favorites": 3, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654543481697, "tag_good": [{"admin": false, "endorser": {"global": 1567211949, "jq33x9vemkj5xj": 1548611054, "jxzgoek4x4j4u6": 1567647586}, "facebook_id": null, "id": "jjzd0ebjf50lh", "name": "Aishani Sil", "photo": "1603429714_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jjzd0ebjf50lh/1603429714_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvgcjtoby4zk", "name": "Anita Shen", "photo": null, "photo_url": null, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j3u6gbhut582j2", "name": "Joon Suk Park", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j3jn0rk05ds5jm", "name": "Aman Sidhant", "photo": "1505530194_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/j3jn0rk05ds5jm/1505530194_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jvydfbvhfxs3kt", "name": "Kishore Kumar", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p9mf96y2ty", "name": "Henry Muller", "photo": "1484632252_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/is6p9mf96y2ty/1484632252_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvhcjpozd5xg", "name": "Atharva Mehendale", "photo": "1596323170_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jktvhcjpozd5xg/1596323170_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6lrx7lxeqz3e4", "name": "Tsai-Jwu (Judy)", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p6j9n6u55fp", "name": "Katie Gu", "photo": "1513749563_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/is6p6j9n6u55fp/1513749563_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jx6qr6jbq1ou6", "name": "Diraj Thajali", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jjzd0ebjf50lh", "jktvgcjtoby4zk", "j3u6gbhut582j2", "j3jn0rk05ds5jm", "jvydfbvhfxs3kt", "is6p9mf96y2ty", "jktvhcjpozd5xg", "j6lrx7lxeqz3e4", "is6p6j9n6u55fp", "jx6qr6jbq1ou6"], "tags": ["lscs", "student", "unanswered"], "type": "question", "unique_views": 422}