{"bookmarked": 6, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "kb3x6yz1sml2u3", "type": "create", "uid_a": "a_0", "v": "all", "when": "2020-06-06T17:37:18Z"}, {"anon": "stud", "to": "kb3x6yyyssw2u2", "type": "followup", "uid_a": "a_1", "when": "2020-06-06T17:52:39Z"}], "children": [{"anon": "stud", "bucket_name": "Yesterday", "bucket_order": 4, "children": [], "config": {}, "created": "2020-06-06T17:52:39Z", "d-bucket": "Yesterday", "data": {"embed_links": null}, "folders": [], "id": "kb3xqpf9v3j388", "no_answer": 0, "no_upvotes": 0, "subject": "I took 70 and 134 concurrently last spring. In the first half of the semester, there&#39;ll be no overlap between the classes. But 134 makes the second half of 70 very very easy. Almost everything you&#39;ll learn in the probability half of 70 will already have been covered in significantly more detail in 134, especially continuous probability.", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jy4fy8z41mo5fj", "name": "Emily Su", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jy4fy8z41mo5fj"], "type": "followup", "uid_a": "a_1", "updated": "2020-06-06T17:52:39Z"}], "config": {"seen": {"2498": 5, "3762": 6, "3810": 2, "3845": 8, "7947": 7, "8060": 4, "8343": 3, "9155": 9, "9447": 1, "9963": 0}}, "created": "2020-06-06T17:37:18Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["cs-intended", "peer_directed"], "history": [{"anon": "stud", "content": "<md>Hi! I'm a rising sophomore and I'm looking for some course advice for next semester. Currently, my plan is 70, Stat 134, Math 54, and UGBA 10. Since I've taken EE 16A&B already (I'm taking Math 54 as a prereq for a major that doesn't accept EE 16A&B as a substitute), I feel like the workload for Math 54 will be manageable (though I'm still expecting to spend a decent amount of time on it).\n\nI was wondering if it would be a good idea to add another course. The options I'm considering are 370, Data 100, a breadth, or just taking those 4 courses. My concern with 370 is how much I'd learn from tutoring people online vs. in person (if anyone took this class this semester, could you comment on transitioning from in person to online tutoring?) I'm not sure if the workload of Data 100 would be manageable on top of CS 70 or Stat 134 (especially because I haven't taken Data 8).\n\nFor reference, this semester, I took 61B, 16B, Econ 1 and an upper division global studies class. I found 61B to be good, 16B to be difficult (I understood the first module on diffeqs and phasors but got lost in the controls module, though this may be because I always went to in person EE lectures and found it difficult to transition to the online recordings), Econ 1 to be good, and my global studies class to be really really overwhelming (mostly due to the readings and essays, but I'm not planning to take any reading-heavy classes next semester).\n\nAlso, could anyone who's taken both 70 and Stat 134 provide context on how much overlap there is? My understanding is that Stat 134 covers the second half of 70, but does it cover the same material to the same depth? For now, I'm treating 70 and Stat 134 as 2 separate technical classes, but I was wondering if it could be treated as like 1.5 or 1.75 technical classes (not sure if this fully makes sense, but just wondering about the overlap).\n\nCould anyone provide some advice? Thanks in advance!</md>", "created": "2020-06-06T17:37:18Z", "subject": "Schedule Advice", "uid_a": "a_0"}], "i_edits": [], "id": "kb3x6yyyssw2u2", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 1, "no_answer_followup": 0, "nr": 12424, "num_favorites": 1, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654543345545, "tag_good": [], "tag_good_arr": [], "tags": ["cs-intended", "peer_directed", "student", "unanswered"], "type": "question", "unique_views": 221}