{"bookmarked": 12, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "full", "data": "i6syqovn25pz5", "type": "create", "uid_a": "a_0", "when": "2015-03-03T07:17:32Z"}, {"anon": "no", "to": "i6syqovdcwiz4", "type": "followup", "uid": "gxtxzujx6wi39i", "when": "2015-03-03T07:47:26Z"}, {"anon": "full", "to": "i6syqovdcwiz4", "type": "feedback", "uid_a": "a_0", "when": "2015-03-03T07:49:04Z"}, {"anon": "no", "to": "i6syqovdcwiz4", "type": "followup", "uid": "h5zluo505iq3kr", "when": "2015-03-03T08:37:36Z"}, {"anon": "full", "to": "i6syqovdcwiz4", "type": "followup", "uid_a": "a_1", "when": "2015-03-03T09:50:45Z"}, {"anon": "stud", "to": "i6syqovdcwiz4", "type": "followup", "uid_a": "a_2", "when": "2015-03-03T10:14:00Z"}, {"anon": "full", "to": "i6syqovdcwiz4", "type": "feedback", "uid_a": "a_3", "when": "2015-03-03T10:26:35Z"}, {"anon": "full", "to": "i6syqovdcwiz4", "type": "feedback", "uid_a": "a_0", "when": "2015-03-03T10:28:39Z"}, {"anon": "full", "to": "i6syqovdcwiz4", "type": "feedback", "uid_a": "a_1", "when": "2015-03-03T10:35:50Z"}, {"anon": "full", "to": "i6syqovdcwiz4", "type": "feedback", "uid_a": "a_0", "when": "2015-03-03T10:36:37Z"}, {"anon": "full", "to": "i6syqovdcwiz4", "type": "feedback", "uid_a": "a_3", "when": "2015-03-03T10:38:49Z"}, {"anon": "full", "data": "i6t63ohgdf5on", "type": "update", "uid_a": "a_0", "when": "2015-03-03T10:43:36Z"}, {"anon": "full", "to": "i6syqovdcwiz4", "type": "feedback", "uid_a": "a_1", "when": "2015-03-03T10:50:59Z"}, {"anon": "no", "to": "i6syqovdcwiz4", "type": "followup", "uid": "gru0m5sforh", "when": "2015-03-04T08:44:02Z"}, {"anon": "stud", "to": "i6syqovdcwiz4", "type": "feedback", "uid_a": "a_2", "when": "2015-03-04T08:44:17Z"}, {"anon": "stud", "to": "i6syqovdcwiz4", "type": "feedback", "uid_a": "a_2", "when": "2015-03-04T08:46:31Z"}, {"anon": "no", "data": "i7fas3phfjd2b2", "to": "i6syqovdcwiz4", "type": "s_answer", "uid": "grs17gxlxgg", "when": "2015-03-18T22:25:30Z"}], "children": [{"anon": "no", "bucket_name": "Week 3/1 - 3/7", "bucket_order": 264, "children": [{"anon": "full", "bucket_name": "Week 3/1 - 3/7", "bucket_order": 264, "children": [], "config": {}, "created": "2015-03-03T07:49:04Z", "data": {"embed_links": null}, "folders": [], "id": "i6szv8jk9swur", "subject": "<p>Graduating early is not on the table. Thanks though!</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_0", "updated": "2015-03-03T07:49:04Z"}, {"anon": "full", "bucket_name": "Week 3/1 - 3/7", "bucket_order": 264, "children": [], "config": {}, "created": "2015-03-03T10:36:37Z", "data": {"embed_links": null}, "folders": [], "id": "i6t5upgp3j64r1", "subject": "<p>jk graduating is possibility! ^</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_0", "updated": "2015-03-03T10:36:37Z"}], "config": {}, "created": "2015-03-03T07:47:26Z", "data": {"embed_links": null}, "folders": [], "id": "i6szt4ph5v05qn", "no_answer": 1, "no_upvotes": 0, "subject": "<p>Hmm this is not the answer you&#39;re looking for (which is why I&#39;m not listing it as &#34;the student&#39; answer&#34;) but another option you could consider is to graduate a semester early :). That way you save a bunch of money that would otherwise go to tuition and you get a head start with your post grad stuff (apply for jobs, grad school, etc).</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "gxtxzujx6wi39i", "updated": "2015-03-03T07:47:26Z"}, {"anon": "no", "bucket_name": "Week 3/1 - 3/7", "bucket_order": 264, "children": [], "config": {}, "created": "2015-03-03T08:37:36Z", "data": {"embed_links": null}, "folders": [], "id": "i6t1ln10p7o16f", "no_answer": 0, "no_upvotes": 0, "subject": "<p>I think you should go study abroad if you really want to. If you just want to have a chill semester, you might as well stay here. The experience is different when you view it differently. I recommend doing it if you want study abroad experience, which in my opinion is really valuable.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "h5zluo505iq3kr", "updated": "2015-03-03T08:37:36Z"}, {"anon": "full", "bucket_name": "Week 3/1 - 3/7", "bucket_order": 264, "children": [], "config": {}, "created": "2015-03-03T09:50:45Z", "data": {"embed_links": null}, "folders": [], "id": "i6t47pp4xkf5q0", "no_answer": 0, "no_upvotes": 0, "subject": "<p>I&#39;m writing this from Yangshuo, China. I am in a similar position as you. I would have fulfilled my requirements this spring semester had I stayed. It&#39;s surprisingly easy to take a gap semester off. I would definitely recommend it (whether studying abroad or traveling abroad). The timing is very optimal, and most of the travelers I meet on the road said they regret not doing it when they were younger (although this is a biased sample). One of my favorite things about being away from the Berkeley environment/tech bubble has actually been to be able to have conversations with different folks who aren&#39;t talking about problem sets or job hunting. Feel free to ask me any questions! I&#39;ll be back in Cal in the Fall to finish my last requirements. </p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_1", "updated": "2015-03-03T09:50:45Z"}, {"anon": "stud", "bucket_name": "Week 3/1 - 3/7", "bucket_order": 264, "children": [{"anon": "full", "bucket_name": "Week 3/1 - 3/7", "bucket_order": 264, "children": [], "config": {}, "created": "2015-03-03T10:26:35Z", "data": {"embed_links": null}, "folders": [], "id": "i6t5ht3x4hc21y", "subject": "Where are you traveling, and how are you funding it? How long will you be traveling, and what do you plan jobwise afterwards?\n\nI&#39;m thinking about doing something cool like this too!", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2015-03-03T10:26:35Z"}, {"anon": "full", "bucket_name": "Week 3/1 - 3/7", "bucket_order": 264, "children": [], "config": {}, "created": "2015-03-03T10:28:39Z", "data": {"embed_links": null}, "folders": [], "id": "i6t5kgnxhpg4rt", "subject": "<p>I was considering this, but people say that traveling is not that same as studying abroad because you do not get immersed. Also, say if I do graduate early and travel, do I tell my employer I am graduating Dec 2015 or May 2016? </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_0", "updated": "2015-03-03T10:28:39Z"}, {"anon": "full", "bucket_name": "Week 3/1 - 3/7", "bucket_order": 264, "children": [], "config": {}, "created": "2015-03-03T10:35:50Z", "data": {"embed_links": null}, "folders": [], "id": "i6t5touzhog30e", "subject": "<p>(From Yangshuo): It&#39;s been pretty cheap backpacking here. Rooms cost around $5-7/night and the meals $3-4. I&#39;m actually saving money by not paying tuition. My trip has been funded by my internship money. So far I&#39;ve been to Taiwan, Korea, Japan, and China. </p>\n<p></p>\n<p>I would consider solo-traveling, since I&#39;m not bound to a place or school schedule like most study abroad folks. I&#39;ve met interesting folks here, both international and local. I agree you aren&#39;t as immersed traveling as you are studying abroad, but not to say the experience is not immersive. I love talking to kids and old people, and that&#39;s something you don&#39;t get out of studying at a university. I actually feel more comfortable talking to folks not my age now haha. </p>\n<p></p>\n<p>I&#39;ll be traveling til may when my summer internship starts. I got my shit together before I left, both academically and professionally. Most people travel between when they graduate and when their job starts. </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_1", "updated": "2015-03-03T10:35:50Z"}, {"anon": "full", "bucket_name": "Week 3/1 - 3/7", "bucket_order": 264, "children": [], "config": {}, "created": "2015-03-03T10:38:49Z", "data": {"embed_links": null}, "folders": [], "id": "i6t5xj6c55q7hq", "subject": "^ Is there a language barrier when you&#39;re in Taiwan, Korea, Japan, and China? Thanks for sharing your experience, it&#39;s very helpful!", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2015-03-03T10:38:49Z"}, {"anon": "full", "bucket_name": "Week 3/1 - 3/7", "bucket_order": 264, "children": [], "config": {}, "created": "2015-03-03T10:50:59Z", "data": {"embed_links": null}, "folders": [], "id": "i6t6d6hs9lv5l7", "subject": "<p>I can speak Mandarin, so Taiwan and China has been fairly frictionless. </p>\n<p></p>\n<p>You can get by with surprisingly few phrases. Body language covers a lot of use cases. Lots of people also know some rudimentary English, as it&#39;s been introduced into the education system starting from middle school. Koreans like meeting foreigners, and there are language exchange cafes there where you can meet locals who want to meet you. In Japan and Taiwan, everyone&#39;s super nice and knows basic English. All the hostels I&#39;ve stayed at have English speaking staffs who will help you do everything in the area, from purchasing tickets to booking trains to recommending places.</p>\n<p></p>\n<p>I would recommend learning a bit of Korean and Japanese before going. You can pretty fluently pronounce 95% of words in Korean with 1-2 hours of training, and Japanese (minus Kanji) with 6-8 hrs. There are lots of borrowed words you can start recognizing. Chinese is hard, and I wouldn&#39;t recommend learning more than the necessary phrases. </p>\n<p></p>\n<p>I&#39;m learning more about my travel style as I go, and had I known better, I would have tried to meet more locals who can show me around. In that case, there would be 0 language barrier :) </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_1", "updated": "2015-03-03T10:50:59Z"}, {"anon": "stud", "bucket_name": "Week 3/1 - 3/7", "bucket_order": 264, "children": [], "config": {}, "created": "2015-03-04T08:44:17Z", "data": {"embed_links": null}, "folders": [], "id": "i6uha33p3265jo", "subject": "<p>Poster: I&#39;ve been traveling since January and have been to Japan, Korea, Taiwan, and am currently in Vietnam. Japan was the most expensive place for me, but totally worth it. I still have all of southeast Asia to go! (Planning to go to Cambodia, Thailand, Laos and anywhere else as I go). I&#39;m really playing most of it by ear, and I&#39;ve gotten help via couchsurfing.com (you stay with locals, who are usually also travelers, for free) and hostelworld.com). </p>\n<p></p>\n<p>For dealing with language barriers, Google translate has been helpful. In each country you can can a sim card for relatively cheap (I.e. in Vietnam I paid 10 for unlimited data for month)</p>\n<p></p>\n<p>I worked at internships for both my sophomore and junior year summers and I TA&#39;d for 3 semesters, so I&#39;m using all my savings. Also, if you get a job before then, some companies give you a signing bonus that helps fund your travels. </p>\n<p></p>\n<p>Solo traveling is a different experience than study abroad. Its a completely different experience living in a place for a few months, which is something I wish I could have done as being a vagabond gets a little tiring (but is totally worth it)</p>\n<p></p>\n<p>Let me know if you have other questions / if you actually do it I have tons of advice </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_2", "updated": "2015-03-04T08:44:17Z"}, {"anon": "stud", "bucket_name": "Week 3/1 - 3/7", "bucket_order": 264, "children": [], "config": {}, "created": "2015-03-04T08:46:31Z", "data": {"embed_links": null}, "folders": [], "id": "i6uhcz4ibie38w", "subject": "<p>Whoops, just saw that I missed a few of your questions. I&#39;m planning on traveling until graduation in May so I can walk with all my friends. I spent a lot of fall semester recruiting and deciding on where I was going to go work</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_2", "updated": "2015-03-04T08:46:31Z"}], "config": {}, "created": "2015-03-03T10:14:00Z", "data": {"embed_links": null}, "folders": [], "id": "i6t51m63uum1t4", "no_answer": 0, "no_upvotes": 0, "subject": "<p>You should solo travel, otherwise stay and take some classes from famous professors and brilliant minds you&#39;ll likely never have to chance to do again! I personally graduated a semester early and have been traveling for 2 months now. As the person above said, its pretty nice ( and o think incredibly important) to see what else the works offers and the state of the world outside of the tech bubble. It makes you appreciate more of what you have and really understand and empathize more with the social issues going on in the world. Solo travel is terrifying and freeing at the same time. You&#39;ll be able to meet people from all over the world and simply put, it&#39;ll change your life.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_2", "updated": "2015-03-03T10:14:00Z"}, {"anon": "no", "bucket_name": "Week 3/1 - 3/7", "bucket_order": 264, "children": [], "config": {}, "created": "2015-03-04T08:44:02Z", "data": {"embed_links": null}, "folders": [], "id": "i6uh9s52gojad", "no_answer": 0, "no_upvotes": 0, "subject": "<p>I was in a similar situation as you and just decided to stay all 4 years.</p>\n<p></p>\n<p>Ask yourself what you really want to get out of this? Save money? More education? Traveling and learning about other places?</p>\n<p></p>\n<p>Your options:</p>\n<p>-Graduate this semester? I think this might be a good option, and it shouldn&#39;t be too late to be placed on the degree list, but I&#39;m guessing you might have had plans regarding this. Like it might be difficult to search for a job really quickly or you might have wanted to take more classes?</p>\n<p>-Study abroad? You should study abroad if you want to get to know another country/culture more in depth than traveling would bring. I would recommend study abroad in the fall so you get to finish your last semester at Cal. Sometimes it&#39;s harder to study abroad in the Spring depending on Berkeley being weird with final confirmation of degree stuff or because a lot of Spring programs end in June, in which case you might not be able to walk/get your transcripts to Berkeley in time. If you do really want to study abroad in the spring, I recommend you apply independently of Berkeley, which is what one of my friends is doing. She just graduated from Berkeley in the fall and got her degree. She applied independently to a program that ends before May. Berkeley has no knowledge of this/the classes don&#39;t count as her degree so there&#39;s no wait or clearing of degree stuff. Cons are that you have to research a lot on your own and apply independently and figure out everything by yourself.</p>\n<p>-Graduate a semester early and start work right away? Do this if you&#39;re just totally ready to move on and are really excited at your future company. You&#39;ll also save a lot of money/make money!</p>\n<p>-Graduate a semester early and travel? You should do this if you really love traveling and just want to visit a ton of places. A lot of my friends have also done this. They graduated early and took the entire semester and summer to travel because that&#39;s what they love to do, see new places and learn about the world.</p>\n<p></p>\n<p>I decided to stay because I didn&#39;t feel closure after 3.5 years. I had a job lined up and took all my fun classes for the fall. However, I am going to be moving away from the area after graduation. I wanted to be around my friends for longer and also to try some last opportunities at school. Also, money isn&#39;t an issue for me or something I considered being worth while to save compared the the experience I would be missing (especially since EECS salaries are so high comparatively to other majors). I decided against study abroad because I realized that I don&#39;t actually care that much about really learning about and living in another country. I love traveling and I did want to go abroad, but just in the traveling sense, and so I&#39;m doing that this summer. Mainly, I decided to stay because I didn&#39;t feel closure. I have some worries or last things I had to sort out before graduating. Some people just really want to get out of Berkeley because it&#39;s stressful, but when I was on the verge of graduation, I was just sad I&#39;d never get to learn for the sake of learning or be as closely connected with people like in the college environment again.</p>\n<p></p>\n<p>Let me know what you&#39;re looking for and I can give you some suggestions! ^_^</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "gru0m5sforh", "updated": "2015-03-04T08:44:02Z"}, {"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2015-03-18T22:25:30Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "no", "content": "<p>I would suggest studying abroad, since it&#39;s a wonderful experience.  (Traveling abroad isn&#39;t really the same... you get a different taste of things by actually living in the country and meeting local students, etc.)</p>\n<p></p>\n<p>Do make sure you talk to your advisor to ensure that senior residency requirements are satisfied before you decide to go abroad.  Also note that the deadline for summer programs should be coming shortly.</p>", "created": "2015-03-18T22:25:30Z", "subject": "", "uid": "grs17gxlxgg"}], "id": "i7fas3pdoau2b1", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "h61cxrcrad01f", "name": "Eric Quach", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "iscem14kbsu5vi", "name": "Keerthi Bhattaram", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["h61cxrcrad01f", "iscem14kbsu5vi"], "type": "s_answer"}], "config": {"bypass_email": true}, "created": "2015-03-03T07:17:32Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": {}, "folders": ["other", "cs"], "history": [{"anon": "full", "content": "<p>I am currently a junior, and I am taking my 5th and 6th CS upper div. I&#39;m going to be done with all of my graduation requirements at the end of this semester. Next semester, I plan on taking one more CS class &#43; chill classes. For my last semester, should I go abroad or stay at Cal? (I don&#39;t think there are any other CS courses that I would take or can take this last semester). Thanks in advance! :)</p>", "created": "2015-03-03T10:43:36Z", "subject": "Study Abroad or Stay Last Semester?", "uid_a": "a_0"}, {"anon": "full", "content": "I am currently a junior, and I am taking my 5th and 6th CS upper div. I&#39;m going to be done with all of my graduation requirements at the end of this semester. Next semester, I plan on taking one more CS class &#43; chill classes. For my last semester, should I go abroad or stay at Cal? (I don&#39;t think there are any other CS courses that I would take or can take this last semester). ", "created": "2015-03-03T07:17:32Z", "subject": "Study Abroad or Stay Last Semester?", "uid_a": "a_0"}], "i_edits": [], "id": "i6syqovdcwiz4", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 1, "nr": 129, "num_favorites": 1, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654556667022, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "hzd1lggffoe2x7", "name": "Edward Wang", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "hzd1mqixul1476", "name": "Wei You", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "iscem14kbsu5vi", "name": "Keerthi Bhattaram", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["hzd1lggffoe2x7", "hzd1mqixul1476", "iscem14kbsu5vi"], "tags": ["cs", "other", "student"], "type": "question", "unique_views": 577}