{"bookmarked": 6, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "keekxb3ouh53v", "type": "create", "uid": "h87kastcacfxt", "v": "all", "when": "2020-08-28T18:38:27Z"}], "children": [], "config": {"is_announcement": 1}, "created": "2020-08-28T18:38:27Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements", "eecs", "cs-intended", "lscs"], "history": [{"anon": "no", "content": "<div dir=\"ltr\">\n<div>\n<div>\n<div>\n<div>\n<div dir=\"ltr\">\n<div dir=\"ltr\">\n<p><i>Open. Apprentices needed for the fall semester. Enter your application on the web beginning August 19th. The deadline to apply is Monday, August 31st at 9 AM.</i></p>\n<p><i></i></p>\nIn this project, which will contribute to the 150W History Project for the celebration during 2020 of the 150 years of women at Berkeley (<a href=\"http://150w.berkeley.edu/\" target=\"_blank\" rel=\"noopener noreferrer\">150w.berkeley.edu</a>), we seek to look at the context for the formation and history of women student organizations, the reasons why students organized the groups, and what they have accomplished. Why were certain groups formed and to what issues or conditions did they respond? How have the organizations changed ? How has the leadership of women students evolved over time? Undergraduate researchers will have a broad choice of organizations from which to choose, at both the undergraduate and graduate levels. There are many groups to investigate. </div>\n<div dir=\"ltr\"><br />Examples of earliest women&#39;s groups include but are not limited to:<br />Association of Women Students 1894 (before merging with the ASUC in 1923); the Prytanean Honor Society formed in 1901 (the first honor society for women undergraduates); the Chemistry Fiends for women chemistry students (1900); the XYZ Club for women in mathematics; the YWCA, closely associated with the campus; the Greek sororities, including the two African American Sororities and the two Jewish sororities, and the Society of Women Engineers. Examples of more recent groups include BiasBusters; Graduate Women&#39;s Project; Society of Women in the Physical Sciences; Womxn in Mathematics, Noether Circle, Graduate Women’s Project of the Graduate Assembly.<br /><br /><br />The URAP student or team will explore the women&#39;s organizations of their choice.<br />The student will investigate primary and secondary sources, including the Daily Cal archive, annual reports of individual organizations, relevant oral histories,<br />Blue and Gold Yearbook, Reports to the President of UC, and the Chronicles of the University of California (online). The bibliography will contribute to the existing 150W bibliography.<br /><br />The student researcher(s) will write an essay or essays on the history of group or groups of their choice. The essays will be posted attributed to the student author on the 150W History Project webpages. The mentor will work with students to produce a final draft.<br /><br />In some cases the student may interview Cal alumnae of specific groups, or faculty sponsors, and incorporate the interview material into the essay.<br />Learning outcomes:<br />research with primary and secondary materials<br />expository writing and editing skills<br />interview skills<br />history of women students at Berkeley<br /><br />Day-to-day supervisor for this project: Sheila Humphreys, PhD, Co-chair, 150W History Project<br /><br />Qualifications: Interest in the history of women student organizations at Berkeley and women’s leadership Interest in writing an essay showing the results of URAP research topic Excellent communication and writing skills Familiarity with Google sheets Commitment to a weekly or bi-weekly meeting with the mentor on Zoom <br /><br />Weekly Hours: to be negotiated, minimum 3<br /><br />Off-Campus Research Site: remote\n<p>Related website: <a href=\"http://150w.berkeley.edu/\" target=\"_blank\" rel=\"noopener noreferrer\">http://150w.berkeley.edu</a><br />Related website: <a href=\"https://ours.ist.berkeley.edu/urap/portal/150w.berkeley.edu/150w-history-portal-archive\" target=\"_blank\" rel=\"noopener noreferrer\">150w.berkeley.edu/150w-history-portal-archive</a><br /><br /></p>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<div>\n<blockquote>\n<div>\n<blockquote>\n<div dir=\"auto\">\n<blockquote>\n<div dir=\"ltr\">\n<div>\n<blockquote>\n<div dir=\"ltr\">\n<div></div>\n</div>\n</blockquote>\n</div>\n</div>\n</blockquote>\n</div>\n</blockquote>\n</div>\n</blockquote>\n</div>", "created": "2020-08-28T18:38:27Z", "subject": "Women Student Leadership: History of Women Student Organizations on the Berkeley Campus from 1870", "uid": "h87kastcacfxt"}], "i_edits": [], "id": "keekxb3lkj33u", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 13058, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654542640371, "tag_good": [], "tag_good_arr": [], "tags": ["announcements", "cs-intended", "eecs", "instructor-note", "lscs"], "type": "note", "unique_views": 340}