{"bookmarked": 6, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "kew2yegtthmnk", "type": "create", "uid": "j6mlc0ribwz3d3", "v": "all", "when": "2020-09-10T00:35:16Z"}], "children": [], "config": {"seen": {"10183": 0, "10184": 2, "5776": 8, "6095": 3, "6159": 6, "6225": 9, "6262": 4, "6584": 5, "7568": 7, "7632": 1}}, "created": "2020-09-10T00:35:16Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements", "cs-intended", "peer_directed", "lscs", "research", "enrichment_opportunities", "other"], "history": [{"anon": "no", "content": "Hello!\n\nWe would like to inform you of an extracurricular research opportunity. Undergraduate Laboratory at Berkeley (ULAB) is a STEM education startup that gently introduces new students to research at Berkeley as well as provides a social/mentoring experience for advanced undergraduate researchers to learn from each other and develop professionally.\n\nULAB is looking for student researchers for their Data Science Lab to develop and execute independent data science research projects. We are looking for students with an interest in Data Science. It’s recommended for students who are taking (or have taken) classes like Data 8, or have any basic data science skills. Students will learn how to conduct research in a professional group setting, along with basic lab networking skills. The time commitment is usually 4-5 hours per week, and specific work hours are flexible. Students can earn up to 2 P/NP upper-division EE/CS units. \n\nULAB is looking for mentors for their Data Science Lab to lead independent research projects for teams of freshman students. We are looking for students with a strong foundation in Data Science. A statistics, computer science, or data science background is preferred, and relevant research or project experience. Mentors will assist a small group of students in grasping fundamental concepts within the respective field and later on, help the students develop and carry out a complete research project over the course of the semester. Mentors should be willing to commit 4-5 hours per week. Specific work hours are flexible, and mentors can earn up to 2 P/NP upper-division EE/CS units. Note that this is a year-long appointment, so kindly only apply if you will be enrolled at Berkeley until the end of the current academic year. \n\nFor more information regarding ULAB and applications, please visit the website at ulab.berkeley.edu or email inquiries to alanlp@berkeley.edu. Thank you. \n\nIf you are interested in being a student researcher, please fill out this Google Form:  https://forms.gle/gNbAps53HBwMnqLA9\nIf you are interested in being a student mentor, please fill out this Google Form:  https://forms.gle/AfHHbLF3GjKiQbio9", "created": "2020-09-10T00:35:16Z", "subject": "Undergraduate Data Science Research Opportunity", "uid": "j6mlc0ribwz3d3"}], "i_edits": [], "id": "kew2yegpu3znj", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 1, "no_answer_followup": 0, "nr": 13130, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654542564208, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jc8k8uhkgp85pz", "name": "Zhendong Xie", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6nu3e95eis3fw", "name": "Jeremy Yeung", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jc8k8uhkgp85pz", "j6nu3e95eis3fw"], "tags": ["announcements", "cs-intended", "enrichment_opportunities", "lscs", "other", "peer_directed", "research", "student", "unanswered"], "type": "question", "unique_views": 351}