{"bookmarked": 6, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "kglwnnazeck1a4", "type": "create", "uid": "jgf3o98xu7u19x", "v": "all", "when": "2020-10-23T07:00:39Z"}], "children": [], "config": {}, "created": "2020-10-23T07:00:39Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["workshops", "events"], "history": [{"anon": "no", "content": "<p>The UC Berkeley Cloud Community of Practice’s (https://www.meetup.com/ucberkeley_cloudmeetup) 19th meetup will feature a roundtable in recognition and support of Disability Awareness month. UC Berkeley’s resident expert on accessibility, Lucy Greco and Hadi Rangin a technology accessibility expert from the University of Washington will explore accessibility in cloud services. As UC Berkeley’s Vice Chancellor for Administration, Marc Fisher wrote this week: “The UC Berkeley community celebrates disability awareness in October each year, and this year is especially meaningful as it is the 30th anniversary of the passage of the Americans with Disabilities Act. The Berkeley campus is the home of the Disability Rights/Independent Living Movement and we are excited to share several announcements and events related to disability awareness.”<br /><br />The roundtable will be followed by a presentation by Jeff D’Ambrogia from the Lawrence Berkeley Lab, on the Lab’s accelerating moves toward the use of cloud computing for research. After Jeff’s talk we will round out the meetup by previewing the initial results of the community survey we sent out earlier this month with a chance for everyone who stays to discuss them.<br />Everyone is welcome - this is a really inclusive group! You don’t have to be an expert, or already know about cloud technologies; we get together so people can learn from each other.<br /><br />CONNECT VIA ZOOM: Our Zoom connection info changes each month and is posted here in meetup invite.<br /><br /><br />AGENDA:<br />5:00 Host welcome and announcements<br />5:10: Round table discussion: Lucy Greco, Hadi Rangin<br />The largest adoption of cloud services are those SaaS (Software As A Service) tools we all use-- from AirTable to Zoom there are literally hundreds of options. When picking a tool it’s important to consider accessibility and how your choice will affect the community. Lucy and Hadi will discuss how to choose cloud tools, how your choices influence inclusion -- and help bring alive what the user experience can be like for people with disabilities. Lucy and Hadi have both done a lot of work influencing many cloud service providers and will talk about how partnerships have moved the ball closer to a more equitable cloud.<br />Lucy and Hadi will take questions and help you create a strategy for a more accessible cloud.<br />5:45 Jeff D’Ambrogia / Scientific IT Consultant, Lawrence Berkeley Lab: Jeff will present about how LBL has begun to embrace the cloud. He’ll talk about LBL’s cloud services including their new program with Google. The move from traditional data center computing to the cloud is a big deal up at LBL and Jeff will fill us in!<br />6:10 Survey Preview &amp; Discussion: For those who would like to stay on Zoom after the main feature, we will preview results of the Cloud Meetup survey to share some preliminary trends and use the time as a forum to hear from you in the community on what you’d like to see from our meetup in the future.<br />6:30 pm - End/ “Doors” close.</p>", "created": "2020-10-23T07:00:39Z", "subject": "VIRTUAL -- UC Berkeley Cloud Meetup 019", "uid": "jgf3o98xu7u19x"}], "history_size": 1, "i_edits": [], "id": "kglwnnaw8qb1a3", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 13506, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654542150681, "tag_good": [], "tag_good_arr": [], "tags": ["events", "student", "workshops"], "type": "note", "unique_views": 219}