{"bookmarked": 7, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "kj5ajtbvkcr2ba", "type": "create", "uid_a": "a_0", "v": "all", "when": "2020-12-26T05:56:37Z"}], "children": [], "config": {"seen": {"10807": 8, "13212": 0, "13344": 6, "13432": 4, "13472": 7, "13481": 3, "2373": 9, "4575": 5, "5730": 2, "7714": 1}}, "created": "2020-12-26T05:56:37Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["other", "eecs", "enrollments", "tutoring", "workshops", "events", "policy", "faculty_advising", "cs-intended", "peer_directed", "lscs", "enrichment_opportunities", "research"], "history": [{"anon": "stud", "content": "<p>Professor Sahai on courses <strong>before </strong>CS 189:</p>\n<p></p>\n<p>&#34;&#34;&#34;</p>\n<p>Remember, machine learning is about modeling problems using linear algebra and probability so that a judicious application of optimization will let you make useful progress in leveraging the data you have. The three foundations are linear algebra, probability, and optimization (with a dash of control). </p>\n<p></p>\n<p>The standard advice applies:</p>\n<p></p>\n<p>0) If you have the time, it is best to take both EECS126 and 127 ahead of 189. You will get the most out of machine learning if you do so since you will be able to focus on the machine learning concepts instead of getting lost or bogged-down in optimization and probability. </p>\n<p></p>\n<p>1) If you have taken EE16AB, then the single best class to take after 70 to prepare for 189 is 126. EE16AB &#43; Math 53 &#43; 70 &#43; 126 is adequate minimal prep for 189. Take 189. You will experience a learning curve with respect to optimization material since the introduction to optimization thinking in Math 53 and EE16AB is very basic, but you should be able to follow along and understand what is going on.  EECS126 will also deepen your ability to model problems.</p>\n<p></p>\n<p>2) If you have not taken EE16AB nor any other linear-algebra&amp;optimization-oriented course (Math 54 is not enough here), then you should preferentially take EECS127 ahead of taking 189. Not only will your linear algebra be strengthened, but your optimization fundamentals will be built up and lots of examples in 127 are actually straight-up machine learning. Your ability to model problems will be strengthened as well. When you subsequently approach machine learning, you will experience a learning curve with respect to the probability material since the introduction to probability in 70 is very basic, and half a semester&#39;s worth of exposure is not really enough practice. But with solid grounding in optimization, you might be able to overcome the gaps in your background.</p>\n<p></p>\n<p>3) Fundamentally, it is a lot easier to self-teach yourself machine learning (leveraging many nice online tutorials, blog posts, webcasts, etc...) once you have a solid grounding in probability and optimization. (Especially since 127 actually hits some machine-learning methods directly.) You can follow along and then learn by doing. It&#39;s not as good as taking a solid foundations-oriented machine learning class like 189 and powering through the homeworks, but it is far easier to learn machine learning on your own knowing probability and optimization, than it is to learn probability or optimization while only half-heartedly knowing machine learning.</p>\n<p></p>\n<p>Probability and optimization are both fundamental to many areas beyond machine-learning. In a real sense, the modern rise of machine learning as a generic tool that should be in every EECS students&#39; toolbox is really about how the software/hardware/cloud ecosystem has now made probability and optimization more accessible generically, with the ability to derive data-driven models and solve non-convex problems without heroic coding effort or the need to find ultra-clever models that are tractable. The barrier-to-entry has been lowered considerably. </p>\n<p>&#34;&#34;&#34;</p>", "created": "2020-12-26T05:56:37Z", "subject": "Courses before 189", "uid_a": "a_0"}], "history_size": 1, "i_edits": [], "id": "kj5ajtbrwe02b9", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 14001, "num_favorites": 4, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654541601995, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jyeobq4n3ao7kw", "name": "Merrick Wang", "photo": "1584281693_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jyeobq4n3ao7kw/1584281693_200.jpg", "published": true, "role": "", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jlxg6x4jxklki", "name": "Gurkaran Singh Goindi", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jyeqkpt0e8023s", "name": "Lucy Wan", "photo": "1599950541_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jyeqkpt0e8023s/1599950541_200.jpg", "published": true, "role": "student", "us": false}], "tag_good_arr": ["jyeobq4n3ao7kw", "jlxg6x4jxklki", "jyeqkpt0e8023s"], "tags": ["cs-intended", "eecs", "enrichment_opportunities", "enrollments", "events", "faculty_advising", "lscs", "other", "peer_directed", "policy", "research", "student", "tutoring", "workshops"], "type": "note", "unique_views": 448}