{"bookmarked": 11, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "kjgkb8yijv722i", "type": "create", "uid_a": "a_0", "v": "all", "when": "2021-01-03T03:15:22Z"}, {"anon": "stud", "data": "kji03ba7mzg60i", "to": "kjgkb8yev7k22h", "type": "s_answer", "uid_a": "a_1", "when": "2021-01-04T03:24:52Z"}, {"anon": "stud", "cid": "kjiznjl2wcjbe", "to": "kjgkb8yev7k22h", "type": "followup", "uid_a": "a_2", "when": "2021-01-04T20:00:22Z"}, {"anon": "stud", "cid": "kjjfi6zlfyv40f", "to": "kjgkb8yev7k22h", "type": "feedback", "uid_a": "a_3", "when": "2021-01-05T03:24:06Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2021-01-04T03:24:52Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>Math-wise, both cover differential equations. In EE16B, you probably will have more practice in representing a system of differential equations with a matrix. EE16B touches on complex vector space. Therefore, you will see imaginary numbers in linear algebra part. So hermitian, inner product over complex plane will pop up. But these shouldn&#39;t create a huge gap from Math 54 (frankly, I learned those concepts better in Math 110 than EE16B). And I also don&#39;t think EE16A goes over those concepts deeply.</p>\n<p></p>\n<p>The major gap would be circuits. Luckily, the circuit part didn&#39;t rely much on abstract physics knowledge. Instead, it&#39;s more &#34;formula-oriented&#34;. I forgot most of the electromagnetic part of physics from high school. But I self study material from EE16A, like capacitance, current, voltage, opamp etc. It turned out it is not too bad! I believe there are three modules in EE16A. One is about Linear Algebra, which can be skipped given you have taken Math 54. Another is circuits, which is highly recommended to review if you don&#39;t have much memory on circuits. The last one is GPS and correlation stuff. Frankly, that part is not that necessary. But I personally found it very fun, and in my opinion, it kind of builds your intuition on signals and even Fourier transformation a bit.</p>\n<p></p>\n<p>The above is my personal opinion. Please follow up if you need some clarifications.</p>", "created": "2021-01-04T03:24:52Z", "subject": "", "uid_a": "a_1"}], "history_size": 1, "id": "kji03b9ymy260h", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jzqdhlbuot8413", "name": "Han  Qi", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["jzqdhlbuot8413"], "type": "s_answer"}, {"anon": "stud", "bucket_name": "Yesterday", "bucket_order": 4, "children": [{"anon": "stud", "bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2021-01-05T03:24:06Z", "data": {"embed_links": null}, "folders": [], "id": "kjjfi6zlfyv40f", "subject": "Does the grading change much if one is enrolled in regular lab vs lite lab? Or when can I find more information on what to expect being in the lite lab? Thanks!", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2021-01-05T03:24:06Z"}], "config": {}, "created": "2021-01-04T20:00:22Z", "d-bucket": "Yesterday", "data": {"embed_links": null}, "folders": [], "id": "kjiznjl2wcjbe", "no_answer": 0, "no_upvotes": 0, "subject": "<p>16B TA here. The gap isn&#39;t so large that you can&#39;t overcome it from the content perspective. You just need to review the 16A Module 2 material really well, in particular the nodal analysis method, op-amps, and capacitors. When I say &#34;really well&#34;, I really mean &#34;really well&#34;. You will struggle through the first module so much if you cant do op-amps and circuits smoothly. A really easy way to tell whether you&#39;re prepared is to go the 16A website and find that 1 discussion that has a circuit cookbook of 6 things (I think) and derive the formulas written on there. If you can do that within 15 minutes for all 6 of them, then you are 100% ready for 16B. The linear algebra part will come in handy later in controls for Module 2 and ML for Module 3.</p>\n<p></p>\n<p>The most <strong>OVERLOOKED</strong> part of taking 16A is the lab experience you will get. Yes you can overcome the content gap, but can you overcome the lab material/knowledge gap? If you have 0 breadboarding experience or have never physically hooked up a working circuit before, the 16B labs will probably take 12 hours or more initially from the usual 3 hours. I think a lot of lab TAs this semester had to deal with students having 0 knowledge on how to use an ammeter (or oscilloscope if in person) to debug, not knowing how to solder, how knowing how to trim resistor/wires to fit the circuit, etc. A lot of students without 16A this past semester really did struggle in Labs 1-3 BUT the good thing is that eventually you&#39;ll get used to it and you&#39;ll get better at it because in the end a breadboard is still a breadboard and a circuit can only deviate so much.</p>\n<p></p>\n<p>Obviously, this semester you can bypass the actual hardware by doing the Lite Lab option but who knows if that available in the future so I&#39;m posting a full answer assuming you have to do hardware. If you are forced to do the hardware, then find a partner who has taken 16A before to speed-teach you the necessary parts of breadboarding and wiring. You&#39;ll struggle but it&#39;ll be a lot less painful than having 2 other lab partners who took 54 and none of you guys know what you&#39;re doing staring at a bunch of wires.  </p>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jzqdhlbuot8413", "name": "Han  Qi", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jzqdhlbuot8413"], "type": "followup", "uid_a": "a_2", "updated": "2021-01-04T20:00:22Z"}], "config": {"seen": {"10031": 7, "10255": 1, "11096": 3, "13637": 8, "2018": 2, "3845": 5, "5827": 6, "7749": 4, "9767": 0}}, "created": "2021-01-03T03:15:22Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["other"], "history": [{"anon": "stud", "content": "<p>I wonder how does it feel like to take ee16b after math 54 without taking ee16a? Will there be a huge gap? And is it manageable? Thanks!</p>", "created": "2021-01-03T03:15:22Z", "subject": "taking eecs16b after math 54", "uid_a": "a_0"}], "history_size": 1, "i_edits": [], "id": "kjgkb8yev7k22h", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 14058, "num_favorites": 1, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654541537865, "tag_good": [], "tag_good_arr": [], "tags": ["other", "student"], "type": "question", "unique_views": 258}