{"bookmarked": 11, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "kjw3xtog8sh265", "type": "create", "uid_a": "a_0", "v": "all", "when": "2021-01-14T00:21:20Z"}, {"anon": "stud", "data": "kk1yyctuxk4760", "to": "kjw3xtocwss264", "type": "s_answer", "uid_a": "a_1", "when": "2021-01-18T02:48:24Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2021-01-18T02:48:24Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>Short answer: </p>\n<p>You&#39;ll find lots of transferable skills in both majors. IMO sticking with eecs will probably be more favorable for new grad job prospects &#43; initial industry roles/success within Silicon Valley, but you can&#39;t really go wrong here. Pick whichever one you find genuinely interesting and the one you&#39;ll be able to complete within time to graduate. </p>\n<p></p>\n<p>Long answer:</p>\n<p>PM is a really broad job title and every company &#43; industry define the role differently; as such, the skills required to be successful can vary drastically. For example, even within FAANG companies that have new grad roles titled as product management: Google heavily emphasizes technical expertise for APM hires (majority CS majors) whereas Facebook emphasizes strategy and business expertise for RPM hires (lots of business/finance majors and tons of MBAs). So regardless of what you study, there&#39;s no such thing as being the &#34;perfect&#34; PM candidate with 100% of the skills needed to work in all PM roles across the tech industry–you just have to put in a lot of legwork during recruiting to see if your skills are a good match for that specific company. But this also means there are lots of ways to pathways into roles under the PM umbrella (both as a new grad and later in your career).</p>\n<p></p>\n<p>That being said, the vast majority of Silicon Valley companies look for product managers with a solid understanding of software in addition to understanding (or being able to quickly pick up) data, strategy, design, leadership/people skills, etc. etc. etc. Many hiring managers view the technical foundation as the hardest piece to teach, so candidates with past eng experience and engineering degrees tend to be looked upon favorably. Since the majority of your day-to-day at many companies will be working with engineers, teams like having someone who somewhat understands where they are coming from. </p>\n<p></p>\n<p>A very common pathway into PM (before the rise in APM new grad programs within the last 10-15 years) was to actually work as an engineer for a few years and then transition into product. Many APM programs these days continue to primarily look for people from cs backgrounds (FB&#39;s RPM being the well-known exception, but there are others). Many interesting PM roles at larger companies are embedded in technical teams with specific focuses, so they look for PMs that have more background with those topics (e.g. backend/infra, security, hardware, etc.). Obviously easier to get into these types of roles if you are coming from an engineering background.</p>\n<p></p>\n<p>So having a CS background can really help you stand out and set you apart from the crowd, especially as a new grad candidate when you don&#39;t have a lot of work experience and product successes on your resume yet. Lots of bonus points in new grad PM recruiting if you interned/have past work experience in a heavily technical role.</p>\n<p></p>\n<p>However, IEOR isn&#39;t necessarily a bad major for working as a PM either. PM jobs also require a lot of understanding of strategy, decision-making, etc. in addition to aforementioned ability to understand engineering. There are definitely PMs who come from an IEOR background who do quite well. This might be a good choice if you want to work as a PM outside of pure software companies, like places that make physical products or PM roles outside of the tech industry. </p>\n<p></p>\n<p>EECS Upper Divs that are good for general PMs in silicon valley: 160 (design), Data 100 (data sci), 188 (AI), 169 (software engineering - but you can also get team experience via software engineering internships). SCET classes can sometimes be good (challenge labs, Data-X, etc.) because they&#39;re project-based and are a decent simulation of the broader-picture thinking required of PMs.</p>", "created": "2021-01-18T02:48:24Z", "subject": "", "uid_a": "a_1"}], "history_size": 1, "id": "kk1yycth4jj75z", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}], "config": {"seen": {"11430": 0, "13157": 6, "3606": 7, "3810": 4, "5769": 2, "5770": 3, "6177": 1, "6549": 9, "8641": 8, "9822": 5}}, "created": "2021-01-14T00:21:20Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["eecs"], "history": [{"anon": "stud", "content": "<p>Hi, I am currently a sophomore in the EECS major (switched to EECS from civil e at the beginning of fall 2020). I switched to eecs because I really enjoyed data 8, 61a, and 61b over my other classes, but I did not really know what I would want to focus on in eecs. Now, I am really interested in product management, and when I am looking at the eecs upper division courses, I am finding them more intimidating than interesting. I am starting to question whether I should stick to the eecs major or maybe switch to ieor. Does anyone have any advice for someone interested in product management? </p>", "created": "2021-01-14T00:21:20Z", "subject": "EECS Upper Divs for Product Management", "uid_a": "a_0"}], "history_size": 1, "i_edits": [], "id": "kjw3xtocwss264", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 14186, "num_favorites": 2, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654541393685, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jgrji2772f57df", "name": "Kevin Liu", "photo": "1561751961_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jgrji2772f57df/1561751961_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jzqdhtqk351452", "name": "Athena Leong", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvhcjpozd5xg", "name": "Atharva Mehendale", "photo": "1596323170_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jktvhcjpozd5xg/1596323170_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jzqdjl24y7f5nf", "name": "Amritansh Saraf", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jgrji2772f57df", "jzqdhtqk351452", "jktvhcjpozd5xg", "jzqdjl24y7f5nf"], "tags": ["eecs", "student"], "type": "question", "unique_views": 323}