{"bookmarked": 8, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "kk4cl6cknr922y", "type": "create", "uid_a": "a_0", "v": "all", "when": "2021-01-19T18:45:36Z"}, {"anon": "stud", "data": "kk4fb8t4po66xy", "to": "kk4cl6ci20c22x", "type": "s_answer", "uid_a": "a_1", "when": "2021-01-19T20:01:52Z"}, {"anon": "stud", "cid": "kk6fa7vs9ly7bz", "to": "kk4cl6ci20c22x", "type": "followup", "uid_a": "a_2", "when": "2021-01-21T05:36:36Z"}, {"anon": "stud", "cid": "kkg4qsc6b696uv", "to": "kk4cl6ci20c22x", "type": "feedback", "uid_a": "a_0", "when": "2021-01-28T00:39:15Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2021-01-19T20:01:52Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>For 106B at least, here is what the course staff said at the end of 106A: </p>\n<p></p>\n<p>&#39;&#39;&#39;</p>\n<p><b>A Note on 106B/206B</b><br /><br /></p>\n<p>Hi all,</p>\n<p></p>\n<p>As many of you have displayed interest in taking 106B/206B next semester, the staff decided to make a post about it as it is a very different class compared to 106A/206A:</p>\n<p><br />106B builds on the material in this course and serves as a sort of survey course in graduate robotics topics. The 106B curriculum evolves somewhat every year, but most likely next semester, we will go over dynamics and control of open-chain manipulators, non-holonomic control and motion planning, grasping and manipulation, more computer vision/SLAM (with perhaps some learning thrown into the mix), and soft robotics. We might go into some other special topics as well, depending on Professor Sastry and Professor Ma’s thoughts. While 106A is taught like a standard undergraduate course, with in-class labs, weekly homework, and midterms, 106B is taught much more like a graduate seminar.</p>\n<p><br />The lectures are much higher in difficulty and there is much less support. Rather than weekly in-class labs, we give you multiple weeks to do each of the four class projects on your own time. And rather than verbal checkoffs we expect project reports detailing the results of your experiments. These will be treated as a sort of practice for you all in writing research papers of your own. There are biweekly homework assignments (much harder than 106A), but no exams at all. The class ends with a research-based final project. You will also get a lot of practice reading and presenting about current research papers.</p>\n<p></p>\n<p><br />Here’s some FAQ:</p>\n<p><br /><b>Lab section:</b> The lab sections are treated more like discussion sections where a TA will give a short lecture on the next class project as well as when students will give paper presentations on an assigned research paper.</p>\n<p><br /><b>Projects</b>: There will be a total of 4 multi-week projects in the semester (not including your final project). These are much more involved and will require you to think much more than 106A labs. While the lab docs are quite detailed in our expectations and on the theory behind each project, there is much less guidance and no “step-by-step” like instructions on how to actually complete the tasks the way the 106A labs have. Instead, we expect students to experiment and learn through trial and error what works and what doesn’t as well as research on their own to find new ideas and methods to try. Of course, we also expect this entire process to be explicitly detailed in a project report. Additionally, students will be expected to work on these projects on their own time (i.e. not during a designated lab section) and be aware that these projects are expected to take much more time and effort to complete than 106a labs did (hence the reason we give you several weeks per project). The expectation is that each project should take each group about 40-60 hours to complete.</p>\n<p><br /><b>Final Project</b>: The final project will be expected to be much more research based rather than implementation based (the way the 106a project is). The overall expectation is that your project could lead to a potentially publishable research paper if you were to continue working on it.</p>\n<p><br /><b>Enrollment:</b> The EECS undergrad section of the course is currently full, but (last I checked) the BioE and Grad sections both have some space. Undergrads cannot sign up for the graduate section. Because the class tends to have a very high attrition rate, we expect to let everyone in off the waitlist, and potentially expand the course a bit. I think ~60 overall will be the cap (otherwise lab access will suffer as currently the school has told us we are approved for in person lab access but that is, of course, subject to change). If you want to take it, please add yourself to the waitlist, so we can convince the department to allocate the resources that we need to expand the course.</p>\n<p><br /><b>Prereqs:</b> Doing well in 106A is generally good enough, but a class like EE 128 is <i>very </i>useful. We don’t have much time to teach controls so we don’t go into very much detail. Any ME class in dynamics is also helpful, though not required. Matlab and strong numpy skills are also very useful.</p>\n<p><br /><b>Should I take this class:</b> This course is significantly harder than 106A, but is (at least in my opinion) much more rewarding. If you’re doing well in 106A, I highly suggest taking it. If you’re having trouble with 106A (struggled with the midterm, take more than 9 hours per lab, or have trouble understanding large portions of of the material), 106B might not be for you. 106B is taught at a much higher level, and there’s much less support, so if you don’t have a strong foundation in 106A material, you’ll have a very tough time.</p>\n<p><br /><b>Is this class easy:</b> Many people think that the very high grade distribution on BerkeleyTime indicates that the course is easy. This course was one of the most difficult classes I’ve taken at Berkeley, and we traditionally have a pretty high drop rate. That being said, the class isn’t curved to a mandated average. If you make it to the end (and do all the work), you’ll probably get a good grade.</p>\n<p>&#39;&#39;&#39;</p>", "created": "2021-01-19T20:01:52Z", "subject": "", "uid_a": "a_1"}], "history_size": 1, "id": "kk4fb8sugn56xu", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}, {"anon": "stud", "bucket_name": "Week 1/17 - 1/23", "bucket_order": 20, "children": [{"anon": "stud", "bucket_name": "Week 1/24 - 1/30", "bucket_order": 19, "children": [], "config": {}, "created": "2021-01-28T00:39:15Z", "data": {"embed_links": null}, "folders": [], "id": "kkg4qsc6b696uv", "subject": "<p>What resources did you use for the class. Also what classes would you recommend taking before?</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_0", "updated": "2021-01-28T00:39:15Z"}], "config": {}, "created": "2021-01-21T05:36:36Z", "data": {"embed_links": null}, "folders": [], "id": "kk6fa7vs9ly7bz", "no_answer": 1, "no_upvotes": 0, "subject": "I am in 106b and I took 192 last spring. \n\n192 is almost all lab based. There is one lecture weekly, and some quizzes, but for the most part the lecture material is not the most important part of the class. The final was oral when I took it, partially because the online format. About the lab: it was a lot of work weekly. Also 192 is kind of a class that you get out of it what you put into it. The average time spent might be like 10 hours of lab a week, but I remember some weeks where we would be grinding our work till the am before the checkpoint (well over 15 ish hours), and some weeks where we would go in for like 2-3 hours and be done for the week. It depends on your bugs with the hardware and how well your group works together. Its a bit of a free form class, but our end product was good and we were happy with the class as a group. It was one of the more rewarding experiences of my career at cal, and I would happily do it again. Im not sure how things will work online, but if you take it next year it will most likely be in person. \n\nI am in 106b and it seems like a lot more work that 106a, but im not sure how much. Thankfully there are no exams, but the project workload is looking to be a lot so im preparing for it.", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jwv9i1ryn21ec", "name": "Anrui Gu", "photo": "1613963994_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jwv9i1ryn21ec/1613963994_200.jpg", "published": true, "role": "student", "us": false}], "tag_good_arr": ["jwv9i1ryn21ec"], "type": "followup", "uid_a": "a_2", "updated": "2021-01-21T05:36:36Z"}], "config": {"seen": {"10528": 0, "10606": 6, "12039": 3, "12054": 5, "1549": 2, "2306": 9, "2481": 1, "2657": 8, "5846": 4, "6645": 7}}, "created": "2021-01-19T18:45:36Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["eecs"], "history": [{"anon": "stud", "content": "<p>What is the workload for ee192 and 106b?</p>", "created": "2021-01-19T18:45:36Z", "subject": "Workload 192 and 106b", "uid_a": "a_0"}], "history_size": 1, "i_edits": [], "id": "kk4cl6ci20c22x", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 1, "nr": 14265, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654541306325, "tag_good": [], "tag_good_arr": [], "tags": ["eecs", "student"], "type": "question", "unique_views": 276}