{"bookmarked": 14, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "ko3up9akx4d5wf", "type": "create", "uid_a": "a_0", "v": "all", "when": "2021-04-30T05:03:43Z"}, {"anon": "no", "cid": "ko3wrq0wme727w", "to": "ko3up9ah3se5we", "type": "followup", "uid": "jktvhgjq1t661g", "when": "2021-04-30T06:01:37Z"}, {"anon": "no", "cid": "ko458eeb3rh6d6", "to": "ko3up9ah3se5we", "type": "followup", "uid": "jktvg5rtq4e4uz", "when": "2021-04-30T09:58:32Z"}, {"anon": "stud", "cid": "ko4heeu367x5lc", "to": "ko3up9ah3se5we", "type": "feedback", "uid_a": "a_0", "when": "2021-04-30T15:39:08Z"}, {"anon": "stud", "cid": "ko4hxws2wot7d", "to": "ko3up9ah3se5we", "type": "feedback", "uid_a": "a_0", "when": "2021-04-30T15:54:18Z"}, {"anon": "stud", "cid": "ko4y7bas23m197", "to": "ko3up9ah3se5we", "type": "feedback", "uid_a": "a_1", "when": "2021-04-30T23:29:30Z"}, {"anon": "no", "cid": "ko4znje7dln2h5", "to": "ko3up9ah3se5we", "type": "feedback", "uid": "jktvhgjq1t661g", "when": "2021-05-01T00:10:07Z"}, {"anon": "no", "cid": "ko60jrofbrqf", "to": "ko3up9ah3se5we", "type": "feedback", "uid": "jktvg5rtq4e4uz", "when": "2021-05-01T17:22:57Z"}], "children": [{"anon": "no", "bucket_name": "Week 4/25 - 5/1", "bucket_order": 36, "children": [{"anon": "stud", "bucket_name": "Week 4/25 - 5/1", "bucket_order": 36, "children": [], "config": {"editor": "rte"}, "created": "2021-04-30T15:39:08Z", "data": {"embed_links": null}, "folders": [], "id": "ko4heeu367x5lc", "subject": "<p>Thank you for your detailed response!</p>\n<p></p>\n<p>CS 182: I&#39;ve definitely heard about this class and might just take it. Even though I most likely won&#39;t do any serious DL/ML job in the industry, this should at least increase my depth in the field (more than 189 I suppose?). I&#39;ve heard that it&#39;s very similar to a course that Stanford offers and makes available to the public that you can self-study on your own for. Is that true?</p>\n<p></p>\n<p>CS 194-80: This is definitely more up my alley! Since I feel it deals more with the industry/practical side of ML if I&#39;m getting the correct vibe from what you&#39;re mentioning? If so, I&#39;d love to take it since it&#39;d be nice to see how some of the stuff I learned in 189 and 182 ends up being used in the real-world. Do you know which semesters it gets offered (is it like Fall or Spring exclusive)?</p>\n<p></p>\n<p>CS 288: Hmm if I do have the time, I&#39;ll try to take this since you mentioned that it doesn&#39;t require an A&#43; background but simply to pass Proj 0 (which I hopefully can). Can you compare it with 159 regarding breadth and depth? Since it&#39;s a grad course I&#39;m assuming it&#39;s slightly harder in difficulty but does it go deeper into the topics regarding NLP itself? Or does it cover more range?</p>\n<p></p>\n<p>Once again, thanks for your response Nicholas!</p>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "ji4zyrg94hv49t", "name": "Yasoob Khalid Niazi", "photo": "1530981380_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/ji4zyrg94hv49t/1530981380_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"kk0c403bzqx4da": 1613861355}, "facebook_id": null, "id": "jwupbl14eqmsc", "name": "Vincent Porras", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["ji4zyrg94hv49t", "jwupbl14eqmsc"], "type": "feedback", "uid_a": "a_0", "updated": "2021-04-30T15:39:08Z"}, {"anon": "no", "bucket_name": "Week 4/25 - 5/1", "bucket_order": 36, "children": [], "config": {"editor": "md"}, "created": "2021-05-01T00:10:07Z", "data": {"embed_links": null}, "folders": [], "id": "ko4znje7dln2h5", "subject": "<md>CS 182: Yeah, this class definitely gives more hands on training and most material for a lot of CS/EECS classes are available online, so I guess you could self study anything. The issue is whether you have the self discipline to so.\n\nCS 194-80: To my knowledge, it is going to be offered in the spring. Note that they will strictly enforce requirements of an A-/A in 61B and 189/182 to get into the class. \n\nCS 288: According to other people that I know that took both,  159 is basically half linguistics, half CS whereas I would consider 288 to be mostly CS. One is that 159 has to spend time teaching neural networks and embeddings and stuff where as in 288, it is brushed over as a prerequisite. Due to this, I would say that 288 has more time to spend on each topic. The big topics that it covers are Language modeling, machine translation, speech (ASR and generation), Parsing, Semantics, and then some shorter potpourri (grounding, NLU, language reconstruction, etc.. Looking at the lectures of 159, 288 definitely skims over some of the 159 material in favor of teaching practical pitfalls and solutions that one encounters in NLP. I would say it covers more material and goes really in depth on the algorithms and practical considerations compared to 159, in addition to a huge module dedicated to speech that 159 doesn't have. Note that 288 doesn't have midterms, finals, or homeworks, just 5 projects on colab with short 1 page reports to go with them.</md>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "ji4zyrg94hv49t", "name": "Yasoob Khalid Niazi", "photo": "1530981380_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/ji4zyrg94hv49t/1530981380_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvg4it35k4uc", "name": "Richard Shuai", "photo": null, "photo_url": null, "role": "student", "us": false}, {"admin": false, "endorser": {"kk0c403bzqx4da": 1613861355}, "facebook_id": null, "id": "jwupbl14eqmsc", "name": "Vincent Porras", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["ji4zyrg94hv49t", "jktvg4it35k4uc", "jwupbl14eqmsc"], "type": "feedback", "uid": "jktvhgjq1t661g", "updated": "2021-05-01T00:10:07Z"}], "config": {"editor": "md"}, "created": "2021-04-30T06:01:37Z", "data": {"embed_links": null}, "folders": [], "id": "ko3wrq0wme727w", "no_answer": 0, "no_upvotes": 0, "subject": "<md>Just so it doesn't show up as answered, I'll put my answer down here. I only have ML related suggestions.\n\nCS 182: If you want more hands on experience with Neural Networks and standard architectures. Probably required if you want to get a generic DL/AI job (unless you really good at Pytorch/TF already)\n\nCS 194-80: Full Stack Deep Learning. A relatively light and interesting course developed from a bootcamp. It goes through the entire stack of DL deployment from data collection to training to testing to deployment to monitoring. Only light homework per week and 1 open ended project at the end, it is an enjoyable and easy going experience\n\nCS 288: Hear me out. You already took Info 159 and this will give you a broader spectrum about modern NLP. While it is meant to train researchers, you can definitely just take the course to listen to awesome lectures (10/10 lectures from Klein and Denero). The work is IMO not as hard as some people say, and taking the class makes NLP seem not as daunting as it is. Taking Info 159 will make the class easier I would also expect. There is no homework or exams, just projects on colab (with piazza and office hours for help). The reason why I put it here is that if you ever do have to work on NLP in industry, taking this class can be a huge boost because you have already been exposed to all of these concepts and you don't need to learn a bunch of modern NLP. For enrollment, see @14857 for details, but in essence, as long as the class doesn't fill up the room physically, the prof has no trouble allowing anyone who finishes Project 0 to enroll. I would recommend anyone to attend a couple of classes and attempt Project 0. If it is too much and you want to chill, you don't even need to drop the class because you weren't enrolled anyways. </md>", "tag_good": [{"admin": false, "endorser": {"jzllv02dp7j3jh": 1571985065, "kdhvjzdceb91ll": 1607826884}, "facebook_id": null, "id": "jktvg5rtq4e4uz", "name": "Jay Monga", "photo": "1580804937_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jktvg5rtq4e4uz/1580804937_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "ji4zyrg94hv49t", "name": "Yasoob Khalid Niazi", "photo": "1530981380_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/ji4zyrg94hv49t/1530981380_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jzqdhqjfxui43k", "name": "Andrew Wang", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"kk0c403bzqx4da": 1613861355}, "facebook_id": null, "id": "jwupbl14eqmsc", "name": "Vincent Porras", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jktvg5rtq4e4uz", "ji4zyrg94hv49t", "jzqdhqjfxui43k", "jwupbl14eqmsc"], "type": "followup", "uid": "jktvhgjq1t661g", "updated": "2021-04-30T06:01:37Z"}, {"anon": "no", "bucket_name": "Week 4/25 - 5/1", "bucket_order": 36, "children": [{"anon": "stud", "bucket_name": "Week 4/25 - 5/1", "bucket_order": 36, "children": [], "config": {"editor": "rte"}, "created": "2021-04-30T15:54:18Z", "data": {"embed_links": null}, "folders": [], "id": "ko4hxws2wot7d", "subject": "<p>Thanks for your detailed response!</p>\n<p></p>\n<p>CS 184: Hmm, I might take it to get some hands on experience in C&#43;&#43; since it&#39;s very relevant for industry like you mentioned. I&#39;m just not sure how relevant the contents of the course themselves will be for me haha. Is it possible for you to compare it with CS 194-26 since I feel they kind of have topics but not sure how they differ? For someone who&#39;s already taken the latter, would 184 even be useful?</p>\n<p></p>\n<p>EECS 149: Personally I feel like I&#39;m definitely more of a system&#39;s guy (REALLY enjoyed CS 61C and 162) compared to the theory courses which I didn&#39;t find as satisfying, so this class might be worth looking at. I&#39;m curious though, you mention it has some overlap with 61c and 162 but both of them cover such a wide range of topics, I&#39;m wondering which subfields does it overlap with? Is the micro-controller stuff that you mentioned similar to 16B where we program the car&#39;s TI microprocessor (I&#39;m sorry if I&#39;m really far off! I&#39;m a complete noob at hardware haha) since didn&#39;t really enjoy that much (didn&#39;t really enjoy 16B at all tbh but that might just be the way it&#39;s taught).</p>\n<p></p>\n<p>EECS 151: Hmm, can you elaborate a bit on what &#39;touching the digital design space&#39; means? Is it similar to designing chips and processors (kind of like what we do with Logisim where we design the datapath?) Also, not really sure what FPGA does but a Google search seems to indicate it&#39;s an IC you program yourself?</p>\n<p></p>\n<p>EECS 120: I&#39;ll prob take this class for sure! I feel it really aligns with my goals since you mention that it teaches the foundational material for EE so for someone like me who doesn&#39;t intend to really explore the hardware side deeply but wants to make sure I&#39;m well-informed and &#34;well-rounded&#34; this seems a good way to learn about the field as a whole in a low-effort manner. Do you know if it&#39;s offered Fall/Spring both or just one? How would you compare it&#39;s workload with some of the CS classes I mentioned above?</p>\n<p></p>\n<p>EECS 106A: Robotics sounds really cool but not sure if I&#39;ll be able to pull through the class haha! I seem to have the LA and Calc background they require, but as someone who hasn&#39;t taken a physics class since high school (L&amp;S CS) would I satisfy that prereq that they list? If not, what&#39;s the minimum physics background you recommend I go in with? Also, curious to know how it falls on the hardware/software divide? Like does it deal more with the software programming aspects of coding a robot and its functions or more of the hardware side of building a robot physically itself?</p>\n<p></p>\n<p>Thank you for your reply though Jay! It was really detailed and I learned about a lot of the EE side of classes I&#39;d never really known about. Appreciate it.</p>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "ji4zyrg94hv49t", "name": "Yasoob Khalid Niazi", "photo": "1530981380_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/ji4zyrg94hv49t/1530981380_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "kdt6eb1uw3c578", "name": "Thanh Tran", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"kk0c403bzqx4da": 1613861355}, "facebook_id": null, "id": "jwupbl14eqmsc", "name": "Vincent Porras", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["ji4zyrg94hv49t", "kdt6eb1uw3c578", "jwupbl14eqmsc"], "type": "feedback", "uid_a": "a_0", "updated": "2021-04-30T15:54:18Z"}, {"anon": "stud", "bucket_name": "Week 4/25 - 5/1", "bucket_order": 36, "children": [], "config": {"editor": "rte"}, "created": "2021-04-30T23:29:30Z", "data": {"embed_links": null}, "folders": [], "id": "ko4y7bas23m197", "subject": "<p>To help you Anonymous Calc (since I&#39;m also friends with Jay): </p>\n<p></p>\n<p><strong>151:</strong> If you enjoy 61C and 162, you might like this class since its a hybrid between 61C and 16B (more towards the 61C side). Digital design is basically writing HDL language code (Verilog) for hardware to work with different input signals or values (e.g. implementing an FSM on hardware). Yes, it is similar to designing chips and processors in the Logism projects. The logism project is exactly what you&#39;ll be doing for the incredibly hard final project in this class (this is why the class is 5 units -- 3 units for lecture and 2 units for lab) as you&#39;ll now be writing code in Verilog to implement a 3-stage pipeline RISC-V datapath and program it on the FPGA. So instead of wires and logic gates built in for you in Logism, you&#39;ll have to write code yourself that does that and connect different modules and debug it with waveforms. An FPGA, at a high level, is a reprogrammable chip that you can write code and interface with a lot of different things. It is typically used in Verification as you can imagine, you can write code that test taped out chips here and there without having to invest in a custom made software/hardware to interface with your taped-out chip. Admittedly, since FPGA runs at a very high speed (200 Mhz clock on some of them), it is often used in trading/finance to make decisions. </p>\n<p></p>\n<p><em>Bonus: </em>Hardware companies actually love this class. When I took it, Apple, Cisco, Qualcomm, etc were like directly recruiting from a class of 80 students in 151. Your chances of getting noticed at career fair also increases 100x with just this class on your resume. </p>\n<p></p>\n<p><strong>120:</strong> It is foundational material for EE but actually has plenty of uses in the CS side as well for computational photography which you&#39;ve taken. 120 really makes you understand the subtle relationship between Time-Frequency via the Fourier Transform and LTI systems in general. It is both offered in Fall and Spring but if you&#39;re not in a rush, you can take it with Babak in Spring22 as he is a GOAT professor who usually teaches this class. His lectures are amazing and I think its worth to take it with him. The workload is generally very light when I took it with him -- 6-7 Homeworks with 4-5 Jupyter notebook labs and 3 midterms (no final). This class leads to the field of digital signal processing, which has incredible use in ML/AI if you&#39;re ever going into that field at all when designing filters and what not. </p>\n<p></p>\n<p>As a motivation -- Shazam (the music recognition app) uses Fourier Transform to match the song with its database. So theres definitely incredible applications with Fourier Transform in general.</p>\n<p></p>\n<p><strong>106A: </strong>You don&#39;t need any knowledge apart from Math 54 and 16B to do well in this class. There isn&#39;t realy any physics apart from basic dynamics which is just F = ma as this class is definitely more linear algebra heavy. This class sort of falls into the software side since it is more focused on controls on the robot (P/PID controller) BUT in your final project (which replaces the final and worth 40%), you may choose to do it in hardware and show off your robot and what not. You don&#39;t have to build a robot physically yourself as it is up to you, but I chose to do a hardware project where my team built a chess-playing robot using servos and 3D cadded bases and chess pieces with imaging with the Rasp Pi camera. Some other teams did it based purely on simulation and still did very well. <strong>Bonus:</strong> This class doesn&#39;t follow the EECS curve -- it has a 3.7 class average. 106B has a 3.9 class average. So put some effort in and you&#39;ll do well </p>\n<p></p>\n<p></p>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "ji4zyrg94hv49t", "name": "Yasoob Khalid Niazi", "photo": "1530981380_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/ji4zyrg94hv49t/1530981380_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "kdt6eb1uw3c578", "name": "Thanh Tran", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["ji4zyrg94hv49t", "kdt6eb1uw3c578"], "type": "feedback", "uid_a": "a_1", "updated": "2021-04-30T23:29:30Z"}, {"anon": "no", "bucket_name": "Week 4/25 - 5/1", "bucket_order": 36, "children": [], "config": {"editor": "rte"}, "created": "2021-05-01T17:22:57Z", "data": {"embed_links": null}, "folders": [], "id": "ko60jrofbrqf", "subject": "<p>Lol @Gear hit the main points for the classes they listed, but I will respond to the rest.</p>\n<p></p>\n<ul><li>\n<p><strong>CS 184:</strong> From looking at syllabi, 184 will have a some content overlap with 194-26 in terms of mathematical modeling of 3D scenes and maybe coverage of basic filters, but seems that 184 is more focused on the entire field of graphics: image manipulation, rendering, interpolation, and more, whereas 194-26 seems very focused on image manipulation and 2D things. I could be getting this completely wrong, so someone with more knowledge please step in</p>\n<p></p>\n</li><li>\n<p><strong>EECS 149:</strong> If you are a systems guy, you would love 149!! I haven’t taken 162, but I can state that the overlap with 61C is in C programming for labs/project, basic FSM stuff (go in much more detail for 149), number representation, and memory models (stack, heap, etc.). I think basic OS concepts are mentioned in the textbook and covered in the HW as well, but you will find that 149 has a slight overlap with like almost every EECS course lol. If you look through the textbook, there are things that overlap but aren’t covered in lecture, like pipelining for example. <a href=\"https://ptolemy.berkeley.edu/books/leeseshia/releases/LeeSeshia_DigitalV2_2.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">Here is the textbook</a> if you want to take a look. Here is a concept map that outlines what is covered in the textbook.</p>\n<p></p>\n<p><img src=\"/redirect/s3?bucket=uploads&amp;prefix=paste%2Fjktvg5rtq4e4uz%2F373a55b1da22b798aca7d8ea8268cff3cbdd7a763be2a5f91447c85ec611f3c5%2Fimage.png\" alt=\"image.png\" width=\"480\" height=\"356\" /></p>\n<p>As for the lab stuff, yeah it is pretty related to that! In fact for the class last semesters, they shipped us all essentially a <a href=\"https://www.pololu.com/product/4022\" target=\"_blank\" rel=\"noopener noreferrer\">more advanced launchpad kit</a>. So 149 lab had very very minimal circuits (we just had to connect some wires from pins on the nrf52 to a device with wires, and needed to just have some level of understanding of floating inputs and why they are bad); instead, the lab was focused on enabling the use of sensors and actuators from a micro controller using like only C programming, basically implementing libraries at a basic level that let you do this with a simple function call on an Arduino, and then once you have command of sensors and actuators you get your robot to accomplish a basic task like driving in a square formation, going up a ramp and back down without falling off, etc. You can get a feel for the lab content by looking at the <a href=\"http://bit.ly/3hnYwv3\" target=\"_blank\" rel=\"noopener noreferrer\">lab textbook</a>, although this may change for an in-person semester.</p>\n<p></p>\n</li><li><strong>106A: </strong>@Gear did an nice job, want to just mention a few things. 106A lab was done entirely in simulation last semester, but next semester we are planning to do things in person, which will give you experience playing with real robots. But as mentioned, 106A isn&#39;t really a hardware/mechanical design class for robots, that falls closer to 192. Instead, 106A kind of takes the approach of assume your robot is already built and has a nice Python interface, now what? and teaches you things you can do at that point. 149 is more like the skills to build up to that Python interface. We like to say that the only prereqs are freshman level linear algebra and freshman level python programming - we try to keep the class accessible to people of many diverse backgrounds, and I think that&#39;s something which makes the course pretty wonderful. </li></ul>\n<p></p>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "ji4zyrg94hv49t", "name": "Yasoob Khalid Niazi", "photo": "1530981380_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/ji4zyrg94hv49t/1530981380_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "kdt6eb1uw3c578", "name": "Thanh Tran", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"kk0c403bzqx4da": 1613861355}, "facebook_id": null, "id": "jwupbl14eqmsc", "name": "Vincent Porras", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["ji4zyrg94hv49t", "kdt6eb1uw3c578", "jwupbl14eqmsc"], "type": "feedback", "uid": "jktvg5rtq4e4uz", "updated": "2021-05-01T17:22:57Z"}], "config": {"editor": "md"}, "created": "2021-04-30T09:58:32Z", "data": {"embed_links": null}, "folders": [], "id": "ko458eeb3rh6d6", "no_answer": 0, "no_upvotes": 0, "subject": "<md>Nick's suggestions are excellent; here are mine:\n\n- CS 184: I know you don't like theory heavy, but I heard this class is heavy on the programming side anyway. It's like the only lower div in C++ I'm pretty sure, so it would be a fun way to pick up a language that is used a ton in industry. Disclaimer: I haven't taken this class. Only taught spring.\n\n- EECS 149: If you liked 61C, this class goes a bit closer to the hardware but don't fret; there is like a trivial amount of circuits material. If you liked 162, this class has a decent amount of overlap I've heard, but is more low level C and micro-controller programming focused. Sort of unlocks the field of embedded systems if you want to work in that. Has a very open ended final project that may serve as a good capstone experience. Only taught fall.\n\n- EECS 151: I haven't taken the course, but I have heard the skills you pick up are invaluable if you think you may want to touch the digital design space. Plus knowing how to do FPGA things is super employable ATM, with companies like Apple watching out for this course in particular.\n\n- EE 120: Relatively light, chill class that teaches really foundational material for anything in EE, so if you want to understand what someone is talking about when they mention linear systems or work on any product that interacts the physical world in some way, I would recommend.\n\n- EE 192: If you think 149 is interesting but want to do something even closer to the hardware and pick up some mechanical design skills, this class would be for you. Only taught spring.\n\n- EECS 106A: Last but not least, robotics is a growing field that you may find interesting and want to take a part in. It's an excellent course that has a math heavy lecture but pretty fun labs and a final project which could be a good capstone experience. I'm not biased in any way ;) Only taught fall.\n\nAlso don't let the A+ stuff discourage you from taking grad classes. Enrollment polices really depend on who is teaching, so if there is some class that seems interesting to you and you want to take it, demonstrating your passion to the instructor should be enough. Good luck!</md>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "ji4zyrg94hv49t", "name": "Yasoob Khalid Niazi", "photo": "1530981380_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/ji4zyrg94hv49t/1530981380_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jzqdhqjfxui43k", "name": "Andrew Wang", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "kdt6eb1uw3c578", "name": "Thanh Tran", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"kk0c403bzqx4da": 1613861355}, "facebook_id": null, "id": "jwupbl14eqmsc", "name": "Vincent Porras", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["ji4zyrg94hv49t", "jzqdhqjfxui43k", "kdt6eb1uw3c578", "jwupbl14eqmsc"], "type": "followup", "uid": "jktvg5rtq4e4uz", "updated": "2021-04-30T09:58:32Z"}], "config": {"editor": "rte", "has_emails_sent": 1, "seen": {"10713": 4, "13345": 7, "14028": 0, "14545": 9, "3419": 8, "4296": 3, "7033": 1, "8057": 2, "8781": 6, "9535": 5}}, "created": "2021-04-30T05:03:43Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["enrollments"], "history": [{"anon": "stud", "content": "<p>Hi guys, I&#39;m a rising senior who&#39;s so far taken most of the &#39;essential&#39; upper division courses that most people at Berkeley recommend to get a well-rounded education (170, 162, 189, etc.). For my last two semesters, I was hoping to find some interesting courses relevant to someone going into industry as an SWE which would broaden my educational base. All recommendations are welcome :)</p>\n<p></p>\n<p>Here&#39;s the list of courses I&#39;ve taken so far (or am aware of and intend to take next year):</p>\n<p></p>\n<p>DS 100</p>\n<p>EECS 126, 127, 189</p>\n<p>CS 170</p>\n<p>CS 161, 162, 168 (would 164 be helpful for an SWE position?)</p>\n<p>CS 186, 188</p>\n<p>CS 194-15 (Parallel Programming), 194-26 (CV)</p>\n<p>INFO 159</p>\n<p></p>\n<p>Also, please don&#39;t recommend theory-heavy classes like the 17x series (or most math/stat classes) since I&#39;m not really interested in that field. I&#39;m also hesitant to ask for grad course recommendations since I&#39;ve heard they require A&#43;&#39;s to get into as an undergraduate and as someone who doesn&#39;t really get A&#43;&#39;s in their courses, I doubt I&#39;ll be able to enroll in such classes.</p>\n<p></p>\n<p>(I&#39;m really sorry if my criteria is too narrow or if I come off as picky, it&#39;s just that I only recently realized there&#39;s still so many courses that are interesting to take that I had been completely unaware of - like 194-26 - so I wanted to throw the question out there to see what people who&#39;ve taken different classes end up recommending.)</p>", "created": "2021-04-30T05:03:43Z", "subject": "Interesting classes to &#34;round off&#34; education?", "uid_a": "a_0"}], "history_size": 1, "i_edits": [], "id": "ko3up9ah3se5we", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 1, "no_answer_followup": 0, "nr": 15015, "num_favorites": 15, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654540479343, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "ji4zyrg94hv49t", "name": "Yasoob Khalid Niazi", "photo": "1530981380_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/ji4zyrg94hv49t/1530981380_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jzdh1pp0lb738s", "name": "Jay Feng", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvgcjtoby4zk", "name": "Anita Shen", "photo": null, "photo_url": null, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "kdt6eb1uw3c578", "name": "Thanh Tran", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["ji4zyrg94hv49t", "jzdh1pp0lb738s", "jktvgcjtoby4zk", "kdt6eb1uw3c578"], "tags": ["enrollments", "student", "unanswered"], "type": "question", "unique_views": 692}