{"bookmarked": 5, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "kokj7ag3e28nt", "type": "create", "uid": "h87kastcacfxt", "v": "all", "when": "2021-05-11T21:13:54Z"}], "children": [], "config": {"editor": "rte", "has_emails_sent": 1, "is_announcement": 1}, "created": "2021-05-11T21:13:54Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["eecs", "announcements", "cs-intended", "lscs"], "history": [{"anon": "no", "content": "<div><b>Responsible Innovation for Entrepreneurs, Tech Makers &amp; Business Leaders: Emerging Tech &amp; AI<br /></b></div>\n<div><b>INDENG 190E (1 unit)</b></div>\n<div></div>\n<div><b>Class Description:</b></div>\n<div>When we create a new company, product or technology, what responsibility do we have?<br /><br />Currently, there is a lot of debate about what our future will look like: the future of education, healthcare, automotive, the workplace. How are we deciding what that future looks like? And who is deciding or influencing those decisions? Many technology courses and trainings focus on things like data science model design, AI or blockchain basics, how to implement particular software or product and even startup life cycle development. But they often fail to teach or prepare students for the mindset and lens of accountability that are necessary to implement these technologies as responsible innovators and leaders.<br /><br />Innovation is about leading change. It’s about putting a vision into practice. Responsible Innovation is about the power and delight to drive change but also about the responsibility and commitment to consider the impacts. In this class you will have a chance to redesign existing technology solutions or create new ones, while keeping the impact to society and the environment in mind (you can go technical or stay at the ideation stage). You will also have a chance to use The Responsible Innovation Framework to assess and evolve your own ideas or play with existing conversational AI, 5G/IoT/Edge, social media and content delivery products and solutions. The goal is to help you develop critical and practical skills to assess technology, products, vendors and partners. We will apply the Responsible Innovation lens to emerging technologies, startups and larger tech companies.  We will also look at how our current metrics as well as governments and academic institutions influence how we use technology and, ultimately, how we create our the future.<br /><br />Students and Entrepreneurs from the class may have the opportunity to present their ideas at RI Labs annual event or be invited to join a RI Labs Founders or Mentorship program to continue their leadership development.<br /><br />This class invites students from all colleges and schools and is open to non-UC Berkeley students and the general public.  There are no technical pre-requisites.</div>\n<div></div>\n<div><b>Class Format</b></div>\n<div>This class will be taught remotely and will take place during 2021 Summer Session D: July 6-August 13th. This class requires synchronous participation: students are expected to participate in the class during the class times on Tuesdays 4:30 pm - 7 pm PT. View the <a href=\"https://classes.berkeley.edu/content/2021-summer-indeng-190e-002-sem-002\" target=\"_blank\" rel=\"noopener noreferrer\">schedule of classes</a> for more information on the class. The class is open to UC Berkeley students as well as non-UC Berkeley students.</div>\n<div></div>\n<div><b>More Information:</b> <a href=\"https://scet.berkeley.edu/students/courses/advanced-topics/responsible-innovation/\" target=\"_blank\" rel=\"noopener noreferrer\">https://scet.berkeley.edu/students/courses/advanced-topics/responsible-innovation/</a></div>\n<div></div>", "created": "2021-05-11T21:13:54Z", "subject": "Responsible Innovation for Entrepreneurs, Tech Makers &amp; Business Leaders", "uid": "h87kastcacfxt"}], "history_size": 1, "i_edits": [], "id": "kokj7ag0ia4ns", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 15086, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654540400022, "tag_good": [], "tag_good_arr": [], "tags": ["announcements", "cs-intended", "eecs", "instructor-note", "lscs"], "type": "note", "unique_views": 309}