{"bookmarked": 5, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "korhg5stv5a6gh", "type": "create", "uid_a": "a_0", "v": "all", "when": "2021-05-16T17:59:12Z"}], "children": [], "config": {"editor": "rte", "has_emails_sent": 1, "seen": {"5066": 7, "5313": 4, "5680": 5, "6095": 2, "6172": 1, "6335": 9, "6584": 6, "8004": 3, "8265": 8, "9798": 0}}, "created": "2021-05-16T17:59:12Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements", "enrichment_opportunities", "other"], "history": [{"anon": "stud", "content": "<p>UC Berkeley ATDP is looking for an instructor for Algorithms &amp; Data Structures. This will be a summer class for high school students, and it will be taught online class taught online via Zoom<br />Applying. Please apply by emailing your resume to Carrie Brown, ATDP Assistant Director, at <a href=\"mailto:CarrieBrown@berkeley.edu\" target=\"_blank\" rel=\"noopener noreferrer\">CarrieBrown@berkeley.edu</a></p>\n<p><br />About ATDP. The Academic Talent Development Program (ATDP) is UC Berkeley’s summer program for high-achieving students from kindergarten to completing grade eleven. For forty years, ATDP has been offering challenging summer classes in a wide variety of disciplines. ATDP unites teachers who love to teach with students who love to learn. Please visit ATDP’s website at <a href=\"https://atdp.berkeley.edu/\" target=\"_blank\" rel=\"noopener noreferrer\">https://atdp.berkeley.edu/</a> to learn more about the program.</p>\n<p><br />ATDP has lesson plans from a past class, and they can be used as a basis for the class and can be modified and expanded. The class will have about twenty-two students. Instructors will be paid through UC Berkeley’s payroll department.</p>\n<p><br />Algorithms and Data Structures<br />Program dates: June 21 to July 30, 2021<br />Class schedule: Monday &amp; Wednesday, 8:30 a.m. to 12:00 p.m. (12 class meetings)<br />Daily schedule: 8:30 a.m. to Noon<br />Location: Online via Zoom<br />Pay: $2600 (1 section)</p>\n<p><br />Course Description: This advanced programming course will introduce students to algorithms and their relationship to data structures, touching on several of the concepts covered in a second-year collegiate computer science curriculum. Students should already be familiar with control structures like conditionals, loops, and functions. We will develop a sense for designing algorithms and analyzing how fast they will run. We will start with one-dimensional structures and sorting algorithms, then move to more involved data structures like trees and graphs and their associated problems, such as shortest-path-finding and traversal. By focusing on creating fully-featured projects, we will combine our code with graphical user interfaces to create more powerful, efficient, and useful programs.</p>\n<p><br />Online class structure: Students will spend 2-3 hours per class in interactive lecture and hands-on assignments over Zoom. Students will have substantial breaks throughout.<br />Who should take the class: Advanced students who wish to extend their programming knowledge into second-year college-level computer science topics</p>\n<p><br />Prerequisite: Completion of Programming in Java or AP Computer Science, or a passing score on a placement test</p>\n<p></p>", "created": "2021-05-16T17:59:12Z", "subject": "Summer &#39;21 Teaching/Internship Opportunity", "uid_a": "a_0"}], "history_size": 1, "i_edits": [], "id": "korhg5spcwa6gg", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 15114, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654540368611, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jzqdjl24y7f5nf", "name": "Amritansh Saraf", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jzqdjl24y7f5nf"], "tags": ["announcements", "enrichment_opportunities", "other", "student"], "type": "note", "unique_views": 416}