{"bookmarked": 16, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "kpjioi61a871ic", "type": "create", "uid_a": "a_0", "v": "all", "when": "2021-06-05T08:51:14Z"}, {"anon": "stud", "data": "kpjiospa87f21a", "type": "update", "uid_a": "a_0", "when": "2021-06-05T08:51:27Z"}, {"anon": "stud", "data": "kpjip7vwaew2lq", "type": "update", "uid_a": "a_0", "when": "2021-06-05T08:51:47Z"}, {"anon": "no", "data": "kpk73ed76505oo", "to": "kpjioi5xzh21ib", "type": "s_answer", "uid": "jktvhgjq1t661g", "when": "2021-06-05T20:14:39Z"}, {"anon": "no", "data": "kpk73u6d4d46d0", "type": "s_answer_update", "uid": "jktvhgjq1t661g", "when": "2021-06-05T20:15:00Z"}, {"anon": "no", "data": "kpk7er6hc9boe", "type": "s_answer_update", "uid": "jktvhgjq1t661g", "when": "2021-06-05T20:23:29Z"}, {"anon": "no", "cid": "kpk7u99t5xb6vo", "to": "kpjioi5xzh21ib", "type": "followup", "uid": "k0wplo7nzcb3wp", "when": "2021-06-05T20:35:32Z"}, {"anon": "stud", "data": "kpkgaxj7asv1c0", "type": "update", "uid_a": "a_0", "when": "2021-06-06T00:32:27Z"}, {"anon": "stud", "cid": "kplfl7tevxb4gl", "to": "kpjioi5xzh21ib", "type": "followup", "uid_a": "a_0", "when": "2021-06-06T17:00:14Z"}, {"anon": "stud", "cid": "kplhgyqeo2f73f", "to": "kpjioi5xzh21ib", "type": "feedback", "uid_a": "a_1", "when": "2021-06-06T17:52:55Z"}, {"anon": "stud", "cid": "kplipqy5m3g1c7", "to": "kpjioi5xzh21ib", "type": "feedback", "uid_a": "a_2", "when": "2021-06-06T18:27:44Z"}, {"anon": "stud", "cid": "kpljssz5h7v322", "to": "kpjioi5xzh21ib", "type": "feedback", "uid_a": "a_1", "when": "2021-06-06T18:58:06Z"}, {"anon": "stud", "cid": "kplz9ifwbqr200", "to": "kpjioi5xzh21ib", "type": "followup", "uid_a": "a_0", "when": "2021-06-07T02:11:00Z"}, {"anon": "stud", "data": "kpn2v3oe6mp5l7", "type": "s_answer_update", "uid_a": "a_3", "when": "2021-06-07T20:39:32Z"}, {"anon": "stud", "cid": "kpnga20wp6p2r9", "to": "kpjioi5xzh21ib", "type": "followup", "uid_a": "a_0", "when": "2021-06-08T02:55:05Z"}, {"anon": "stud", "cid": "kpngaj7dswu3tg", "to": "kpjioi5xzh21ib", "type": "feedback", "uid_a": "a_0", "when": "2021-06-08T02:55:27Z"}, {"anon": "no", "cid": "kpoemf61ji81dk", "to": "kpjioi5xzh21ib", "type": "feedback", "uid": "is6p815tz306kj", "when": "2021-06-08T18:56:29Z"}, {"anon": "stud", "cid": "kpqlgvlde3neq", "to": "kpjioi5xzh21ib", "type": "feedback", "uid_a": "a_0", "when": "2021-06-10T07:43:40Z"}, {"anon": "no", "cid": "kpr6lmxdc2q57n", "to": "kpjioi5xzh21ib", "type": "feedback", "uid": "is6p815tz306kj", "when": "2021-06-10T17:35:14Z"}, {"anon": "no", "cid": "kprfiyz74bk55z", "to": "kpjioi5xzh21ib", "type": "feedback", "uid": "is6p815tz306kj", "when": "2021-06-10T21:45:06Z"}, {"anon": "stud", "cid": "kpvshtvu25n2cb", "to": "kpjioi5xzh21ib", "type": "feedback", "uid_a": "a_0", "when": "2021-06-13T22:59:12Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {"editor": "rte"}, "created": "2021-06-05T20:14:39Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>Posting my response from this previous post as a reference: @14945</p>\n<p></p>\n<p>As a question of whether to do a masters or a PhD, it depends. PhD’s are a much heavier time commitment and it is more like advanced training for research. They are spending multiple years to teach you how to do research and create meaningful results. I consider a masters much more like getting expertise in a certain field or as a stepping stone to getting a PhD. It definitely is a smaller time commitment than a PhD. In the case of ML, it might be getting indepth experience with NLP or RL or something. Most people I talk to who do ML are there just to get a better salary after graduating.</p>\n<p></p>\n<p>------------------------------------------------------------------------------------------------</p>\n<p></p>\n<p>If you are uncertain whether you want to do a masters or a PhD but are able to get into PhD programs, go for a PhD. If you find out that it doesn&#39;t work for you a year or two in, you can easily just leave with a masters if you&#39;ve completed some coursework requirements and maybe some sort of qualifying exam depending on the program. In this situation, you can get to see what a PhD student life is like and if it doesn&#39;t work out, you can just leave after a year or two with a masters, and the best part is that you don&#39;t need to pay for anything! </p>", "created": "2021-06-07T20:39:32Z", "subject": "", "uid_a": "a_3"}, {"anon": "no", "content": "<md>Posting my response from this previous post as a reference: @14945\n\nAs a question of whether to do a masters or a PhD, it depends. PhD's are a much heavier time commitment and it is more like advanced training for research. They are spending multiple years to teach you how to do research and create meaningful results. I consider a masters much more like getting expertise in a certain field or as a stepping stone to getting a PhD. It definitely is a smaller time commitment than a PhD. In the case of ML, it might be getting indepth experience with NLP or RL or something. Most people I talk to who do ML are there just to get a better salary after graduating. </md>", "created": "2021-06-05T20:23:29Z", "subject": "", "uid": "jktvhgjq1t661g"}, {"anon": "no", "content": "<md>Posting my response from this previous post as a reference: @14945\n\n</md>", "created": "2021-06-05T20:15:00Z", "subject": "", "uid": "jktvhgjq1t661g"}, {"anon": "no", "content": "<md>Posting my response from this previous post as a reference: https://piazza.com/class/hyq0br1u3kx7dg?cid=14945\n\n</md>", "created": "2021-06-05T20:14:39Z", "subject": "", "uid": "jktvhgjq1t661g"}], "history_size": 4, "id": "kpk73ecwgkp5on", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvgoe0t1k57a", "name": "Kristy Lee", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["jktvgoe0t1k57a"], "type": "s_answer"}, {"anon": "no", "bucket_name": "Week 5/30 - 6/5", "bucket_order": 8, "children": [{"anon": "stud", "bucket_name": "Last week", "bucket_order": 6, "children": [], "config": {"editor": "plain"}, "created": "2021-06-06T18:27:44Z", "data": {"embed_links": null}, "folders": [], "id": "kplipqy5m3g1c7", "subject": "Just wondering, have you done an ML engineer job or internship? Trying to find a job like this...", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_2", "updated": "2021-06-06T18:27:44Z"}, {"anon": "stud", "bucket_name": "Last week", "bucket_order": 6, "children": [], "config": {"editor": "rte"}, "created": "2021-06-06T18:58:06Z", "data": {"embed_links": null}, "folders": [], "id": "kpljssz5h7v322", "subject": "<p>I&#39;m currently working at a company with a few ML Research Engineer Interns, about half are Ph.D. students and the other half are undergrads with very high qualifications (IMO gold winner, USACO camp)</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_1", "updated": "2021-06-06T18:58:06Z"}], "config": {"editor": "plain"}, "created": "2021-06-05T20:35:32Z", "data": {"embed_links": null}, "folders": [], "id": "kpk7u99t5xb6vo", "no_answer": 1, "no_upvotes": 0, "subject": "ML Engineer job doesn&#39;t really warrant a PhD, a Masters is sufficient. ML Researcher might.", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvgoe0t1k57a", "name": "Kristy Lee", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jktvgoe0t1k57a"], "type": "followup", "uid": "k0wplo7nzcb3wp", "updated": "2021-06-05T20:35:32Z"}, {"anon": "stud", "bucket_name": "Last week", "bucket_order": 6, "children": [{"anon": "stud", "bucket_name": "Last week", "bucket_order": 6, "children": [], "config": {"editor": "rte"}, "created": "2021-06-06T17:52:54Z", "data": {"embed_links": null}, "folders": [], "id": "kplhgyqeo2f73f", "subject": "<p>Still an undergrad so take my opinion with a grain of salt: PhDs are extremely time intensive, and often times people who do a PhD do it because they genuinely want to do it, not because they want a bump in salary (doing a PhD can result in losing out on almost 1 million in total pre-tax earnings). If you genuinely want to do a PhD, there is no harm in doing a MS first, as the 1-2 years it takes to do the MS is pretty negligible compared to the time needed to do a PhD. If you are still on the fence on doing a PhD, doing the MS first can help you test the waters, and if it turns out you really hate it you wouldn&#39;t have to spend the next 5-6 years of your life doing something you hate.</p>\n<p></p>\n<p>TLDR; do a MS and then decide imo.</p>", "tag_good": [{"admin": false, "endorser": {"jl45ryhehgj7": 1542844745}, "facebook_id": null, "id": "jl7cz51l20g41z", "name": "Amy Doo", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvgoe0t1k57a", "name": "Kristy Lee", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jl7cz51l20g41z", "jktvgoe0t1k57a"], "type": "feedback", "uid_a": "a_1", "updated": "2021-06-06T17:52:54Z"}], "config": {"editor": "rte"}, "created": "2021-06-06T17:00:14Z", "data": {"embed_links": null}, "folders": [], "id": "kplfl7tevxb4gl", "no_answer": 1, "no_upvotes": 0, "subject": "<p>I guess another main question I have is, if I don&#39;t know if I want to do a PhD at this point of time (as in, the summer before senior year), is it the right choice for me? Can I decide over the summer, yes I want to pursue a PhD given my research background, and not regret my decision later in life, or is there some risk because at this point of time I don&#39;t know if I want to do a PhD or not? </p>\n<p>As for the decision, there are things I&#39;m still unsure about, maybe I don&#39;t really know what happens in the later years of PhD. I think research is interesting, but I could potentially benefit from the research component / honors thesis component of the fifth year master program.</p>\n<p>Of course, I can complete an honors thesis during my fourth year as part of the EECS Honors Program and have that experience. And I guess, I suppose I <em>could</em> enter the grad school application process regardless of whether I end up doing PhD or not. I think the main reason why I am uncertain is because my year with working under a PhD student was done remotely, and I feel like I don&#39;t have a complete grasp over all components of my research experience this past year to <em>know</em> I want to do a PhD. And there is a potential that the uncertainty can be fixed with a semester &#43; a year back at school doing research, so I think in this situation it is worth it for me to apply for both PhD and masters programs?</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_0", "updated": "2021-06-06T17:00:14Z"}, {"anon": "stud", "bucket_name": "Last week", "bucket_order": 6, "children": [{"anon": "no", "bucket_name": "Last week", "bucket_order": 6, "children": [], "config": {"editor": "rte"}, "created": "2021-06-08T18:56:29Z", "data": {"embed_links": null}, "folders": [], "id": "kpoemf61ji81dk", "subject": "<p>My legitimate recommendation would be to apply to the fifth year MS program here and only apply to PhD programs elsewhere. As (part of) the student answer notes, the first year or two of a PhD are all about &#34;finding your fit&#34; anyway, and it&#39;s not unusual or unexpected for students to drop out (usually with a master&#39;s). If you have the credentials to be competitive for PhD admission at a top 20 school, I&#39;d say that you almost certainly will get into the fifth year MS program, even with letters of rec really intended for PhD applications, so this mitigates risk in that sense.</p>\n<p></p>\n<p>If you don&#39;t like Berkeley that much, the upshot is that the fifth year MS is only a year long anyway. The only reason why an MS somewhere else would be worthwhile would be if you <em>really really</em> don&#39;t like Berkeley (to the point where it affects your productivity) and <em>really </em>don&#39;t think you&#39;re competitive for PhD admission at that school (and also have / expect to have a lot of money). </p>\n<p></p>\n<p>source: did exactly what I am recommending</p>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvgoe0t1k57a", "name": "Kristy Lee", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6xz4atuxp82ko", "name": "Zaynah Javed", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jktvgoe0t1k57a", "j6xz4atuxp82ko"], "type": "feedback", "uid": "is6p815tz306kj", "updated": "2021-06-08T18:56:29Z"}, {"anon": "stud", "bucket_name": "Last week", "bucket_order": 6, "children": [], "config": {"editor": "rte"}, "created": "2021-06-10T07:43:40Z", "data": {"embed_links": null}, "folders": [], "id": "kpqlgvlde3neq", "subject": "<p>Hi Averal, thanks for your comment. Was curious, is there a particular reason why not to apply to both the fifth year masters program at Berkeley and the PhD program at Berkeley? </p>\n<p></p>\n<p>Another note: I think your second paragraph is interesting - about not liking Berkeley. I am actually going through something like this myself, which is influencing my own decision about where I apply and the potential of not staying over at Berkeley for the fifth year masters program. Are there people you know who anecdotally felt that way and thus applied outside of Berkeley? </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_0", "updated": "2021-06-10T07:43:40Z"}, {"anon": "no", "bucket_name": "Last week", "bucket_order": 6, "children": [], "config": {"editor": "rte"}, "created": "2021-06-10T17:35:14Z", "data": {"embed_links": null}, "folders": [], "id": "kpr6lmxdc2q57n", "subject": "<p>1) You&#39;re only allowed to apply to one grad program at Berkeley. So, for me, it was either one or the other. When I applied as a senior undergrad, it felt risky to only apply to PhD programs, so I chose to just apply to the fifth year MS. In any case, at least at that point, I would have preferred to do a PhD at any of the other schools I was applying to. I was actually advised against this course of action by a professor, but I was proven correct by the time decisions came out. </p>\n<p></p>\n<p>2) I think I can think of at least one person that applied to MS and PhD programs as a senior undergrad with the intention of leaving Berkeley. In that person&#39;s case, I think Berkeley ended up being the best option they were accepted to, so they did the fifth year MS and, by the time of the next fall, found that they wanted to continue on to a PhD. After applying to PhD programs, they were accepted to a few really good ones, and ended up going to one of those for their PhD. By that point, I think they had become aware that grad school (specifically the PhD) at Berkeley is very different from undergrad (I can confirm that it&#39;s a lot nicer), so the Berkeley PhD was their top choice, but I don&#39;t think that worked out (don&#39;t worry - the programs they were accepted at could be considered to be better in many ways, depending on your perspective). </p>\n<p></p>\n<p>Now that I&#39;ve gone through it, I&#39;d say that the fifth year MS isn&#39;t that great of a program (it strangely has more requirements than the standard MS in the MS/PhD and gives you less time to complete them, for starters). But, in my opinion, a master&#39;s degree is only really worth a huge investment if it&#39;s going to completely shift your lifestyle or network. As an example, a CS graduate from say, Ohio State, would gain a lot from doing a 2-year MS at Stanford, since they&#39;d build a whole new network in California and probably encounter new challenges and perspectives. You could infer that a CS graduate from Berkeley might see less value in the same course of action. </p>\n<p></p>\n<p>Since it was relatively (incredibly) inexpensive and only a stepping stone to me anyway, the fifth year MS was still worth it. I didn&#39;t like Berkeley very much as an undergrad, but most of my misgivings had to do with the culture surrounding CS here, and I&#39;ve been pursuing EE since I was a sophomore, so it wasn&#39;t like I was continuing doing something I don&#39;t like (or doing it somewhere I didn&#39;t feel appreciated or valued). There&#39;s simply a lot of stuff to learn in EE, so doing at least an MS is very normal and even doing a PhD and ending up in industry is normal as well, so perhaps read my advice with that in mind. Hopefully this helps :^)</p>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvgoe0t1k57a", "name": "Kristy Lee", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6xz4atuxp82ko", "name": "Zaynah Javed", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jktvgoe0t1k57a", "j6xz4atuxp82ko"], "type": "feedback", "uid": "is6p815tz306kj", "updated": "2021-06-10T17:35:14Z"}, {"anon": "no", "bucket_name": "Last week", "bucket_order": 6, "children": [], "config": {"editor": "rte"}, "created": "2021-06-10T21:45:06Z", "data": {"embed_links": null}, "folders": [], "id": "kprfiyz74bk55z", "subject": "<p>I&#39;ll also include that winning a federal fellowship played a big factor in influencing me to pursue a PhD (I guess it made me feel good about myself?). I&#39;d definitely encourage anyone in your position to apply to all of the fellowships that apply to them (e.g. NSF, NDSEG, Hertz, Soros, for a U.S. citizen, NSERC for a Canadian citizen) and make sure that you have a high probability of getting into at least one grad program (for me it was the fifth year MS).</p>\n<p></p>\n<p>In my opinion, it&#39;s generally actually more likely for a U.S. citizen coming from a top 20 school to win either NSF or NDSEG (or both) as a senior undergrad than to get accepted to Berkeley/Stanford/CMU/MIT/Caltech, etc. for a PhD in the first place. Winning a fellowship and then doing the fifth year MS gave me a lot of application leverage the second time around at least (since no advisor has to &#34;cover&#34; for you before you become productive from a research perspective). </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "is6p815tz306kj", "updated": "2021-06-10T21:45:06Z"}, {"anon": "stud", "bucket_name": "Today", "bucket_order": 3, "children": [], "config": {"editor": "rte"}, "created": "2021-06-13T22:59:12Z", "data": {"embed_links": null}, "folders": [], "id": "kpvshtvu25n2cb", "subject": "<p>Thanks for the advice!</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_0", "updated": "2021-06-13T22:59:12Z"}], "config": {"editor": "rte"}, "created": "2021-06-07T02:11:00Z", "data": {"embed_links": null}, "folders": [], "id": "kplz9ifwbqr200", "no_answer": 1, "no_upvotes": 0, "subject": "<p>I feel like I&#39;d apply to both masters and PhD programs since my decision to do PhD hinges on having at least a year of (in person) experience, and upon that I&#39;d commit (since ideally I would want to start ASAP since PhD takes a long time, but I don&#39;t have enough information right now over summer to make the decision decisively). </p>\n<p>Would it possibly be suboptimal if I applied to both, since my letter of rec for PhD programs may be affected in that it might not necessarily say &#34;I known since I started Berkeley that I wanted to pursue a PhD in CS&#34; (in third person) or have a compelling story behind doing a PhD? Would that be a valid concern to have?</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_0", "updated": "2021-06-07T02:11:00Z"}, {"anon": "stud", "bucket_name": "Last week", "bucket_order": 6, "children": [{"anon": "stud", "bucket_name": "Last week", "bucket_order": 6, "children": [], "config": {"editor": "rte"}, "created": "2021-06-08T02:55:27Z", "data": {"embed_links": null}, "folders": [], "id": "kpngaj7dswu3tg", "subject": "<p>was wondering if I could receive any input</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_0", "updated": "2021-06-08T02:55:27Z"}], "config": {"editor": "rte"}, "created": "2021-06-08T02:55:05Z", "data": {"embed_links": null}, "folders": [], "id": "kpnga20wp6p2r9", "no_answer": 1, "no_upvotes": 0, "subject": "<p>^ to those who responded, thanks! I was still finally concerned about the following point of LOR for PhD and masters, before I proceed with asking my recommenders for a LOR</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_0", "updated": "2021-06-08T02:55:05Z"}], "config": {"editor": "rte", "has_emails_sent": 1, "seen": {"1065": 4, "11075": 5, "11988": 0, "12432": 7, "13429": 6, "13939": 1, "14085": 3, "14392": 9, "7461": 2, "8787": 8}}, "created": "2021-06-05T08:51:14Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["enrichment_opportunities", "research"], "history": [{"anon": "stud", "content": "<p>Want people&#39;s opinions for reasons to apply for a PhD program for CS, and reasons to apply for a (research based/industry based ML) masters program in CS. I am a rising senior considering both for pursuing a ML Engineer or CS research scientist job after finishing the grad program.</p>\n<p></p>\n<p>I&#39;m trying to decide between grad school and masters, and I have research background in ML/NLP since sophomore year, but because of covid I don&#39;t feel like my research experience is informative enough to make me feel persuaded that I want to do a PhD, despite having a minor contribution to a publication. Also was interested in what types of research backgrounds people who are applying to PhD programs have</p>", "created": "2021-06-06T00:32:27Z", "subject": "Grad School versus Masters for ML Engineer/Research Scientist job", "uid_a": "a_0"}, {"anon": "stud", "content": "<p>Want people&#39;s opinions for reasons to apply for a PhD program for CS, and reasons to apply for a (research based/industry based ML) masters program in CS. I am a rising senior considering both for pursuing a ML Engineer or CS research scientist job after finishing the grad program.</p>\n<p></p>\n<p>I&#39;m trying to decide between grad school and masters, and I have research background in ML/NLP since sophomore year, but because of covid I don&#39;t feel like my research experience is informative enough to make me feel persuaded that I want to do a PhD, despite having a minor contribution to a publication. Also was interested in what types of research backgrounds do people who are applying to PhD programs have</p>", "created": "2021-06-05T08:51:47Z", "subject": "Grad School versus Masters for ML Engineer/Research Scientist job", "uid_a": "a_0"}, {"anon": "stud", "content": "<p>Want people&#39;s opinions for reasons to apply for a PhD program for CS, and reasons to apply for a (research based/industry based ML) masters program in CS. I am a rising senior considering both for pursuing a ML Engineer or CS research scientist job after finishing the grad program.</p>\n<p></p>\n<p>I&#39;m trying to decide between grad school and masters, and I have research background in ML/NLP since sophomore year, but because of covid I don&#39;t feel like my research experience is informative enough to make me feel persuaded that I want to do a PhD, despite having a publication. Also was interested in what types of research backgrounds do people who are applying to PhD programs have</p>", "created": "2021-06-05T08:51:27Z", "subject": "Grad School versus Masters for ML Engineer/Research Scientist job", "uid_a": "a_0"}, {"anon": "stud", "content": "<p>Want people&#39;s opinions for reasons to apply for a PhD program for CS, and reasons to apply for a (research based/industry based ML) masters program in CS. I am a rising senior considering both for pursuing a ML Engineer or CS research scientist job after finishing the grad program.</p>\n<p></p>\n<p>I&#39;m trying to decide between grad school and masters, and I have research background in ML/NLP since sophomore year, but because of covid I don&#39;t feel like my research experience is informative enough to make me feel persuaded that I want to do a PhD. Also was interested in what types of research backgrounds do people who are applying to PhD programs have</p>", "created": "2021-06-05T08:51:14Z", "subject": "Grad School versus Masters for ML Engineer/Research Scientist job", "uid_a": "a_0"}], "history_size": 4, "i_edits": [], "id": "kpjioi5xzh21ib", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 4, "nr": 15220, "num_favorites": 7, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654540249420, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "kblrvnox2h65e", "name": "Srinath Rangan", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvgoe0t1k57a", "name": "Kristy Lee", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"kdz4wzqnb6052o": 1602540126}, "facebook_id": null, "id": "kd65gebmmj97kd", "name": "Adrian Serapio", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["kblrvnox2h65e", "jktvgoe0t1k57a", "kd65gebmmj97kd"], "tags": ["enrichment_opportunities", "student"], "type": "question", "unique_views": 522}