{"bookmarked": 5, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "kv1ejk612ar126", "type": "create", "uid_a": "a_0", "v": "all", "when": "2021-10-21T20:33:47Z"}], "children": [], "config": {"editor": "rte", "has_emails_sent": 1}, "created": "2021-10-21T20:33:47Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements", "enrichment_opportunities"], "history": [{"anon": "stud", "content": "<h3>Overview</h3>\n<p>The Sutardja Center for Entrepreneurship &amp; Technology (SCET) is a global innovation hub headquartered at UC Berkeley’s College of Engineering where aspiring entrepreneurs and innovators take deep dives into the world of technology entrepreneurship and embark on the path to develop exciting new ventures. The Center is currently seeking two Student Assistants to join the SCET Student Innovation Fellow Program.</p>\n<p><b>External Title: </b>1) SCET Student Fellow, Technology and Data 2) SCET Student Fellow, Marketing and Content</p>\n<p><b>Payroll Title: </b>Student Assistant</p>\n<p><b>Duration: </b>1/18/21 – 5/31/21 (with the intent to continue in the 2022-2023 academic year, pending performance and program review)</p>\n<p><b>Time Commitment: </b>5 hours per week</p>\n<p><b>Pay Rate Range: </b>$19.00 per hour (no tuition remission)</p>\n<h3>Description</h3>\n<p>The SCET Student Innovation Fellow Program is a unique opportunity to help launch a SCET Community Program with the goals of creating immersive entrepreneurial experiences, build genuine lasting connections with the community of SCET students, alumni and industry and hone student skills to launch careers.  We will be experimenting with gamifying strategies to reach a larger audience, encourage deeper learnings and have fun.</p>\n<p>As a SCET Student Innovation Fellow, you will have the opportunity to network with founders and venture capitalists with priority access to events and programming.  This is a unique engagement opportunity in the tech innovation community at Cal.</p>\n<p> </p>\n<h3>SCET Events </h3>\n<p>The following is a list of events that SCET Student Innovation Fellows will plan and execute from Feb-April 2022:</p>\n<p><b>Off the Record Evening Series:  Path to Innovation</b></p>\n<p>Path to Innovation discussions will focus on trends, translating your passions to a company, prototyping, funding and all things start-up related.</p>\n<p>–<i>Format: 1.5 hour sessions on Wednesdays, 5:30-7:00pm PST, a combination of virtual and in person events</i></p>\n<p><b>Student to Interview an entrepreneur and submit a reflection on what was learned</b></p>\n<p><b>Innovation X Seminar</b></p>\n<p>This SCET program is where we convene industry leaders to discuss many forms of innovation and how our world is changing across various industries and disciplines.  Each roundtable we put together serves as a conversation to discuss observations and what has been learned not only during the Covid pandemic, but our changing world. We also talk about innovation that is required both in the short and long term, what distortions in the marketplace have created opportunities and provoke a brainstorm on ways to solve identified problems. The goal is not only to educate, but also to build our network of innovators and glean ideas and projects our students can work on in our labs.</p>\n<p><i>-Format: 1 Hour sessions on the Third Thursday of the month of the semester</i></p>\n<p><b>Weekly Challenges—small, quick and fun social challenges</b> </p>\n<p> </p>\n<h3>Responsibilities </h3>\n<p>As a SCET Student Fellow, you will be part of building and promoting this program while also tracking impact.  Responsibilities will include:</p>\n<ul><li>Helping define content and recruit speakers for events to support the program</li><li>Brainstorm weekly challenges and manage participation</li><li>Build a system to track attendance, participation, feedback loops, student points and diversity consideration</li><li>Manage all speaker event logistics and possibly attend the events</li><li>Promote both the initiative and specific events through social channels, grass roots efforts including speaking at SCET classes about the program</li><li>Help define the gaming aspect of the program</li><li>Help to secure and manage partners of the gamified gifts.  This will include ways to promote partners for their support of the program and donated gamified gifts.</li><li>Identify possible program innovations and or extensions for future semesters (ie. Crypto, NFTs, etc…..)</li><li>Create a recap of highlights, learning lessons and impact of the spring 2022 program</li></ul>\n<p> </p>\n<h3>Preferred Qualifications:</h3>\n<ul><li>Self-motivated</li><li>Interest in creating and supporting a community</li><li>Affinity for managing social platforms including Twitter, Discord, Instagram</li><li>Project management experience and the ability to handle deadlines</li><li>Solid written and verbal communication skills</li><li>Creative and analytical skills</li><li>Committed to a collaborative environment</li><li>Experience with Airtable a plus</li><li>Experience and interest in game theory a plus</li><li>Experience with event planning a plus</li></ul>\n<p> </p>\n<h3>Eligibility</h3>\n<p>Student jobs are restricted to UC Berkeley students who are registered for the current academic semester, or in the grace period immediately before or after academic semester registration (grace period defined as a semester or summer, whichever is before or after the period of enrollment). International students can refer to the <a href=\"https://internationaloffice.berkeley.edu/students/employment/oncampus\" target=\"_blank\" rel=\"noopener noreferrer\">International Office website</a> for additional details on employment eligibility. Students cannot be appointed in any combination of jobs over 100% FTE (40 hrs/week) at any given time at the University. </p>\n<p> </p>\n<h3>How to Apply</h3>\n<p>Submit the <a href=\"https://forms.gle/sTU6oeBM1xNCSZJr9\" target=\"_blank\" rel=\"noopener noreferrer\">Application Form</a> with your Resume and Interest Statement by <strong>Monday, November 15, 2021</strong>.</p>\n<p> </p>\n<h3>Questions:</h3>\n<p>Questions about the positions can be directed to Jennifer Nice (<a href=\"mailto:jennifernice@berkeley.edu\">jennifernice</a><a href=\"mailto:jennifernice@berkeley.edu\">@berkeley.edu</a>).</p>", "created": "2021-10-21T20:33:47Z", "subject": "SCET Seeking Students to join the new SCET Student Innovation Fellow Program", "uid_a": "a_0"}], "history_size": 1, "i_edits": [], "id": "kv1ejk5x3x0125", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 15958, "num_favorites": 2, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654539442491, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvgcjtoby4zk", "name": "Anita Shen", "photo": null, "photo_url": null, "role": "student", "us": false}], "tag_good_arr": ["jktvgcjtoby4zk"], "tags": ["announcements", "enrichment_opportunities", "student"], "type": "note", "unique_views": 233}