{"bookmarked": 8, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "kxgo1st1nlg2qg", "type": "create", "uid": "gxjgboc19oq5mz", "v": "all", "when": "2021-12-21T22:15:52Z"}, {"anon": "no", "cid": "kxi4jxkmhti49s", "to": "kxgo1sswdii2qe", "type": "followup", "uid": "jwu0uz3r3sy587", "when": "2021-12-22T22:45:38Z"}], "children": [{"anon": "no", "bucket_name": "Last week", "bucket_order": 6, "children": [], "config": {"editor": "md"}, "created": "2021-12-22T22:45:38Z", "data": {"embed_links": null}, "folders": [], "id": "kxi4jxkmhti49s", "no_answer": 0, "no_upvotes": 0, "subject": "<md>Hi Professor Lustig, I took your EE194 in Spring 2020, does the contents overlap/can I still take this course? I'm very interested in DXpeditioning!</md>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jzlnpfrl2qk2e6", "name": "Justin Xia", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jzlnpfrl2qk2e6"], "type": "followup", "uid": "jwu0uz3r3sy587", "updated": "2021-12-22T22:45:38Z"}], "config": {"editor": "rte", "has_emails_sent": 1, "is_announcement": 1}, "created": "2021-12-21T22:15:52Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["other", "announcements", "eecs"], "history": [{"anon": "no", "content": "<p>Hi --</p>\n<p></p>\n<p>I&#39;d like to promote our followup class EE84 – Fun with ham radio. EE39 is not a requirement. Please see the description below. This semester you will get to experience Earth-moon-earth communications in which the moon surface is used to reflect radio waves and communicate with stations as far as Europe and Asia. </p>\n<p></p>\n<p></p>\n<p>Here&#39;s a detailed info:</p>\n<p>This is the second part of a series of two classes (EE39—hands on ham, EE84 – Fun with ham radio). If you have taken EE39, or already have an amateur radio license, take this class. <br /><br />Amateur radio (ham radio) is a popular hobby and service in which licensed Amateur Radio operators (hams) operate communications equipment. Although Amateur Radio operators get involved for many reasons, they all have in common a basic knowledge of radio technology and operating principles, and pass an examination for the FCC license to operate on radio frequencies known as the “Amateur Bands.&#34; These bands are radio frequencies reserved by the Federal Communications Commission (FCC) for use by ham radio operators.<br /><br />While this course is originally intended as continuation of the “Hands-on Ham Radio” Sophomore seminar, it is self sustaining and we welcome anyone interested in taking the class with and without previous background. We will cover topics such as:<br /><br />Simple antenna design and simulation<br />Practical design and building of shortwave antennas: from minimalistic to competitive <br />A focus on radio sport: What is contesting? How can I participate? – for students interested and having an amateur radio license, permitting pandemic status, we plan to organize a joint participation using our campus shortwave station.<br />DX-Peditioning: Traveling and amateur radio from casual to extreme<br />Moonbounce: How to use the moon as passive reflector for radio waves<br />Special topics on radio propagation<br />Morse code—see details below<br /><br />In doomsday Hollywood movies (e.g. Independence Day) as a last resort of communication, people start to use Morse code to get the message across. The reason for this is that Morse code is a globally understood code that uses, aside from the code itself, abbreviations that are independent of local languages and understood by radio amateurs worldwide. Morse code was inscripted as UNESCO world heritage in 2014 and is widely used among radio amateurs. Also, Morse code is the most efficient operation mode with low power and/or over long distances without using computer-generated digital modes. As a fun activity, we will spend about 15 minutes each week learning Morse code from scratch.</p>\n<p></p>\n<p><img src=\"/redirect/s3?bucket=uploads&amp;prefix=paste%2Fgxjgboc19oq5mz%2F7d3076a277df7aa785b17f3cc9dad51202281213e8bc81ff0581559ee3e2d7b9%2Fee84.jpg\" width=\"600\" height=\"514\" alt=\"\" /></p>", "created": "2021-12-21T22:15:52Z", "subject": "Take EE84-- fun with ham -- another amazing sophomore seminar", "uid": "gxjgboc19oq5mz"}], "history_size": 1, "i_edits": [], "id": "kxgo1sswdii2qe", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 16245, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654539128119, "tag_good": [], "tag_good_arr": [], "tags": ["announcements", "eecs", "instructor-note", "other"], "type": "note", "unique_views": 404}