{"bookmarked": 7, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "kzfwq8rhu2e4p", "type": "create", "uid": "kdtcwlen37w4bd", "v": "all", "when": "2022-02-09T18:50:28Z"}], "children": [], "config": {"editor": "rte", "has_emails_sent": 1, "is_announcement": 1}, "created": "2022-02-09T18:50:28Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["events"], "history": [{"anon": "no", "content": "<p>----Co-Sponsored by AWE----</p>\n<p></p>\n<p>a16z College Talent Program<br />At a16z, we are looking to connect the best engineering talent with our portfolio companies. If you’re interested in learning more about opportunities within our portfolio, we’d like to connect!<br /><br />Join us and three of our portfolio companies for an evening of tech talks at UC Berkeley.<br /><br />We will be giving $15 door dash gift cards to all attendees.</p>\n<p></p>\n<p>RSVP <a href=\"https://www.canvas.com/app/discover/events/a/a/aa2683cb-a6ca-4712-88d7-c8e53a828c92\" target=\"_blank\" rel=\"noopener noreferrer\">HERE</a><br /><br />Featured companies include:<br /><br />AKASA is the leading developer of AI for healthcare operations. AKASA scales human intelligence with leading-edge AI and ML securely trained on customer data to learn unique systems, continuously adapt to changing environments, and deliver comprehensive automation and analytics for complex workflows. The result is a seamlessly integrated, customized solution that reduces operating costs, frees up staff to do the work they love, and helps health systems allocate resources to where they matter most. <br /><br />AKASA brings together the best of people, data and technology to efficiently, accurately and autonomously navigate the complex state of healthcare administration and operations. We are growing rapidly and we’ve built a cross-functional skill set deep into the DNA of the company. We have technology experts from top Silicon Valley technology companies (i.e. Google, Facebook, Netflix) and machine learning PhD programs (i.e. Stanford). We also have senior leaders from the frontlines of healthcare with decades of experience leading teams at prominent healthcare institutions in the US. And we have a deep bench of talent from healthcare services firms like the Advisory Board, Optum and Triage Consulting.<br /><br />AKASA has a work-from-anywhere attitude, has been selected as a Great Place to Work for two years in a row and we are hiring. Step into the future of healthcare with AKASA. Learn more at https://jst.me/2fsw <br /><br />Queenly is the leading marketplace and search engine for formalwear. To help people find their perfect wedding dress, ball gown, or special occasion wear, our company&#39;s engineering team has blended their knowledge of data science, CV, ML, and formal wear industry knowledge. Since 2019, Queenly has grown to over 200k downloads in the iOS app store, raised $7 million from YC and Andreessen Horowitz, and had their founders Trisha and Kathy featured on the Forbes 30 Under 30 2022 list.<br /><br />Illumio was founded in 2013 by Andrew Rubin (CEO) and PJ Kirner (CTO). Our office is based out of Sunnyvale, California. We are a Cybersecurity company known for our leadership and one of the early pioneers in Zero Trust Segmentation. Zero Trust Segmentation: proactively stopping ransomware, malware, and other attacks from moving beyond their initial point of entry, ending as headline-breaking cyber disasters. Illumio is a Series F company and this past June, we secured $225 Million at a $2.75 Billion valuation.</p>", "created": "2022-02-09T18:50:28Z", "subject": "a16z Tech Talk with AKASA, Queenly and Illumio", "uid": "kdtcwlen37w4bd"}], "history_size": 1, "i_edits": [], "id": "kzfwq8rdnw54o", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 16556, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654538786246, "tag_good": [], "tag_good_arr": [], "tags": ["events", "instructor-note"], "type": "note", "unique_views": 342}