{"bookmarked": 7, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "kzq8y1b231w3k1", "type": "create", "uid": "kzop7yequun6v1", "v": "all", "when": "2022-02-17T00:30:09Z"}], "children": [], "config": {"editor": "rte", "has_emails_sent": 1, "is_announcement": 1}, "created": "2022-02-17T00:30:09Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["events"], "history": [{"anon": "no", "content": "<p>----Co-Sponsored by AWE----</p>\n<p><strong></strong></p>\n<p><strong>IXL Learning</strong> is hosting 1:1 chats with 4 of their engineers and 1 of their product managers. Here&#39;s an opportunity for students to meet engineers from different teams in IXL Learning, learn why they chose to work in EdTech, and ask any questions you may have about IXL and/or the interview process.<br /><br /><strong><a href=\"https://docs.google.com/spreadsheets/d/1uWvD-sDuwPtyDny13OL6h37_9chhktoBk6RQsTg5-bo/edit#gid=0\" target=\"_blank\" rel=\"noopener noreferrer\">Sign-up for a time slot here</a></strong><br /><br />(Note: a Zoom link will be shared with you directly after you sign up)<br /><br /><strong>Alyssa Trigg (Software Engineering Lead):</strong> Hi! My name is Alyssa Trigg. I graduated from Cornell University with a double major in Computer Science and Linguistics. I joined IXL Learning in September of 2018. During my time at IXL, I have worked on a number of different teams, including the signed out experience team, the admin analytics team, and the translated editions team. Currently I am the engineering lead for the teacher analytics team.<br /><br /><strong>Andrea Lopez (Product Manager):</strong> I graduated from MIT in 2016 majoring in Computer Science. I joined IXL in the summer of 2017 (4.5 years!). Before that, I was a software engineer. I am currently the product manager in charge of our Diagnostic (assessment to identify student learning gaps and personalize instruction), and Administrator Analytics (data reporting at scale for large schools and districts).<br /><br /><strong>Anne Silbaugh (Software Engineer):</strong> I graduated from Carnegie Mellon with a Bachelors of Science, majoring in Math. I joined IXL right afterwards, in June of 2020, and have been here since then! I actually started on the Integrations team (based in Toronto) at IXL, but switched over to the NC engineering team in early 2021 and am now working on the Wyzant product.<br /><br /><strong>Perry Healy (Software Engineer):</strong> I graduated from the University of North Carolina at Chapel Hill with a BS in Computer Science. I joined IXL as a Software Engineer in August 2020 and worked on the IXL content team before moving on to the Wyzant applications team in May 2021. On my team, I play a part in building, debugging, and testing features for Wyzant, working full-stack in a variety of coding languages including Ruby, Go, and C#.<br /><br /><strong>Yossra Hamid (Software Engineer):</strong> Hi everyone! My name is Yossra Hamid, and I&#39;m a senior software engineer on the Education.com team. I joined IXL a little over a year ago, and I&#39;ve really enjoyed the work I get to do and the people I get to do it with. I graduated from Duke University in 2016.</p>", "created": "2022-02-17T00:30:09Z", "subject": "IXL Learning Tech Talk - 2/23 from 12pm-1pm", "uid": "kzop7yequun6v1"}], "history_size": 1, "i_edits": [], "id": "kzq8y1aytgs3k0", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 16574, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654538768246, "tag_good": [], "tag_good_arr": [], "tags": ["events", "instructor-note"], "type": "note", "unique_views": 248}