{"bookmarked": 7, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "iurz29953t0672", "type": "create", "uid_a": "a_0", "when": "2016-10-27T06:31:42Z"}, {"anon": "full", "data": "iuspu95tjqm130", "to": "iurz2992r28671", "type": "s_answer", "uid_a": "a_1", "when": "2016-10-27T19:01:18Z"}, {"anon": "stud", "to": "iurz2992r28671", "type": "followup", "uid_a": "a_0", "when": "2016-10-27T19:24:38Z"}, {"anon": "no", "to": "iurz2992r28671", "type": "feedback", "uid": "gy8feyu08grdn", "when": "2016-10-29T08:58:09Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2016-10-27T19:01:18Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "full", "content": "<p>if you have done well 61c and 70 and did not find them to be very hard, then I do not think it would be an issue to add a technical. but if you found those class to be heavy, then I would reconsider add another technical because their upperdiv counterparts are very heavy. </p>\n<p></p>\n<p>in terms of technicals to add, 186 would be a great option if you haven&#39;t already taken it because it is one of the most applicable classes to industry and works well as a cross over with 162. stats 134 does not really prepare you for 189 tbh. 188 and 70 given all the probability that you will need for 189(as far as I know since I am currently taking it). if you want a class that will help prepare you for cs189, take math 110. cs189 is very heavy linear algebra. but taking math 110 might be more trouble than its worth and will probably to heavy with that schedule. </p>\n<p></p>\n<p> also, I have heard that ee126 is a much better option over stats 134. most cs people that I have talked to recommend ee126 over stats134. if you want to take a stats class, take stats 135 which will be give you a nice overview of statistics. </p>\n<p></p>\n<p>if you are trying to actually prepare for the job search, take 162, 170 and a breadth. then spend your extra time working on side projects. the side projects will get you the interviews and 170 will get you through the interviews. </p>", "created": "2016-10-27T19:01:18Z", "subject": "", "uid_a": "a_1"}], "id": "iuspu95oswv12z", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}, {"anon": "stud", "bucket_name": "Week 10/23 - 10/29", "bucket_order": 184, "children": [{"anon": "no", "bucket_name": "Week 10/23 - 10/29", "bucket_order": 184, "children": [], "config": {}, "created": "2016-10-29T08:58:09Z", "data": {"embed_links": null}, "folders": [], "id": "iuuz6axczyb5hc", "subject": "<p>Regarding that last point:  while EE 126 is great for anyone who wants a career in machine learning, it probably won&#39;t give you a boost in 189.  Or, to put it another way, there&#39;s no reason to put off 189 until after 126 if you feel like taking 189 sooner.</p>\n<p></p>\n<p>Math 110 might give you a *small* boost in 189, but probably not enough to argue for putting off 189.  Unless you were bewildered by Math 54.</p>\n<p></p>\n<p>(Disclaimer:  obviously not written from the perspective of someone who&#39;s taken classes here.  Students, feel free to disagree with me.)</p>\n<p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "gy8feyu08grdn", "updated": "2016-10-29T08:58:09Z"}], "config": {}, "created": "2016-10-27T19:24:38Z", "data": {"embed_links": null}, "folders": [], "id": "iusqo9l92pd3qh", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Thank you so much for the in-depth response! A few things:</p>\n<p></p>\n<p>– I&#39;m currently in 186, and I&#39;ve already fulfilled all my breadths, so that unfortunately cuts out a lot of your suggestions for a 3rd class. I was looking into Stats 135 too, so maybe that&#39;ll be the one?</p>\n<p></p>\n<p>– I really enjoyed 61C, and appreciated 70, and I have good partners for 162 lined up &#43; we&#39;ll all be in 170 together too, so I have good support for those classes</p>\n<p></p>\n<p>– Maybe should I consider doing Math 110 or EE126 next Fall, and putting off 189 until Spring 2018?</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_0", "updated": "2016-10-27T19:24:38Z"}], "config": {}, "created": "2016-10-27T06:31:42Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": {}, "folders": ["cs"], "history": [{"anon": "stud", "content": "<p>I&#39;m a 3rd-year CS major, only planning on doing 3 classes a semester the rest of my time here. I want to do 162 and 170 next semester to be ready for the job search next fall, and so I can take some classes that are only offered in Fall (CS 194-26, maybe 168).</p>\n<p></p>\n<p>So, for my 3rd class this Spring: I was thinking of doing Stats 134 to prepare for 189, I would consider EE126 but given my other classes... yeah. I&#39;m having a hard time gauging the difficulty/workload of 134, I took 70 and am currently in 188 so I&#39;ve encountered probability multiple times now at this point.</p>\n<p></p>\n<p>Alternatively, I&#39;ve been thinking of trying to make my way into an upper-div UGBA class or 2, if I can. Not exactly sure if I&#39;m even allowed to sign up for those, but if anyone can weigh in on that that&#39;d be great!</p>\n<p></p>\n<p></p>\n<p>TL;DR Done with breadths, ahead on units, need a 3rd class to balance 162 &#43; 170, advice on Stats 134 or anything else would be greatly appreciated! Thanks so much</p>", "created": "2016-10-27T06:31:42Z", "subject": "CS 162 &#43; CS 170 &#43; ??? Stats 134?", "uid_a": "a_0"}], "i_edits": [], "id": "iurz2992r28671", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 2498, "num_favorites": 3, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654554172515, "tag_good": [], "tag_good_arr": [], "tags": ["cs", "student"], "type": "question", "unique_views": 461}