{"bookmarked": 6, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "ixr3gml51k2578", "type": "create", "uid_a": "a_0", "when": "2017-01-10T05:46:12Z"}, {"anon": "no", "to": "ixr3gmk8nl0577", "type": "followup", "uid": "hktxrdvnx9o33c", "when": "2017-01-10T07:04:34Z"}, {"anon": "stud", "to": "ixr3gmk8nl0577", "type": "feedback", "uid_a": "a_0", "when": "2017-01-10T07:13:11Z"}, {"anon": "no", "to": "ixr3gmk8nl0577", "type": "feedback", "uid": "hktxrdvnx9o33c", "when": "2017-01-10T07:17:01Z"}, {"anon": "no", "to": "ixr3gmk8nl0577", "type": "feedback", "uid": "idrimp3e9tl5o1", "when": "2017-01-10T08:43:45Z"}, {"anon": "no", "data": "ixrpls64whh7eg", "to": "ixr3gmk8nl0577", "type": "s_answer", "uid": "gxqrdi51xya608", "when": "2017-01-10T16:06:04Z"}], "children": [{"anon": "no", "bucket_name": "Week 1/8 - 1/14", "bucket_order": 175, "children": [{"anon": "stud", "bucket_name": "Week 1/8 - 1/14", "bucket_order": 175, "children": [], "config": {}, "created": "2017-01-10T07:13:11Z", "data": {"embed_links": null}, "folders": [], "id": "ixr6khjk8ew54q", "subject": "<p>OP here. Classes: 61AB, 70, Math 54. No projects yet - that was sort of my motivation for this post. Web development sounds interesting and I will definitely look into that!</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_0", "updated": "2017-01-10T07:13:11Z"}, {"anon": "no", "bucket_name": "Week 1/8 - 1/14", "bucket_order": 175, "children": [], "config": {}, "created": "2017-01-10T07:17:01Z", "data": {"embed_links": null}, "folders": [], "id": "ixr6pfol7ie7k6", "subject": "<p>Unfortunately I learned a lot of what I know about web dev in internships myself so someone else will have to point you to resources they&#39;ve found helpful but I&#39;m sure you can find a bunch on Google. Start with understanding plain HTML, then CSS, then JS. After that I&#39;d look to try to set up a website that only uses a front-end before beginning to learn more stuff about back-end and the integration between the two. One idea that might be useful is creating a custom website that serves your resume and displays the things you&#39;ve done so far (even if they are primarily class projects).</p>\n<p></p>\n<p>If you&#39;re the type of person that likes to dive headfirst and just see if you can swim, you can try finding sample code for a personal website on github and see if you can start to understand things. Definitely use the inspector in Chrome and just play around with CSS attributes and tags while Googling things you don&#39;t know.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "hktxrdvnx9o33c", "updated": "2017-01-10T07:17:01Z"}, {"anon": "no", "bucket_name": "Week 1/8 - 1/14", "bucket_order": 175, "children": [], "config": {}, "created": "2017-01-10T08:43:45Z", "data": {"embed_links": null}, "folders": [], "id": "ixr9symb25m54c", "subject": "<p>I learned a bit of web dev on my own, so I can help you out :)</p>\n<p></p>\n<p>I was basically in the same boat as you about a year ago (same classes and all) and chose to get into web dev because I had a buncha cool ideas I wanted to work on in the future.</p>\n<p></p>\n<p>If you want to do front end work, W3Schools is a great tool for all your HTML, CS, and JS tools and documentation. Seriously, nearly anything you need will be on this site. Even if front-end work doesn&#39;t interest you, I still recommend you learn the basics of styling and presenting information onto a screen so your future projects look more impressive.</p>\n<p></p>\n<p></p>\n<p>Once your feet are wet, you can move into back end by choosing a framework. There are many: Flask, Django, Ruby, etc., but really the framework doesn&#39;t matter too much. If you want to keep things straightforward, I suggest Flask or Django (as they are Python based, but the other languages aren&#39;t too difficult to pick up). I began first with Django, a Python web framework. There&#39;s the official Django tutorial, but there&#39;s the also Django Girls tutorial (which I preferred): both of these will get you on the right track in terms of how information is stored, manipulated, and passed along the framework, as well as other useful information like templating and all. If you choose Flask or Ruby or Node or something else, just know that there are just as many tutorials and resources available via Youtube (and I&#39;m sure you can ask friends or reddit or anyone on the Berkeley CS / EECS group).</p>\n<p></p>\n<p>Once you&#39;ve completed the tutorial(s), if you still feel uncomfortable with the frameworks, I&#39;d suggest to take a mini-project that you&#39;ve done through the tutorial and make marginal changes to it (see if you can make a survey app, for instance, show how many people on your site voted &#34;Yes&#34; versus &#34;No&#34; after a user votes). Or, you can simply start a new project and work through it slowly, understanding the framework and the uses as you go along.</p>\n<p></p>\n<p>This was kinda Django-centric, but feel free to ask any questions!</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "idrimp3e9tl5o1", "updated": "2017-01-10T08:43:45Z"}], "config": {}, "created": "2017-01-10T07:04:34Z", "data": {"embed_links": null}, "folders": [], "id": "ixr69f5yv5q52h", "no_answer": 0, "no_upvotes": 0, "subject": "<p>It would be helpful to list out what you&#39;ve done in CS so far in terms of classes and any non-class projects you&#39;ve worked on. If you&#39;re looking for internships, there are definitely some companies that will bring you in even after only few classes completed as long as your fundamental CS knowledge is strong since that suggests you&#39;ll be able to successfully learn other things within the time span of your internship.</p>\n<p></p>\n<p>In terms of projects, it depends on which direction you&#39;d like to go. I would recommend web development since it&#39;s fairly easy to jump into but I&#39;m not sure if that interests you.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "hktxrdvnx9o33c", "updated": "2017-01-10T07:04:34Z"}, {"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2017-01-10T16:06:04Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "no", "content": "The best way to learn is by doing. Just one project can be enough to show an employer your ability to learn new things and apply what you know. Try doing a tutorial for a specific framework or library, like Django or Flask since you know Python. Flask is much simpler and still used in prod at many companies.", "created": "2017-01-10T16:06:04Z", "subject": "", "uid": "gxqrdi51xya608"}], "id": "ixrpls5z2vv7ef", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}], "config": {}, "created": "2017-01-10T05:46:12Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": {}, "folders": ["cs"], "history": [{"anon": "stud", "content": "<p>Currently a junior doubling in CS and MCB (I started CS late, so more effectively a second year in CS) and I&#39;m a little stuck in terms of looking for internships because I don&#39;t have much knowledge of how to apply what I know (i.e. building apps?). I&#39;m just looking for general info on where I should look for a starting point- I&#39;m definitely eager to learn, just confused on where to start.</p>", "created": "2017-01-10T05:46:12Z", "subject": "What can I do with my current coding knowledge?", "uid_a": "a_0"}], "i_edits": [], "id": "ixr3gmk8nl0577", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 3086, "num_favorites": 1, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654553494925, "tag_good": [], "tag_good_arr": [], "tags": ["cs", "student"], "type": "question", "unique_views": 442}