{"bookmarked": 5, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "ixxnvoshcrc49i", "type": "create", "uid_a": "a_0", "when": "2017-01-14T20:04:24Z"}, {"anon": "no", "data": "ixy24dzv86z39e", "to": "ixxnvosbplu49h", "type": "s_answer", "uid": "hktxrfgogof36c", "when": "2017-01-15T02:43:04Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2017-01-15T02:43:04Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "no", "content": "<p>Last semester was my last one at Berkeley, and I had study groups in almost every CS class I took. They are definitely very useful! For me, the best way to find study groups is to look for people that you recognize, have similar questions to you, and seem to have a good grasp on the material. I met a lot of study groups by just asking the person next to me in lab if they wanted to work together on the lab, and then eventually we just started working on homework. Office Hours are a good way to find people who work at a similar pace to you. In one class, I literally knew no one and I went up to one person and just told them I recognized them from a bunch of my classes and I wanted to find homework/study partners, and we ended up working together in various classes for 3 semesters. Don&#39;t underestimate the Search for Teammates post on Piazza as well!</p>\n<p></p>\n<p>In terms of how to structure the study groups, everyone works differently. Personally, I like talking through problems so I tried to find people that also liked to do that. Some people prefer reading them over first and then solving them as a group. Others want to solve them on their own and then go over them to discuss differences in answers etc. It&#39;s really up to you. You&#39;ll have to just try different methods out and see what works best for you. Good ways to review material would be going over discussion sheets/lecture slides, and doing past exam questions that relate to the current topic.</p>\n<p></p>\n<p>I&#39;ve become very very close with most of the people I&#39;ve been in study groups with. I still keep in contact with them and hang out with them outside of school. In my opinion, it&#39;s kind of inevitable. You&#39;ll eventually want a food break, or veer off topic, and by the end of the semester you get to know each other. I&#39;ve only really ever had 2-3 study groups, and that&#39;s because usually people tend to take the same classes. Study groups are almost like networking. All it takes is to meet one person. They probably know another person or two they study with, and they know more people, and so on. People will invite their other friends and you&#39;ll figure out who you work best with. Through meeting these people you&#39;ll find out who&#39;s taking what classes next semester, and you&#39;ll continue to get to know each other and become friends. And of course over time your study groups will expand and change as you develop your interests and take different classes and meet more people. I know it may sound intimidating, but people are really friendly so don&#39;t be afraid to ask someone you recognize to work together! </p>\n<p></p>\n<p>Everyone really has different study habits and study groups, so I&#39;m sure others will chime in with their experiences. I hope some of this was helpful!</p>", "created": "2017-01-15T02:43:04Z", "subject": "", "uid": "hktxrfgogof36c"}], "id": "ixy24dzpqeq39d", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "idgokwj3tu64tv", "name": "Zabin Aman Bashar", "photo": null, "photo_url": null, "published": true, "role": "", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "idq3w4no59zmi", "name": "Tesfahun Berhanu", "photo": "1537835368_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/idq3w4no59zmi/1537835368_35.png", "published": true, "role": "", "us": false}], "tag_endorse_arr": ["idgokwj3tu64tv", "idq3w4no59zmi"], "type": "s_answer"}], "config": {}, "created": "2017-01-14T20:04:24Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": {}, "folders": ["eecs", "cs", "other"], "history": [{"anon": "stud", "content": "<p>I am currently a freshman in EECS and was hoping to get some advice on how to find a good set of people to study with for classes. During high school, I mostly studied on my own, and found that whenever I studied with others, I would end up in a situation where I would receive or give answers but not really teach and better understand concepts. Now after seeing the technical classes at Berkeley, it seems nearly impossible to do well without a strong support network.</p>\n<p></p>\n<p>Can someone provide advice on:</p>\n<p><br />1) I would like to find a group of people who I can work on homework and projects with, review material with, and study for exams with. How do I find this group? Do people who have a good study group just ask people they find in class? Is there another effective way to find people?</p>\n<p><br />2) Going off of #1, how do I know who to ask to be my studying partners? I think a situation where people in the group are not much more or less knowledgable than me would be ideal, but how would I determine where people stand regards to their understanding just in a few days of lecture or discussion?</p>\n<p><br />3) What is a good method to organize study sessions? Do people work on homework individually and then meet up and discuss answers, or is better to work through the problem as a whole together? Also, what is a good way to review material, just to make sure we all have an understanding? I would like to better understand how to study as whole to do well on all aspects of the course, not just have homework buddies.</p>\n<p></p>\n<p>4) I don&#39;t know if this is asking for too much but ideally, I would love if I could be good friends with the people in my study group outside study time as well. In my past experience, I have found that whenever I study with someone I have a hard time talking about other non course related things. If I am friends with someone, I seem to get more distracted while studying. What is a good way to find this balance?</p>\n<p><br />5) It would be great if someone could generally talk about what their experience in study groups are - eg: what are the pros and cons ...</p>\n<p></p>\n<p></p>\n<p>Thanks!</p>", "created": "2017-01-14T20:04:24Z", "subject": "Advice on Finding Study Groups", "uid_a": "a_0"}], "i_edits": [], "id": "ixxnvosbplu49h", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 3162, "num_favorites": 1, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654553572258, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "hzt74ba6hds1qp", "name": "Robert Matych", "photo": "1455322321_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/hzt74ba6hds1qp/1455322321_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "idriks20rqg42v", "name": "Hrishi Dharam", "photo": "1544372913_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/idriks20rqg42v/1544372913_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "ipgjaeajatq1dy", "name": "Titlis Wan", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "i93p5fl0mpo6qw", "name": "Aditya Mishra", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "hzcyfybsitu4dc", "name": "Rachel Zoll", "photo": "1503595543_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/hzcyfybsitu4dc/1503595543_35.png", "published": true, "role": "student", "us": false}], "tag_good_arr": ["hzt74ba6hds1qp", "idriks20rqg42v", "ipgjaeajatq1dy", "i93p5fl0mpo6qw", "hzcyfybsitu4dc"], "tags": ["cs", "eecs", "other", "student"], "type": "question", "unique_views": 304}