{"bookmarked": 10, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "ixxobpxowqt4ge", "type": "create", "uid_a": "a_0", "when": "2017-01-14T20:16:52Z"}, {"anon": "stud", "data": "ixxrjqs1ph147", "to": "ixxobpxllo74gd", "type": "s_answer", "uid_a": "a_1", "when": "2017-01-14T21:47:05Z"}, {"anon": "no", "to": "ixxobpxllo74gd", "type": "followup", "uid": "hzd1mbl3gnm3vc", "when": "2017-01-16T01:20:00Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2017-01-14T21:47:05Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>Not an EECS or CS student, but I&#39;m currently in a research lab in my home department. I got my research position by emailing my (now) PI with my resumé and the reasons why I was interested in the field that he works on. The point of an undergrad joining a research lab is to learn, so it&#39;s okay if you don&#39;t already &#34;know it all&#34; - professors know this and I think that trying to paint yourself as someone who does already know it all (especially if you don&#39;t and it&#39;s obvious from your resumé) is overall detrimental to your application.</p>\n<p></p>\n<p>In general, professors take undergrads (especially the younger ones without many upper div classes) as a sort of &#34;investment&#34; - maybe you don&#39;t already know everything there is to know about AI/ML, but hopefully by working in their lab for one or two years, you can get up to speed about the topics and maybe even contribute something to the field, be it something big like a paper in IEEE or something small, like improving an algorithm&#39;s runtime (maybe not asymptotically, but at least decreasing a constant factor or something). In the lab, I work under a graduate student on his project, although that is because in the field I work in the PI does very little lab work, and rather spends most of his time writing grants and papers. Hope this helped!</p>", "created": "2017-01-14T21:47:05Z", "subject": "", "uid_a": "a_1"}], "id": "ixxrjqrwk4846", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": "100003496029521", "id": "hyw7jbf3qk2160", "name": "Luke Chen", "photo": null, "photo_url": null, "published": true, "role": "", "us": false}], "tag_endorse_arr": ["hyw7jbf3qk2160"], "type": "s_answer"}, {"anon": "no", "bucket_name": "Week 1/15 - 1/21", "bucket_order": 168, "children": [], "config": {}, "created": "2017-01-16T01:20:00Z", "data": {"embed_links": null}, "folders": [], "id": "ixzeledlqpj6om", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Second opinion here.  I agree with the points the student answerer raised and got my position in a similar way.  I was a sophomore when I joined the lab and had not yet taken all the relevant coursework.  (I work in an ML/AI lab and was taking, but had not completed, CS 189/EE 127 at the time.)  In terms of being accepted to a lab, it is *very* helpful to have a nontrivial personal project that you can point to as proof of your dedication/skill/experience/whatever.<br /><br />As to the why Professors take undergrads:</p>\n<ol><li>If professors required students to take many prerequisite courses before joining the lab, students wouldn&#39;t have enough time to develop relationships with the professor/grad student/post-doc they work with.</li><li>Even without understanding all the theory, you can still be useful if you&#39;re a good programmer.  Experiments must be run!  Also, you can take some time to learn theory related to your specific project after joining the lab.  This is more focused and efficient than taking a whole introductory class about the field.</li><li>The expectation (in my lab at least) is that undergrads begin working closely under a supervisor (typically a grad student or post-doc) and then gradually become more independent, possibly initiating their own projects. It takes time for the student to develop knowledge of the field and a sense for what problems are open and manageable.</li><li>With the advent of <a href=\"https://arxiv.org/\" target=\"_blank\">the arXiv</a>, it&#39;s possible for motivated students to read the latest papers and gain background by themselves, outside of class.</li></ol>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "hzd1mbl3gnm3vc", "updated": "2017-01-16T01:20:00Z"}], "config": {}, "created": "2017-01-14T20:16:52Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": {}, "folders": ["other", "eecs", "cs", "faculty_advising"], "history": [{"anon": "stud", "content": "<p>What are the steps required to get be mentored by an EECS professor for research projects? What level of experience are professors looking for? For example, if I want to be mentored by a professor for a machine learning project, is it enough if I can implement models using libraries or do I need to completely understand the theory behind it?</p>\n<p></p>\n<p>In general, why do professors take undergrads under them, especially if the undergrads are freshmen or sophomores without many upper div classes? Do undergrads work on a subproject under the professor or are they expected to come in with their own idea? What other qualities do they look for in students and what can I do to show those qualities?</p>\n<p></p>\n<p>It would also be great if undergrads currently doing research could provide some of their experiences in labs (what work do you do/how did you get to that position).</p>\n<p></p>\n<p>Thanks!</p>", "created": "2017-01-14T20:16:52Z", "subject": "Being Mentored by Professors for Research Projects", "uid_a": "a_0"}], "i_edits": [], "id": "ixxobpxllo74gd", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 3163, "num_favorites": 5, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654553573398, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "idriks20rqg42v", "name": "Hrishi Dharam", "photo": "1544372913_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/idriks20rqg42v/1544372913_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "class_sections": ["classof2019_hyq0br1u3kx7dg"], "endorser": {}, "facebook_id": null, "id": "icguxwqmsgc1ic", "name": "Sirej Dua", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"ij5ddqc0arp6r4": 1, "j6fe5friemd22w": 1}, "facebook_id": null, "id": "id1up5lrn3o215", "name": "Alvin Hsu", "photo": null, "photo_url": null, "role": "student", "us": false}], "tag_good_arr": ["idriks20rqg42v", "icguxwqmsgc1ic", "id1up5lrn3o215"], "tags": ["cs", "eecs", "faculty_advising", "other", "student"], "type": "question", "unique_views": 467}