{"bookmarked": 8, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "j0imapxmje81e6", "type": "create", "uid_a": "a_0", "when": "2017-03-20T21:22:40Z"}, {"anon": "no", "data": "j0in0gjzxw96o8", "to": "j0imapxjvcp1e5", "type": "i_answer", "uid": "hyq0c18svsu7ek", "when": "2017-03-20T21:42:41Z"}, {"anon": "no", "data": "j0inwuvytud64u", "type": "i_answer_update", "uid": "gxj8rtteeuaa9", "when": "2017-03-20T22:07:53Z"}, {"anon": "stud", "data": "j0ioxk4270f4ri", "to": "j0imapxjvcp1e5", "type": "s_answer", "uid_a": "a_1", "when": "2017-03-20T22:36:25Z"}, {"anon": "stud", "to": "j0imapxjvcp1e5", "type": "followup", "uid_a": "a_0", "when": "2017-03-20T22:53:29Z"}, {"anon": "no", "to": "j0imapxjvcp1e5", "type": "feedback", "uid": "gxj8rtteeuaa9", "when": "2017-03-21T02:24:19Z"}, {"anon": "no", "to": "j0imapxjvcp1e5", "type": "feedback", "uid": "gro4nnkuub", "when": "2017-03-21T18:40:16Z"}, {"anon": "stud", "data": "j0kei6vbb3e563", "type": "s_answer_update", "uid_a": "a_2", "when": "2017-03-22T03:20:04Z"}, {"anon": "stud", "data": "j0kf47fqu5g3ep", "type": "s_answer_update", "uid_a": "a_2", "when": "2017-03-22T03:37:11Z"}, {"anon": "stud", "data": "j0kf4ty9yyr5tk", "type": "s_answer_update", "uid_a": "a_2", "when": "2017-03-22T03:37:41Z"}, {"anon": "stud", "to": "j0imapxjvcp1e5", "type": "feedback", "uid_a": "a_3", "when": "2017-03-22T04:37:02Z"}, {"anon": "no", "to": "j0imapxjvcp1e5", "type": "feedback", "uid": "gro4nnkuub", "when": "2017-03-22T05:12:00Z"}, {"anon": "stud", "to": "j0imapxjvcp1e5", "type": "feedback", "uid_a": "a_3", "when": "2017-03-22T05:41:40Z"}, {"anon": "stud", "to": "j0imapxjvcp1e5", "type": "feedback", "uid_a": "a_3", "when": "2017-03-22T05:53:24Z"}, {"anon": "no", "to": "j0imapxjvcp1e5", "type": "feedback", "uid": "gxj8rtteeuaa9", "when": "2017-03-22T06:45:24Z"}, {"anon": "no", "to": "j0imapxjvcp1e5", "type": "feedback", "uid": "gro4nnkuub", "when": "2017-03-22T07:10:30Z"}, {"anon": "no", "to": "j0imapxjvcp1e5", "type": "feedback", "uid": "gro4nnkuub", "when": "2017-03-22T07:18:59Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2017-03-20T21:42:41Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "no", "content": "<p><strong attention=\"gxj8rtteeuaa9\">&#64;Anant Sahai</strong>  <strong attention=\"gro4nnkuub\">&#64;Elad Alon</strong>  </p>\n<p></p>\n<p>Anant Sahai:</p>\n<p></p>\n<p>Hi, I will write a more detailed answer later but first will say that I encourage you to come and talk to me to understand this better. 16AB were designed to be fundamental to the needs of all of our students in preparation for a 40-year career going forward, and L&amp;S CS students in particular. We in the faculty have a bit more experience than you do about both how fields are evolving intellectually as well as just how much things can change with time. As a student, you don&#39;t really understand the bigger picture, especially the scope of change and the need for a robust development of different ways of thinking. Which is to be expected --- otherwise, you wouldn&#39;t need the university and could just go and read books and do projects on your own to learn. The answer so far (I have to go to a meeting) is basically of the &#34;trust us&#34; variety, and there is a strong case that such trust is actually fundamental to the student/teacher relationship. Everything we say will always have a dimension of &#34;trust us&#34; to it, because you do not understand or appreciate what you cannot yet fathom. In the words of Donald Rumsfeld, it&#39;s the unknown unknowns that get you.  One of our goals is to make you more ready for them.</p>\n<p></p>\n<p></p>\n<p></p>\n<p></p>\n<p></p>\n<p></p>", "created": "2017-03-20T22:07:53Z", "subject": "", "uid": "gxj8rtteeuaa9"}, {"anon": "no", "content": "<p><strong attention=\"gxj8rtteeuaa9\">&#64;Anant Sahai</strong>  <strong attention=\"gro4nnkuub\">&#64;Elad Alon</strong>  </p>", "created": "2017-03-20T21:42:41Z", "subject": "", "uid": "hyq0c18svsu7ek"}], "id": "j0in0gjr82v6o7", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "idtiecbnamq7ff", "name": "Snaheth Thumathy", "photo": "1446078660_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/idtiecbnamq7ff/1446078660_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"idsclwixj9j35z": 1}, "facebook_id": null, "id": "hzd1mbl3gnm3vc", "name": "Garrett Thomas", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"jcfmstjtpxz2bp": 1523048468}, "facebook_id": null, "id": "is6p6lzfa695i6", "name": "Will Wang", "photo": "1569220944_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/is6p6lzfa695i6/1569220944_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "class_sections": ["classof2019_hyq0br1u3kx7dg"], "endorser": {}, "facebook_id": null, "id": "ib2kjvzzgc61w2", "name": "Jessie Yang", "photo": "1473565160_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/ib2kjvzzgc61w2/1473565160_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "iscem14kbsu5vi", "name": "Keerthi Bhattaram", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jwb0nj3ghba30f", "name": "Rithvik Chuppala", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["idtiecbnamq7ff", "hzd1mbl3gnm3vc", "is6p6lzfa695i6", "ib2kjvzzgc61w2", "iscem14kbsu5vi", "jwb0nj3ghba30f"], "type": "i_answer"}, {"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2017-03-20T22:36:25Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>If I were to follow your logic, I would argue that R&amp;C/Breadth/HSS/AC requirements should be entirely removed from all science and engineering majors as those would have no impact nor benefit on the career of a computer scientist/engineer.</p>\n<p></p>\n<p></p>\n<p>____________________________</p>\n<p></p>\n<p>Your issue is you&#39;re looking at 16AB as a circuits course, which while it teaches circuits it teaches skills more important than that, and ones that are relevant to a completely software based curriculum. Professor Sahai has listed most of them, but there are others. And in my personal experience, I got my first internship -- which was in software engineering - based on skills I learned largely in the 16 series, not just in 61A/B.</p>", "created": "2017-03-22T03:37:41Z", "subject": "", "uid_a": "a_2"}, {"anon": "stud", "content": "<p>If I were to follow your logic, I would argue that R&amp;C/Breadth/HSS/AC requirements should be entirely removed from all science and engineering majors as those would have no impact nor benefit on the career of a computer scientist/engineer.</p>\n<p></p>\n<p></p>\n<p>____________________________</p>\n<p></p>\n<p>Your issue is you&#39;re looking at 16AB as a circuits course, which while it teaches circuits it teaches skills more important than that, and ones that are relevant to a completely software based curriculum. Professor Sahai has listed most of them, but there are others. And in my personal experience, I got my first internship -- which was in software engineering - based on skills I learned largely in the 16 series, not in 61A/B.</p>", "created": "2017-03-22T03:37:11Z", "subject": "", "uid_a": "a_2"}, {"anon": "stud", "content": "<p>If I were to follow your logic, I would argue that R&amp;C/Breadth/HSS/AC requirements should be entirely removed from all science and engineering majors as those would have no impact nor benefit on the career of a computer scientist/engineer.</p>\n<p></p>\n<p></p>\n<p>____________________________</p>\n<p></p>\n<p>Your issue is you&#39;re looking at 16AB as a circuits course, which while it teaches circuits it teaches skills more important than that, and ones that are relevant to a completely software based curriculum</p>", "created": "2017-03-22T03:20:04Z", "subject": "", "uid_a": "a_2"}, {"anon": "stud", "content": "<p>If I were to follow your logic, I would argue that R&amp;C/Breadth/HSS/AC requirements should be entirely removed from all science and engineering majors as those would have no impact nor benefit on the career of a computer scientist/engineer.</p>", "created": "2017-03-20T22:36:25Z", "subject": "", "uid_a": "a_1"}], "id": "j0ioxk40vv24rh", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}, {"anon": "stud", "bucket_name": "Week 3/19 - 3/25", "bucket_order": 157, "children": [{"anon": "no", "bucket_name": "Week 3/19 - 3/25", "bucket_order": 157, "children": [], "config": {}, "created": "2017-03-21T02:24:19Z", "data": {"embed_links": null}, "folders": [], "id": "j0ix2myr5pg2wa", "subject": "<p>Very coarsely speaking, there are three major ways that information is processed and information processing is itself understood, and their relative importance changes with time and application. </p>\n<p></p>\n<p>1) Procedure-orientation: this is the standard Turing/Von-Neumann &#34;computation&#34; approach that is represented by most programming languages used today. </p>\n<p></p>\n<p>2) Circuit-orientation: this is what is behind the operation of neural networks as well as analog circuitry. </p>\n<p></p>\n<p>3) Optimization-orientation: these are where minimalist principles and constraints are important. Many databases also fall into this category.</p>\n<p></p>\n<p>It is absolutely vital for a CS student to know and be comfortable with reasoning about all three modes. The 61ABC series is heavily weighted towards (1) with a little bit of (3) mixed in during 61A.  16AB bring more of (2) and (3) into the mix, and it is vital that this happen as early as possible in students&#39; development so that their mental muscles are more balanced in their development. This is why we absolutely urge 16AB to be taken by freshmen. </p>\n<p></p>\n<p>Within (2), there are many aspects to analog information processing. In 16A you see a little bit as well as how it connects via constraints to optimization-oriented thinking. However, in 16B the dynamic aspects also come into play. While today&#39;s deep neural networks tend to use circuits for information processing (circuits emulated by programs running SIMD cores for now, but more specialized cores in the future) in a way that doesn&#39;t involve time, there is every indication that biological neural networks do indeed invoke time dynamics in nontrivial ways. So it would be absolutely irresponsible of us to not give students some inclination of time-dynamic behavior of circuits as a part of their foundational training for a 40 year career. This is why the department wants everyone taking 16A and 16B.</p>\n<p></p>\n<p>Fundamentally, EECS has two pillars: information and computation. All students need grounding in both even if they may choose to specialize in one more than the other. But they need to start with mental balance to the extent possible so that they don&#39;t misunderstand informational issues as being computational nor vice-versa. You&#39;re going to have to learn and adapt. It&#39;s our job to give you the foundation so that you can do so.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "gxj8rtteeuaa9", "updated": "2017-03-21T02:24:19Z"}, {"anon": "no", "bucket_name": "Week 3/19 - 3/25", "bucket_order": 157, "children": [], "config": {}, "created": "2017-03-21T18:40:16Z", "data": {"embed_links": null}, "folders": [], "id": "j0jvxqa38uo583", "subject": "I think that Anant largely hit the points that I would have made, but I&#39;d like to also offer to speak with anyone in person about why I believe the material in EE16A and EE16B are indeed fundamental to your education as a CS student.<div><br /></div><div>To follow up on one specific aspect that Anant hinted at however, if you look at where the major innovations/advancements have happened in the last decade (starting arbitrarily from e.g. the iPhons), almost all of them have involved optimization and co-design among multiple levels of the system stack (from applications and algorithms all the way down to the circuits and devices).  Even if you end up as a purely &#34;software&#34; engineer, our goal at Berkeley is to try train you to be one of the ninjas who has at least a basic understanding of how issues at layers both above and below where you work can not only influence what you are doing, but provide opportunities for optimization of the system as a whole.</div><div><br /></div><div>Another point I&#39;d like to make is that many of the skills you exercise in circuit design are actually essentially identical to skills you would exercise in software or system design as a whole (as well in linear algebra).  I can dive in to the details if you&#39;d like, but debugging, modularity, modeling, and using structured methods to do design and even analysis are all common across the board.  As a final note, there are actually many mathematical concepts underlying circuits, and gaining intuition about those same concepts but with physical quantities you may not be as familiar with is a great way to make sure you really understand the math.</div><p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "gro4nnkuub", "updated": "2017-03-21T18:40:16Z"}, {"anon": "stud", "bucket_name": "Week 3/19 - 3/25", "bucket_order": 157, "children": [], "config": {}, "created": "2017-03-22T04:37:02Z", "data": {"embed_links": null}, "folders": [], "id": "j0kh95zaigcoj", "subject": "<p>In my honest opinion, I agree with Sahai about EE 16B being a vital introduction to electrical engineering, but from what I know, EE 16A just doesn&#39;t have the same quality, and seems more like a mishmash of linear algebra (which is mostly covered in Math 54), and circuitry (which is already somewhat, if not mostly, covered in Physics 7B). I propose the following as an alternative setup:</p>\n<p></p>\n<p>Introducing a CS 70-Math 55 (as in &#34;Linear Algebra with Emphasis in Theory and Applications in Computation&#34;) analogue for Math 54, carrying over all the properties of the relationship between CS 70 and Math 55 (e.g. acceptability for Math/CS double major, major requirement for CS and EECS, etc.),</p>\n<p></p>\n<p>replacing the Physics 7B major requirement for EECS with a new &#34;Electromagnetism and its Applications for Computation&#34; class required for both L&amp;S and EECS graduation, which will in teach op-amps and the remainder of circuitry in 16A not already covered in lieu of most (or all) of the thermodynamics unit,</p>\n<p></p>\n<p>phasing out EE 16A,</p>\n<p></p>\n<p>and keeping EE 16B as is.<br /><br />In this scenario, the unit requirement for EECS students will drop, and that of L&amp;S CS students will stay the same (as they are not required to take Physics currently, resulting in the new E&amp;M class replacing the units vacated by 16A).</p>\n<p></p>\n<p>The only drawback I see in this arrangement is the possible slight increase in faculty for the [EE]CS department, but I think the benefit of reducing and/or streamlining the courseload would outweigh this cost.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2017-03-22T04:37:02Z"}, {"anon": "no", "bucket_name": "Week 3/19 - 3/25", "bucket_order": 157, "children": [], "config": {}, "created": "2017-03-22T05:12:00Z", "data": {"embed_links": null}, "folders": [], "id": "j0kii4tgudy5wi", "subject": "I do appreciate your concrete suggestion and for starting a constructive dialog - I hope that my following comments/discussion will be read in that spirit as well.  <div><br /></div><div>I have to admit that I&#39;m somewhat puzzled by your comments regarding the content/structure of 16A (especially relative to the recent offerings), but it&#39;s probably not worth dwelling on that.  More importantly, there are a number of additional (in my opinion substabtial) issues with your proposal, one of the most important of which (again, in my opinion) is that this approach will explicitly de-emphasize that designing efficient systems involves optimizing (and hence understanding) across multiple (all) layers of hierarchy simultaneously, and that often times, things you do at one level can make your life dramatically simpler (or harder) at the others.  The silo&#39;ed approach you are proposing is exactly what I have seen over and over in my career (both in academic and industrial contexts) lead people down highly sub-optimal approaches to solving the problems that faced them.  For almost all intents and purposes, this would go back to the 20/40 model we had before (although granted it would be a very different version of 20), which was very clearly not working (both overall and specifically in highlighting the above).<div><br /></div><div>As I tried to describe in my response above, learning about how to design circuits - and especially the way we present that in 16 - is really not some fundamentally different beast than learning how to apply mathematical techniques to solve problems in other domains (such as machine learning, robotics, medical systems, ...).  Making this intellectual link clear throughout all of the modules (in 16A and 16B) is something we are constantly striving to improve, but splitting the content up (as you proposed) in to separate courses certainly won&#39;t help with this.</div><div><br /></div><div>Also, as a fully practical matter, 16B (which follows the same integrated approach described in the first paragraph) really wouldn&#39;t work in the general case for the target audience without the build-up and introduction (both in terms of content as well as way of thinking) from 16A.  While we are allowing L&amp;S students moving forward (for now) to fullfil their requirements with Math 54 and 16B (mostly for reasons that I hope will be transient, as I&#39;ll explain below), that is not the path we recommend by any means, and is not something that would work in general without the existence of 16A.</div><div><br /></div><div>To clarify the above and address an indirect point I believe you are raising, we are currently in discussions with both Math and Statistics about getting them to accept the combination of 16A&#43;B as replacements for Math 54 (both in terms of course prereqs as well as for their majors).  This is by no means a done deal and we can&#39;t yet make any guarantees, but my hope is that this will address some of the practical issues that are driving some students to delay taking 16 (which again, I definitely don&#39;t recommend).</div></div><p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "gro4nnkuub", "updated": "2017-03-22T05:12:00Z"}, {"anon": "stud", "bucket_name": "Week 3/19 - 3/25", "bucket_order": 157, "children": [], "config": {}, "created": "2017-03-22T05:41:40Z", "data": {"embed_links": null}, "folders": [], "id": "j0kjkajxiuw3tv", "subject": "<p>So to clarify, you believe it is absolutely important and necessary to include Linear Algebra in any incarnation of an introductory EE course?</p>\n<p></p>\n<p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2017-03-22T05:41:40Z"}, {"anon": "stud", "bucket_name": "Week 3/19 - 3/25", "bucket_order": 157, "children": [], "config": {}, "created": "2017-03-22T05:53:24Z", "data": {"embed_links": null}, "folders": [], "id": "j0kjzd7g8fy45j", "subject": "<p>Also, to discuss your middle two paragraphs, I believe it is possible to teach circuitry in your integrated fashion while still including (at least basic) material on electric and magnetic fields and forces as taught in Physics 7B. In fact, I think this will extend the integration to one more level, in the sense of understanding how the different electrical components work under the hood (in terms of how they move electrons and affect electromagnetic fields).</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2017-03-22T05:53:24Z"}, {"anon": "no", "bucket_name": "Week 3/19 - 3/25", "bucket_order": 157, "children": [], "config": {}, "created": "2017-03-22T06:45:24Z", "data": {"embed_links": null}, "folders": [], "id": "j0klu97iwvt75r", "subject": "<p>Please come and talk with me about any concerns that you have about 16A. It is meant to be taken by freshmen in their first semester in parallel with 61A. That is firmly the intended audience and recommended scheduling by students, and the course is designed for that. Clearing the backlog of students during the transition who have not taken it as freshmen creates some degrees of mismatch here and there, but it is our goal that even those students should get a lot out of taking 16A. (I&#39;ll be honest, when I taught it, both me and my TAs got a lot out of it. And we all supposedly know all this stuff perfectly by comparison --- so it should reward contemplation for pretty much everyone.) </p>\n<p></p>\n<p>Our goals for 16A are to asymptotically achieve perfection in the course --- and this means that we welcome any and all bug reports. Send me an email. The goal is that the course should be fundamentally inclusive and that every single concept taught in the course should be clear, integrated, and obviously relevant. Just like students, we Profs will fall short of the high goals that we set for ourselves, but that doesn&#39;t mean that we stop trying. :-)</p>\n<p></p>\n<p>In terms of linear algebra, yes, we believe that linear algebra is absolutely fundamental to EECS and that students need to learn *why* things are defined the way they are and to really understand the connections between these fundamental concepts. This isn&#39;t about symbol pushing or some calculating tricks. </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "gxj8rtteeuaa9", "updated": "2017-03-22T06:45:24Z"}, {"anon": "no", "bucket_name": "Week 3/19 - 3/25", "bucket_order": 157, "children": [], "config": {}, "created": "2017-03-22T07:10:30Z", "data": {"embed_links": null}, "folders": [], "id": "j0kmqj0h2x219z", "subject": "Responding to both of your follow-ups here, approximately in order, although in many ways your questions/comments are related.  <div><br /></div><div>Would I argue that any possible introduction to EE must by definition include linear algebra?  No, certainly not - this wasn&#39;t the way I learned things originally, and this isn&#39;t how things are taught in most other schools (at least not yet).  That&#39;s a pretty weak criteria though - as a student, I distinctly remember wondering to myself why in the world I was learning the things that I was (especially in my intro circuits class, but even well after that), and I perservered despite that.</div><div><br /></div><div>This leads to one of the main reasons I would however argue that including linear algebra in an intro EE(CS) class is absolutely important - and perhaps even almost necessary.  Including linear algebra allows us to show with relatively little prior background just how powerful the tools and techniques that underly modern EE (and CS) really are in enabling real-world applications that students (particularly freshman) will not only recognize, but have a visceral feeling about/interest in.  I really can&#39;t take the credit for that particular realization BTW - it was really much more the product of Gireeja Ranade&#39;s and Anant&#39;s thinking than my own (at the time) - but having now worked this through (along with the two of them and many others), linear algebra really is the one conceptual area I can think of that finds substantial importance and use across pretty much the entire spectrum of EE endeavors (including the more physicsy side, as you mentioned).  As already mentioned, it is also something that can be taught to students coming out of high school (of course with appropriate math maturity) while simultaneously exposing them to the application (and hence making them feel &#34;empowered&#34;).  </div><div><br /></div><div>I certainly agree with you that an integrated approach to teaching physics 7B like material would be extremely worthwhile as well.  Physics 7B itself however requires more math background than what can be expected from incoming freshman, and so this is one of the reasons why we made the choice to partition things the way we did.  (Another reason for this is that for better or for worse, in general, students entering from high school tend to have less background in or opportunities to learn physics than they do math.) </div><div><br /></div><div>I&#39;m now dipping into a much more highly speculative topic, but to follow up a bit further on your point about an integrated approach to Physics 7B, there have actually been some discussions amongst the faculty about creating a &#34;16C&#34; (naming along with everything else TBD) that could serve as an alternative option for Physics 7B.  This (currently hypothetical) course would more directly expose students to the applications/motivations for the 7B material, as well as more generally the &#34;physicy&#34; side of EECS.  This class could then also leverage the linear algebra (as well as of course circuits and basic sensor ideas) from 16A/B.  In case it wasn&#39;t obvious from how I started this paragraph, it isn&#39;t at all yet clear when or even if this will happen - the discussions are still highly preliminary.  Based on my experience from 16A/B, standing up a course like this will take (tens of) thousands of hours of work, and so it&#39;s not a task that anyone will be taking on lightly.  I do believe it&#39;s an exciting possibility however, and am doing what I can to help support this eventually happening (but again, absolutely no guarantees at all at this time).</div><div><br /></div><div><div><br /></div><div><br /></div></div>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "gro4nnkuub", "updated": "2017-03-22T07:10:30Z"}, {"anon": "no", "bucket_name": "Week 3/19 - 3/25", "bucket_order": 157, "children": [], "config": {}, "created": "2017-03-22T07:18:59Z", "data": {"embed_links": null}, "folders": [], "id": "j0kn1fpkd3n38i", "subject": "I guess that Anant&#39;s and my responses crossed each other, but fortunately, (I think :) we emphasized the same fundamental idea (about the importance of linear algebra) while covering some other orthogonal points.  Just to re-emphasize though, I have no doubt that there are things that can be improved in both 16A and 16B, so I&#39;d like to make the same offer as Anant did.  If something doesn&#39;t seem to be working in either of those classes, please feel free to email me as well - a huge amount of thinking and work has gone in to these courses, but that doesn&#39;t mean that there aren&#39;t still improvements to be made.  Constructive feedback is hence always highly welcomed.<p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "gro4nnkuub", "updated": "2017-03-22T07:18:59Z"}], "config": {}, "created": "2017-03-20T22:53:29Z", "data": {"embed_links": null}, "folders": [], "id": "j0ipji7eoxd34f", "no_answer": 0, "no_upvotes": 0, "subject": "<p>OP here. I disagree with the first student response. Breadths make sense because all L&amp;S majors are fundamentally part of a liberal arts school, which stresses a fundamental understanding of a variety of subjects that don&#39;t relate to our traditional technical curriculum. So that requirement makes sense because that&#39;s the fundamental teaching philosophy behind the entire school; this is why breadths reqs. vary between schools. On the other hand, EE 16a is a major requirement, which means it should (in principle) relate to our specific technical curriculum.</p>\n<p></p>\n<p>Prof. Sahai: I appreciate your quick response! I&#39;d love to hear your more detailed answer and maybe follow up in person if necessary, but I just want to point out that my post doesn&#39;t come from a point of conceit but rather from a point of relative frustration. That is, I agree entirely that professors would have a much more thorough understanding of the fields and understand what is and isn&#39;t useful to teach us, but often times it may be frustrating from a student&#39;s perspective if we&#39;re told to learn something that seems tangential to everything else we learn when we don&#39;t have an understanding of the bigger picture in mind. I especially see this a lot with 16A since there are many CS majors (myself included) who find it frustrating that we have to learn about circuits. Maybe some of your detailed perspectives on this issue may resolve our concerns! Looking forward to hearing your response.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_0", "updated": "2017-03-20T22:53:29Z"}], "config": {}, "created": "2017-03-20T21:22:40Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["cs", "16a"], "history": [{"anon": "stud", "content": "<p>Why do L&amp;S CS majors have to take EE16A?</p>\n<p></p>\n<p>I&#39;m currently enrolled in this class and I see little use for 2/3 of this class (i.e. anything outside of linear algebra) for a majority of L&amp;S CS majors who will most likely not deal with circuits in their futures.</p>\n<p></p>\n<p>I have heard the following opinions on why this is the case and provided a series of counter points to them:</p>\n<p></p>\n<p>1) EE16A and EE 16B prepare students for other CS courses, specifically CS 70</p>\n<p>A broad majority of L&amp;S CS majors don&#39;t end up taking EE 16A nor EE 16B before they are able to declare, since it would be useless to most of them if they weren&#39;t able to get into the major. Therefore, since CS 70 is part of our declaration requirement, we anyways end up taking it before EE 16A and EE 16B, which makes it useless. In regards to prepping us for other courses, a majority of CS upper division courses either don&#39;t require any knowledge of circuits or require a knowledge of circuits that runs tangential to the course material. This can be seen from the fact that 16a and 16b are very sparsely, if at all, listed as prerequisites to any CS upper division course.</p>\n<p></p>\n<p>2) A basic amount of knowledge of circuits is essential to a proper CS education.</p>\n<p>I disagree with this entirely. There definitely do exist fields within CS for which a knowledge of circuits would be useful but there also exists numerous fields in CS (esp. with industrial application) that require absolutely no knowledge of circuits. And if this is the case, it seems that imposing a requirement that ALL students must know a basic amount of knowledge on circuits would be unfair to those who have no need to use it in the future. This is the same point that I would make as to why CS 170 and CS 162 are not required for all CS majors, even though they are extremely useful in a large proportion of fields within CS.</p>\n<p></p>\n<p>3) EE 16A gives students a better understanding of linear algebra that Math 54 that would be essential for CS majors when taking classes in the future</p>\n<p>If this is a concern, students should be offered the option of taking Math 54 &#43; Math 110 instead of Math 54 &#43; EE 16A since Math 110 also imposes a higher understanding of linear algebra.</p>\n<p></p>\n<p>I argue that EE 16A should either be entirely removed as a L&amp;S CS major requirement or, as mentioned in my last point, should be replaced/substitutable with Math 110.</p>\n<p></p>\n<p>I would love to hear any followup discussions regarding this topic; my goal in posting this is to spark a discussion on why exactly we have this requirement for L&amp;S CS majors and hopefully either get it removed for future L&amp;S CS majors or hear a solid explanation as to why EE 16A needs to be a requirement for all L&amp;S CS majors as opposed to an optional class that L&amp;S CS majors could take if their academic interests align with material taught in the class.</p>", "created": "2017-03-20T21:22:40Z", "subject": "Questioning the EE 16A Requirement for L&amp;S CS", "uid_a": "a_0"}], "i_edits": [], "id": "j0imapxjvcp1e5", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 3587, "num_favorites": 3, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654552731321, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "hz5sgc1hkxr6q", "name": "Christopher Lin", "photo": "1473543055_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/hz5sgc1hkxr6q/1473543055_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "idriks20rqg42v", "name": "Hrishi Dharam", "photo": "1544372913_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/idriks20rqg42v/1544372913_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "ijkkx5hy8c94h3", "name": "Ian McDonald", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "hktxrim2drk3da", "name": "Rohan Mathuria", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "idrinkfj99i10b", "name": "Nikhil Patel", "photo": "1503789172_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/idrinkfj99i10b/1503789172_35.png", "published": true, "role": "", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "hqq77vlnchw2i7", "name": "Brian Kim", "photo": null, "photo_url": null, "published": true, "role": "", "us": false}, {"admin": false, "endorser": {"ipkfex1ne3p56y": 1}, "facebook_id": null, "id": "ipkfr1orr6d1qj", "name": "Thanatcha Panpairoj", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["hz5sgc1hkxr6q", "idriks20rqg42v", "ijkkx5hy8c94h3", "hktxrim2drk3da", "idrinkfj99i10b", "hqq77vlnchw2i7", "ipkfr1orr6d1qj"], "tags": ["16a", "cs", "student"], "type": "question", "unique_views": 773}