{"bookmarked": 13, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "j1q4qr93pa86r3", "type": "create", "uid_a": "a_0", "when": "2017-04-20T08:13:07Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "followup", "uid_a": "a_1", "when": "2017-04-20T19:29:19Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "followup", "uid_a": "a_2", "when": "2017-04-20T19:51:10Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "feedback", "uid_a": "a_3", "when": "2017-04-20T21:30:33Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "feedback", "uid_a": "a_0", "when": "2017-04-20T21:49:03Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "feedback", "uid_a": "a_1", "when": "2017-04-20T22:06:27Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "feedback", "uid_a": "a_4", "when": "2017-04-20T22:13:44Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "feedback", "uid_a": "a_1", "when": "2017-04-20T22:17:23Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "feedback", "uid_a": "a_4", "when": "2017-04-20T22:42:44Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "feedback", "uid_a": "a_5", "when": "2017-04-22T04:03:55Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "feedback", "uid_a": "a_6", "when": "2017-04-22T20:50:11Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "feedback", "uid_a": "a_1", "when": "2017-04-22T22:03:21Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "feedback", "uid_a": "a_4", "when": "2017-04-22T22:26:27Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "feedback", "uid_a": "a_1", "when": "2017-04-23T00:16:38Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "feedback", "uid_a": "a_4", "when": "2017-04-23T02:27:17Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "feedback", "uid_a": "a_6", "when": "2017-04-23T04:09:13Z"}, {"anon": "stud", "to": "j1q4qr909mb6r2", "type": "feedback", "uid_a": "a_1", "when": "2017-04-23T04:15:08Z"}], "children": [{"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [{"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [], "config": {}, "created": "2017-04-20T21:49:03Z", "data": {"embed_links": null}, "folders": [], "id": "j1qxw23ucag3pm", "subject": "<p>OP here - thank you for your thoughts. I have to disagree that our CS program is prestigious due to our low admit rate. Berkeley admits 17% of applicants each year, which is far higher than any Ivy League school or Caltech/Stanford/MIT.</p>\n<p></p>\n<p>Yet Berkeley is said to be better at CS than all but two of those schools. In fact, the only reason people think these other schools are more prestigious than Berkeley is because they have lower acceptance rates. If Berkeley cut its admit rate one year, Berkeley wouldn&#39;t be a safety school to top achievers - it would be the goal. </p>\n<p></p>\n<p>I think Berkeley is so highly ranked due to our accomplishments. You can&#39;t deny what this school has accomplished. We&#39;ve made major advances in every field. And that overrides our high acceptance rate to make us a top school.</p>\n<p></p>\n<p>By the way, I&#39;m not saying Berkeley should cut its acceptance rate to boost its prestige. It would work, but it&#39;s contrary to our goals as a public school. I&#39;m saying that admit rate does affect prestige - people will always be impressed more by what they can&#39;t have.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_0", "updated": "2017-04-20T21:49:03Z"}, {"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [], "config": {}, "created": "2017-04-20T22:06:27Z", "data": {"embed_links": null}, "folders": [], "id": "j1qyifk4r8p58s", "subject": "<p>Berkeley still has low admission rates compared to all or almost all the other UCs. Not to mention that it has low admission rates compared to other schools around the country. So Cal and many of the Ivy Leagues and UCLA, Stanford, and CalTech are also said to have good CS programs -- and they all have low admission rates. It seems that almost every school that has a &#34;good CS program&#34; has a low admission rate. No? So for the most part, I&#39;d say that schools with a &#34;good CS program&#34; admit only the top students.</p>\n<p></p>\n<p>Still, I&#39;m wondering: What do Berkeley&#39;s achievements in CS have to do with the quality of the CS program? Achievements don&#39;t give any information about how well students learn CS, right? What does it mean for a program to &#34;good&#34;? I know magazines and news outlets like to come out with their rankings every year--but are they really legit? Do they really know which school is better? </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_1", "updated": "2017-04-20T22:06:27Z"}, {"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [], "config": {}, "created": "2017-04-20T22:13:44Z", "data": {"embed_links": null}, "folders": [], "id": "j1qyrsxcrrb1gl", "subject": "<p>&#64;OP Remember that Berkeley EECS and CS have much lower admit rates than Berkeley as a whole. <br /><br />Berkeley undergraduate academics are pretty highly regarded. Some CS courses in other universities are based off courses developed here.<br /><br />Also, remember when the internet was really mad that we took down our lecture casts? Classes are Berkeley are generally regarded to be of high quality, since we attract the best instructors. </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_4", "updated": "2017-04-20T22:13:44Z"}, {"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [], "config": {}, "created": "2017-04-20T22:17:23Z", "data": {"embed_links": null}, "folders": [], "id": "j1qywhgpk3nh5", "subject": "<p>^ Do we attract the best instructors or researchers? Our professors aren&#39;t always good instructors even though they are great researchers. Does Berkeley make a greater effort than other universities in hiring professors who not only research well but also know how to teach?</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_1", "updated": "2017-04-20T22:17:23Z"}, {"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [], "config": {}, "created": "2017-04-20T22:42:44Z", "data": {"embed_links": null}, "folders": [], "id": "j1qzt3cp6wl5gc", "subject": "<p></p><p dir=\"ltr\">Yes, I believe so. Consider Professors Denero, Hug, Ayazifar. Personally, I have not had a course with a &#34;bad&#34; professor. Sure, difficult professors, but never outright bad.</p>\n<p><br />I also believe that there is a connection between mastery of material and the ability to teach it. Undoubtedly, many of the professors here are at the top of their fields, and this could only have a positive effect on their teaching,</p>\n<p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_4", "updated": "2017-04-20T22:42:44Z"}, {"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [], "config": {}, "created": "2017-04-22T04:03:55Z", "data": {"embed_links": null}, "folders": [], "id": "j1sqpzmvcn1dt", "subject": "<p>While it&#39;s true that Berkeley overall has a %17 acceptance rate, if you look at the engineering admit rate for meche or eecs (6-8% based on calanswers), it&#39;s lower than a majority of the ivy leagues and whatever you define as prestigious.</p>\n<p></p>\n<p>Prestige, by the way, is overrated.</p>\n<p></p>\n<p>When people say their college is nth-ranked in the United States or in the world, the majority of them point to subjective rankings. For example, the US News and World Report includes sports as one of their weights.</p>\n<p></p>\n<p>My word of advice is to just care care about yourself and utilize the resources that this university has to offer.  </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_5", "updated": "2017-04-22T04:03:55Z"}, {"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [], "config": {}, "created": "2017-04-22T20:50:11Z", "data": {"embed_links": null}, "folders": [], "id": "j1tqo1njorqv2", "subject": "<p>Not that its particularly important, but if were talking about CS, its worth noting that Carnegie belongs in the group alongside MIT, Stanford, and Cal.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_6", "updated": "2017-04-22T20:50:11Z"}, {"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [], "config": {}, "created": "2017-04-22T22:03:21Z", "data": {"embed_links": null}, "folders": [], "id": "j1tta5afj1k1nc", "subject": "<p>But why? How do you know Carnegie is good? </p>\n<p></p>\n<p>Even more broadly, how do we know even MIT, Stanford, and Cal have good CS programs? What is it about them that make them good?</p>\n<p>Aren&#39;t all these ratings just manufactured by news outlets&#39; questionable rankings? It seems no one can say why a CS program is good or not. Seems like everybody just has baseless and evidence-less preconceived notions of which schools are &#34;good&#34;</p>\n<p></p>\n<p>Until someone comes up with an explanation about what makes some school&#39;s CS programs good and other school&#39;s CS programs not as good--I call all these rankings of universities and their CS programs just BS.</p>\n<p></p>\n<p>Seriously...The way universities are ranked in america and how much people obsess about getting into the &#34;good&#34; ones is really over the top imo.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_1", "updated": "2017-04-22T22:03:21Z"}, {"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [], "config": {}, "created": "2017-04-22T22:26:27Z", "data": {"embed_links": null}, "folders": [], "id": "j1tu3uw5m9z2hv", "subject": "<p>&#34;How do we know MIT, Stanford, Cal have good CS programs?&#34; </p>\n<p>Quality of alumni. I agree that this may be like a self-fulfilling prophecy, since &#34;good&#34; schools attract the best applicants, but to say that this is the only reason is naive.<br /><br />&#34;Aren&#39;t all these ratings just manufactured by news outlets&#39; questionable rankings? It seems no one can say why a CS program is good or not. Seems like everybody just has baseless and evidence-less preconceived notions of which schools are &#34;good&#34;&#34;</p>\n<p>Not all rankings are meaningless, and even the most questionable ranking system probably has some truth in it. Its not logical to just dismiss these rankings because its unclear exactly how they measure a school&#39;s quality. I&#39;m also curious why you think these notions are &#34;baseless&#34; and &#34;evidence-less.&#34;</p>\n<p></p>\n<p>&#34;Seriously...The way universities are ranked in america and how much people obsess about getting into the &#34;good&#34; ones is really over the top imo.&#34;</p>\n<p>I agree. While there&#39;s nothing wrong with trying to get into a &#34;good&#34; school if you can, some people do care too much about these rankings. </p>\n<p> </p>\n<p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_4", "updated": "2017-04-22T22:26:27Z"}, {"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [], "config": {}, "created": "2017-04-23T00:16:38Z", "data": {"embed_links": null}, "folders": [], "id": "j1ty1jp892x67t", "subject": "<p>Thanks for responding. First, we need to know what it means for a school to be good:</p>\n<p></p>\n<p>Uhh...is it like you learn more? And/Or you like learn better? And/Or you have good professors? And/Or the facilities are good? And/Or there&#39;s lots of academic support? And/Or not too much stress? And/Or not too much of a partying environment? And/Or lots of career fairs? And/Or famous professors? And/Or what companies think of it? And/Or number of papers that the researchers there output? And/Or the amount of &#34;important&#34; discoveries that were made there by researchers? And/Or the tuition? And/Or the number of students? And/Or the student to faculty ratio? And/Or the number of office hours? And/Or the number of homework parties? And/Or the surrounding neighborhood? And/Or the weather? And/Or the number of courses? And/Or the number of majors? And/or the student housing quality? And/Or the admission rate? And/Or the enrollment rate? And/Or the disability resources? And/Or the number of clubs? And/Or the quality of advisors? And/Or.... </p>\n<p></p>\n<p>So really, just the concept of a good school is already shaky to me. Trying to then give an ordering to the schools where there is a best school and a second best school, and so on is such an empty? futile? subjective? venture. If you look at US news&#39;s rankings today you see that princeton is in first place and harvard is in second place. Are you convinced princeton is a better school than harvard? If you go to harvard will you think that you&#39;re not getting the best &lt;any of the qualities that make a good school, good&gt; as you would have received at princeton?</p>\n<p>How about if you go to the 3rd place school?...honestly, would you feel that had you gotten into a school higher on the list, then you&#39;d have gone to a &#34;better&#34; university? Can you honestly say that your education would have been better if you had gone to a &#34;better&#34; school?</p>\n<p></p>\n<p>I don&#39;t buy it. I don&#39;t see any truth in princeton being better than harvard or being better than Cal. It&#39;s just another school. And after all, we&#39;re each in only one or two or three majors. These rankings are for the school as a whole. I wouldn&#39;t trust them to tell me anything about the quality of my education.</p>\n<p></p>\n<p>Or fine, let&#39;s look at the CS program rankings: <a href=\"https://www.usnews.com/education/best-global-universities/computer-science\">https://www.usnews.com/education/best-global-universities/computer-science</a></p>\n<p>So if I got into the #1 university I&#39;ll get a better CS education than if I had gone to #5 or #7 on the list? Really? I don&#39;t buy it. That&#39;s why I believe their rankings can be dismissed. Now of course, you wouldn&#39;t go to some random college that opened up a year ago and expect them to have their CS program be as well run as in schools that have been in the business for like 40&#43; years. But randomly pick any school that you hear people talk about and it will be a fine school, if you personally like it.</p>\n<p></p>\n<p>Basically, go to any university that you personally like and it will be fine. As long as you like the school, you can&#39;t go wrong by going to get a CS degree at, for example, UCSD instead of Stanford or CalTech or Berkeley. At the end of the day it comes down to what you do with the educational opportunities that are given to you.</p>\n<p></p>\n<p></p>\n<p></p>\n<p>And here&#39;s some information about how they calculate the ratings for the top universities.</p>\n<p>The article by US news about how they rate colleges: <a href=\"https://www.usnews.com/education/best-colleges/articles/how-us-news-calculated-the-rankings\">https://www.usnews.com/education/best-colleges/articles/how-us-news-calculated-the-rankings</a></p>\n<p></p>\n<p>It says that 22.5% of the ratings score comes from asking staff at each school about what they think of their own school. Ok...how&#39;s what staff say going to tell me which is the best university? </p>\n<p></p>\n<p>Graduation and retention rates account for 22.5 percent. All the schools you hear about have good enough rates. Move on.</p>\n<p></p>\n<p>And just look at their other metrics they use for rankings. I assure you that any school you&#39;ve heard of being commonly talked about is good enough in all the other metrics. Furthermore, there are even even schools that you know of that suck in some of the metrics and they are still considered a  top school. Like Cal has bad CS class sizes and yet, we&#39;re fine here because we make it work. And guess what, it&#39;s still a top school in their rankings. </p>\n<p></p>\n<p>Here&#39;s another way to see it. I think it&#39;s a bit like picking a country to live in (assuming you know the language and culture of any country you choose). Is living in the US better or worse than living in Canada or the UK? Is living in France better or worse than living in Switzerland? I mean, clearly living in the US is better than living in some poor country in the middle of a war, but if someone came out with rankings about which countries are the best to live in, would you believe their rankings? I wouldn&#39;t. If they tell me italy is two places ahead of germany or that Japan is 5 places worse than Australia I wouldn&#39;t believe them because they don&#39;t know enough. They can quantify rankings based on their own preferences but they can&#39;t tell me where is the best place for me to live . They&#39;re all good enough countries! The best country for me to live in depends on my own preferences. And on top of that, it really depends where I live in said country, and how I live, and so many other factors.</p>\n<p></p>\n<p>Also, have you noticed how each website that does rankings puts the schools in different (sometimes very different) order? Now tell me you believe those rankings.</p>\n<p></p>\n<p>I hope this was coherent enough because I rushed through some of it since I have to study. Still, interested to hear responses.</p>\n<p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_1", "updated": "2017-04-23T00:16:38Z"}, {"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [], "config": {}, "created": "2017-04-23T02:27:17Z", "data": {"embed_links": null}, "folders": [], "id": "j1u2pk2h6u93uv", "subject": "<p></p><blockquote>\n<p>&#34;So really, just the concept of a good school is already shaky to me. Trying to then give an ordering to the schools where there is a best school and a second best school, and so on is such an empty? futile? subjective? venture.”</p>\n</blockquote>\n<p>Yes I agree. School choice is obviously subjective, but I don’t think we should dismiss the results of those who try, especially if they have a methodology behind it.</p>\n<blockquote>\n<p>“If you look at US news&#39;s rankings today you see that princeton is in first place and harvard is in second place. Are you convinced princeton is a better school than harvard?”</p>\n</blockquote>\n<p>No, but if I see that Princeton is in first place, and UNC is in 27<sup>th</sup>, there’s good reason to suspect that my experience at Princeton would be better than my experience at UNC. Of course, this could be entirely false, but this is true for any opinion.</p>\n<blockquote>\n<p>“How about if you go to the 3rd place school?...honestly, would you feel that had you gotten into a school higher on the list, then you&#39;d have gone to a &#34;better&#34; university? Can you honestly say that your education would have been better if you had gone to a &#34;better&#34; school?”</p>\n</blockquote>\n<p>I agree that the ranking methodology breaks down when comparing schools at this level.</p>\n<blockquote>\n<p>“These rankings are for the school as a whole. I wouldn&#39;t trust them to tell me anything about the quality of my education.”</p>\n</blockquote>\n<p>I believe the rankings consider factors which contribute to “quality of education,” such as access to faculty, teacher-student ratio, etc.</p>\n<blockquote>\n<p>“As long as you like the school, you can&#39;t go wrong by going to get a CS degree at, for example, UCSD instead of Stanford or CalTech or Berkeley.”</p>\n</blockquote>\n<p>I think you aren’t giving UCSD enough credit as a decent CS school.</p>\n<blockquote>\n<p>“Graduation and retention rates account for 22.5 percent. All the schools you hear about have good enough rates. Move on.”</p>\n</blockquote>\n<p>You keep mentioning “schools you hear about.” Are these not the schools which are ranked highest? Berkeley, Stanford, MIT, even UCSD, UNC, UMich, UT-Austin,</p>\n<blockquote>\n<p>“Like Cal has bad CS class sizes and yet, we&#39;re fine here because we make it work. And guess what, it&#39;s still a top school in their rankings.”</p>\n</blockquote>\n<p>This shows that you probably value class size more than whoever compiled the rankings. Not all people do.</p>\n<p></p>\n<p>OP, I think you are trying to extract too much from these rankings. I completely agree with you that comparing schools based on single-digit ranking difference is a subjective matter, and people should perform their own research to figure out what they want from a school. However, the fact that no ranking system can these subjective opinions is not be a reason to disregard the rankings completely. They do their best to capture the differences between schools.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_4", "updated": "2017-04-23T02:27:17Z"}, {"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [], "config": {}, "created": "2017-04-23T04:09:13Z", "data": {"embed_links": null}, "folders": [], "id": "j1u6cntf9wx598", "subject": "<p>There is some good discussion going on here, especially with regards to how much we should regard rankings. I think a high ranking (in a particular subject) is more indicative of the faculty quality. Indirectly, this attracts top students, and hence, after years of this process, sometimes some people want to go to a particular school because of who they might be surrounded by (this includes other students, not just instructors). Along the lines, this gets blurred as an outright reason to attend the school, when it probably shouldn&#39;t; because, as stated above, going to a higher ranking school does not therefore mean you are learning CS &#34;better&#34;. Being in a better &#34;environment&#34; however, thats kind of subjective, and entirely is based on what someone deems &#34;better&#34;.</p>\n<p></p>\n<p>I picked Cal EECS over schools some people may not have (a couple ivies included; not bragging just making a point). Whereas someone else might have gone to the highest possible ranked undergraduate university they were accepted to. Are my reasons better? I don&#39;t know, I don&#39;t think so. So to the OP&#39;s point about what makes a school better, I think these things are indeed subjective and it may not be possible to extract a host of useful information. Not because they are doing an inadequate job at making the rankings, rather, some people just care about different things when it comes to picking a school. The rankings may &#34;try&#34; to capture that, but as most people may agree, its still incomplete. </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_6", "updated": "2017-04-23T04:09:13Z"}, {"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [], "config": {}, "created": "2017-04-23T04:15:08Z", "data": {"embed_links": null}, "folders": [], "id": "j1u6k9locv13wd", "subject": "<p>Thanks for your (2nd anon up) reply to my comment . Btw I&#39;m not OP.</p>\n<p></p>\n<p>Just a few things I wanted to respond to:</p>\n<p>1. I suppose I take issue with the fact that yes, the rankings are opinions that could be plain wrong and yet, I think, ever since they&#39;ve started coming out annually, it&#39;s been an obsessive race to get into the top universities. People take them to heart too seriously. So in a sense, the fact that people take them so seriously, makes me want to hold them up to a high standard. But, at the end of the day, they are indeed just opinions of some people working at a news outlet. They never promised to be accurate. I should chill.</p>\n<p></p>\n<p>2. There are over 2000 accredited universities in the U.S. so 27th position isn&#39;t bad at all. Though idk which rankings you&#39;re looking at because the us news one I&#39;m looking at puts its at 30th. But w/e it&#39;s somewhere in the 20s-30s.</p>\n<p></p>\n<p>3. You mentioned &#34;access to faculty&#34;. How can such a thing be measured? It&#39;s so...unscientific, and that makes me highly skeptical of rankings. Also, I should have been more specific and should have said &#34;I wouldn&#39;t trust them to tell me anything about the quality of my education in my major&#34;.</p>\n<p></p>\n<p>4. UCSD is known (for some reason) to be a good CS school, but it&#39;s not known (for some reason) to be as good as Cal, MIT, Stanford so I used it as an example of a school that&#39;s not revered as the best out there but is still great (as far as its reputation goes).</p>\n<p></p>\n<p>5. The schools that you hear commonly about (living in CA) aren&#39;t all ranked highest. UC Davis, UC Irvine, UC Santa Cruz, UC Santa Barbara aren&#39;t regarded super highly in rankings but you hear about them a lot. I&#39;m sure they have decent grad and retention rates. Nitpicking who has a few percent higher here or there doesn&#39;t matter. They&#39;re all great. Seriously, if your school makes it to the us news rankings, how worse can it possibly be compared to the top 30 in the rankings? Also, UT austin is 56 in the rankings and you see it as highly ranked--so yeah, whatever. the 56th position is also great. And so is 57th and 58th and so on. I really think if a school is known enough to be in the top 100 it&#39;s good. As long as enough people (students, faculty, and administrators) apply to be part of learning, teaching, and managing the school, it will be a good place b/c the school will be able to pick the best people out of those who apply. And the cycle of greatness kicks off from there.</p>\n<p></p>\n<p>6. teacher-student ratio is actually one of the metrics they use to rate schools. What I&#39;m saying is that we have a bad ratio in 61A and other classes and yet we&#39;re totally fine academically. And, we&#39;re still getting good rankings despite that. Personally, I don&#39;t care too much about teacher-student ratio because that&#39;s the average of the school and vary greatly between different classes.</p>\n<p></p>\n<p>Thank you for the discussion everyone.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_1", "updated": "2017-04-23T04:15:08Z"}], "config": {}, "created": "2017-04-20T19:29:19Z", "data": {"embed_links": null}, "folders": [], "id": "j1qswd3p5qwf5", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Also wondering about this since you&#39;d think that the best CS program teaches CS much better than at other schools, or that maybe the best CS program has the best professors, or the most resources for its students. But do we really learn CS at Cal better than at some other UC? Are the professors here better at teaching than at other schools?</p>\n<p></p>\n<p>Sure, we have notable people on the faculty team, but does that really translate to having a CS program that&#39;s better than at other schools? Is the access to some of the best minds in the world really the thing that makes students&#39; learning experience better here than at other UCs? Do other UCs not also have great faculty? </p>\n<p></p>\n<p>Perhaps our high ranking is caused by the fact that this is a selective university (because a ton of students apply yet there&#39;s limited space) so naturally only the top performers get admitted, thereby making this university appear it has a good CS program even though it&#39;s merely the students who are top-notch as a whole, and can accomplish more, on average.</p>\n<p>I&#39;d like to draw a connection to elementary/middle/high schools in my neighborhood: some of them are known to be &#34;good schools&#34; because of high test scores or whatnot. So does that mean they are better at teaching? Are the teachers better there? Or is it just that these &#34;good schools&#34; are in better parts of town and so the students who attend these schools are more privileged and have the resources to focus on their education?</p>\n<p></p>\n<p>I think the same thing is happening at Cal and at any other university that receives a lot of applicants: There&#39;s limited space so only the top people (however you want to define it) are admitted. When you have a bunch of top people in a school, naturally it&#39;s better. Naturally, great achievements happen at that school. Naturally, more people want to apply because they hear about the school&#39;s achievements. Naturally, more professors want to apply. Naturally, the school only lets the top professors in. Naturally, those top students graduate and as a whole make more money. Naturally, those top-notch alumni can donate more money back to the school. Naturally, the school has more money to fund its amazing students and professors. Naturally, it&#39;s a &#34;great school&#34;.</p>\n<p></p>\n<p>Now of course, this cycle has to start somewhere. I believe that it started because this university, and so many other &#34;top&#34; universities, are old and have had time to grow. And then when other universities pop up, naturally, prospective students are skeptical of them until they&#39;re established, and so prospective students naturally apply to established universities before they consider the newly created institutions. Naturally, this more established university has a lower admittance rate than newer universities. Naturally, a lower admittance rate gives off the vibe it&#39;s a better place, and naturally the university can only admit the top applicants who achieve more, on average, than students at less selective universities. And there, we&#39;re in that cycle.</p>\n<p></p>\n<p>Key realization: When &#34;top&#34; universities go around the county encouraging students to apply, it&#39;s not because they need to get their name out and convince students that they are good universities. They are already well known. Everyone already knows they&#39;re Ivy league or whatever. I believe it&#39;s mainly to get more people to apply so they can boast lower admittance rates. Because, come on now, you can&#39;t tell me you haven&#39;t looked at the admittance rate of a school to see &#34;how good&#34; it is.</p>\n<p></p>\n<p>I&#39;m sure my opinion is not shared by all. I&#39;m looking for further discussion and to possibly change my views on the matter :)</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_1", "updated": "2017-04-20T19:29:19Z"}, {"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [{"anon": "stud", "bucket_name": "Week 4/16 - 4/22", "bucket_order": 239, "children": [], "config": {}, "created": "2017-04-20T21:30:33Z", "data": {"embed_links": null}, "folders": [], "id": "j1qx893po7o37u", "subject": "<p>&#43;1</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2017-04-20T21:30:33Z"}], "config": {}, "created": "2017-04-20T19:51:10Z", "data": {"embed_links": null}, "folders": [], "id": "j1qtofybaob55d", "no_answer": 0, "no_upvotes": 0, "subject": "<p>2. We have the best TAs</p>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvhopc26l6a8", "name": "Laiming Huang", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jktvhopc26l6a8"], "type": "followup", "uid_a": "a_2", "updated": "2017-04-20T19:51:10Z"}], "config": {}, "created": "2017-04-20T08:13:07Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["cs", "eecs"], "history": [{"anon": "stud", "content": "<p>I know Berkeley is in the top trifecta of CS schools, along with Stanford and MIT. I emailed Prof. Sahai recently, and he mentioned Berkeley is <em>the</em> #1 CS program, alongside MIT. I&#39;m wondering what makes our program so highly regarded. I haven&#39;t studied at any other programs, so I can&#39;t compare them to ours.</p>\n<p></p>\n<p>I can only think of two ways to quantify a school&#39;s ranking: accomplishments and people. For the first one, we created Spark, we created floating point representation (IEEE 754), we created BSD, we created RISC CPUs, we created robot legs, we created RAID.</p>\n<p></p>\n<p>For the second one, we have Prof. Michael Jordan (top ML researcher in the world), Prof. Andrew Ng Prof. David Patterson, Prof. Richard Karp (wrote <em>the</em> paper on NP reductions), Bill Joy, Eric Schmidt, Gordon Moore, Jim Gray, etc.</p>\n<p></p>\n<p>1. What else makes our CS program so highly ranked? Have you experienced anything that made you feel &#34;Wow, this is an amazing school&#34;?</p>\n<p>2. How does our undergrad CS education compare to that of other schools&#39; students? What makes us different?</p>\n<p></p>\n<p>Hoping to open a productive discussion on this topic.</p>", "created": "2017-04-20T08:13:07Z", "subject": "Discussion: Why is Berkeley CS so highly ranked?", "uid_a": "a_0"}], "history_size": 1, "i_edits": [], "id": "j1q4qr909mb6r2", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 1, "no_answer_followup": 0, "nr": 3938, "num_favorites": 7, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654552421394, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "idrilcb5exd4gc", "name": "Jhalak Kumar Gurung", "photo": "1503278481_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/idrilcb5exd4gc/1503278481_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "ijm7vd9qfc6", "name": "Philip Hua", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "idkkuk3zhbm6aw", "name": "Hanyu Li", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"ixj56cq4o911qa": 1, "iy7nq0jv6wu1r3": 1}, "facebook_id": null, "id": "itek8117ve07gl", "name": "Yining Liu", "photo": "1528830792_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/itek8117ve07gl/1528830792_35.png", "published": true, "role": "", "us": false}, {"admin": false, "endorser": {"global": 1, "ir6ikxxrjtm3j5": 1, "irwl7o7shzu70z": 1, "j5rswrk9vh75b": 1512518221}, "facebook_id": null, "id": "is25wwpv21b3nn", "name": "Simon Mo", "photo": "1513142732_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/is25wwpv21b3nn/1513142732_35.png", "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "i54n88803n659", "name": "Kareena Hirani", "photo": null, "photo_url": null, "published": true, "role": "", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p8idxhub7pd", "name": "Daniel Zhang", "photo": "1471923062_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/is6p8idxhub7pd/1471923062_35.png", "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "hzcygtf42ej1b5", "name": "Arissa Wongpanich", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"global": 1, "ireb05q4pq01oe": 1, "irwl7o7shzu70z": 1}, "facebook_id": null, "id": "ir6sjtqw2e51rf", "name": "Nitzan Orr", "photo": null, "photo_url": null, "published": true, "role": "", "us": false}, {"admin": false, "class_sections": ["classof2019_hyq0br1u3kx7dg"], "endorser": {}, "facebook_id": null, "id": "icguy3j1u0j1nd", "name": "Eric Hou", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6wdztpg2l2v0", "name": "Ryan Deng", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": "100000829985526", "id": "hzd1lzvea8i3iw", "name": "Jenny Li", "photo": "1493565381_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/hzd1lzvea8i3iw/1493565381_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"hv91iivr1r15z": 1}, "facebook_id": null, "id": "hkkimnphegg1lj", "name": "Nick Rose", "photo": "1488156699_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/hkkimnphegg1lj/1488156699_35.png", "published": true, "role": "", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p92mt61sdb", "name": "Bryce Schmidtchen", "photo": "1471996774_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/is6p92mt61sdb/1471996774_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "idgok7br5s74ae", "name": "Morgan Rae Reschenberg", "photo": "1440866980_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/idgok7br5s74ae/1440866980_35.png", "published": true, "role": "", "us": false}, {"admin": false, "endorser": {"irwl7o7shzu70z": 1}, "facebook_id": null, "id": "is6pa3mwidi1cs", "name": "Robert Quitt", "photo": "1522715648_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/is6pa3mwidi1cs/1522715648_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"iy7nq0jv6wu1r3": 1, "jko89qm4qo732a": 1535661663}, "facebook_id": null, "id": "ikbgc48264p6v2", "name": "Carson", "photo": "1496349505_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/ikbgc48264p6v2/1496349505_35.png", "published": true, "role": "student", "us": false}], "tag_good_arr": ["idrilcb5exd4gc", "ijm7vd9qfc6", "idkkuk3zhbm6aw", "itek8117ve07gl", "is25wwpv21b3nn", "i54n88803n659", "is6p8idxhub7pd", "hzcygtf42ej1b5", "ir6sjtqw2e51rf", "icguy3j1u0j1nd", "is6wdztpg2l2v0", "hzd1lzvea8i3iw", "hkkimnphegg1lj", "is6p92mt61sdb", "idgok7br5s74ae", "is6pa3mwidi1cs", "ikbgc48264p6v2"], "tags": ["cs", "eecs", "student", "unanswered"], "type": "question", "unique_views": 793}