{"bookmarked": 6, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "j63by55a4bm5p1", "type": "create", "uid_a": "a_0", "when": "2017-08-08T08:34:39Z"}, {"anon": "no", "data": "j63xv375toslc", "to": "j63by559eqx5p0", "type": "s_answer", "uid": "idrimokn9e45ns", "when": "2017-08-08T18:48:08Z"}, {"anon": "stud", "to": "j63by559eqx5p0", "type": "followup", "uid_a": "a_1", "when": "2017-08-08T21:17:31Z"}, {"anon": "no", "data": "j65h5t34akr2xf", "to": "j63by559eqx5p0", "type": "i_answer", "uid": "ibtip4ceues3g0", "when": "2017-08-09T20:36:07Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2017-08-08T18:48:08Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "no", "content": "<p>I think AP CS is a substantial knowledge base that should help you along in CS61A or B quite well by itself. It might be best to save a spot for someone else who fits the suggested demographics better, just for the sake of community. I don&#39;t think it would make sense to take someone else&#39;s spot in a program with a specifically delineated demographic that needs assistance.</p>\n<p></p>\n<p>I would encourage you to look into CS Mentors, though. I haven&#39;t done it personally but I do know the help that a consistent small-group setting provides in making sure you keep up with whatever classes you take! </p>", "created": "2017-08-08T18:48:08Z", "subject": "", "uid": "idrimokn9e45ns"}], "id": "j63xv36weyblb", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}, {"anon": "stud", "bucket_name": "Week 8/6 - 8/12", "bucket_order": 138, "children": [], "config": {}, "created": "2017-08-08T21:17:31Z", "data": {"embed_links": null}, "folders": [], "id": "j64377nhhpi67t", "no_answer": 0, "no_upvotes": 0, "subject": "<p>I participated in CS Scholars and CS Mentors last semester when enrolled in CS61A and found both to be quite helpful. I didn&#39;t take APCS in high school but took CS10 in fall 2016, so I did both programs to have a better chance of doing well in 61A. I think both programs helped me stay on track with material and get a better understanding of what was expected of me in the class, as 61A can be a bit overwhelming without much CS experience. I liked having the chance to review concepts in seminar/section so if you feel like you would benefit from the additional support, I would do both. If you prefer to review independently and don&#39;t feel you need as much help/support but would like some review, I would recommend CS Mentors.</p>\n<p></p>\n<p>CS Scholars: You aren&#39;t required to attend lab/discussion sections, but it gives you a chance to work with people you&#39;ll get to know (from same sections and seminar) in the program and ask for help from the TA (who will likely be leading the sections and seminar). For me, I did the labs on my own and just attended the discussion section. The lab/discussion for CS Scholars isn&#39;t really different from regular sections, except for the fact that people in them are also in CS Scholars. I found the mandatory seminar to be worth it, as you get extra worksheets/practice/review (like another discussion section) to go over concepts and ask for help. We also had mock exams and review sessions for the class exams, which were really helpful when you already have limited exposure in CS. </p>\n<p></p>\n<p>CS Mentors: You can sign up for a one-hour section, once a week, to go over recently-covered topics in class and do practice problems. These sections are only for groups of 3-4 people with 1 mentor and are pretty focused on the given worksheet. CS Mentors also holds review sessions before exams, which are nice if you want extra practice. Unlike CS Scholars, anyone in the class can sign up for a section (if space is available); it is not necessarily intended to support students with limited CS exposure, but rather anyone who would like to review concepts.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_1", "updated": "2017-08-08T21:17:31Z"}, {"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2017-08-09T20:36:07Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "no", "content": "<p><strong attention=\"i7pcvpnbkv75hi\">&#64;Charlene Hughes</strong>  </p>", "created": "2017-08-09T20:36:07Z", "subject": "", "uid": "ibtip4ceues3g0"}], "id": "j65h5t32r192xe", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "i_answer"}], "config": {}, "created": "2017-08-08T08:34:39Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["eecs", "tutoring", "cs-intended", "lscs", "faculty_advising", "workshops"], "history": [{"anon": "stud", "content": "<p style=\"font-family:&#34;Helvetica&#34;;font-size:12px\"><span style=\"font-size:12pt\">CS Scholars is a program meant for EOP CS students (low income, minority, disadvantaged). It moves my discussion and labs to less convenient times, and adds a mandatory seminar class that ends at 6PM, so I&#39;m not entirely sure if I should go for it. I&#39;m also not a minority or disadvantaged, but I did have somewhat limited exposure to CS (APCS). I would love to get some insight into the program and for those who were in the program, how has it impacted you as a CS student? Also, what&#39;s the difference between CS Mentors and Scholars? Should I do both?</span></p>", "created": "2017-08-08T08:34:39Z", "subject": "is cs scholars worth it?", "uid_a": "a_0"}], "i_edits": [], "id": "j63by559eqx5p0", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 4702, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654551615481, "tag_good": [], "tag_good_arr": [], "tags": ["cs-intended", "eecs", "faculty_advising", "lscs", "student", "tutoring", "workshops"], "type": "question", "unique_views": 485}