{"bookmarked": 5, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "j6jp2phgkym614", "type": "create", "uid_a": "a_0", "when": "2017-08-19T19:26:25Z"}, {"anon": "stud", "data": "j6khc6tim316bf", "to": "j6jp2phdrji613", "type": "s_answer", "uid_a": "a_1", "when": "2017-08-20T08:37:37Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2017-08-20T08:37:37Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>I have taken 189 and 161. I have not taken 168. 161 had more work than I expected it to though in total I would still say it is among the lighter workload classes. There was a decent sized project portion but the exams and the hw&#39;s weren&#39;t too bad. I suggest doing the projects with a partner if you have the option; I did most of them alone and it would have taken far less time if I had a partner. I would guess how you feel about the workload in 189 will depend a lot on how comfortable you are with the math. The assignments are about a roughly even mix of coding and problem set type work. Sahai has never taught 189 so we don&#39;t know yet if that will effect the hw though I would be suspicious that it will make the class have a higher workload than it typically does. I would say while 189&#39;s workload was on the larger side I didn&#39;t find it horrible but that might be because I really enjoyed the material. I could see how if you aren&#39;t familiar with the math some of the hw&#39;s may feel more difficult. My semester had biweekly hw&#39;s that were a mix of coding assignments and problem sets so regardless about how comfortable you were with the math or coding if you planned well the workload was manageable. </p>\n<p></p>\n<p>Like any question about workload the answer is going to mainly be a function of you and what subjects you are comfortable with since there is so much variance in what subjects people find challenging and how much work people can tolerate. There is also the question of professors, there are relatively extreme fluctuations in how people review classes based off of the class&#39;s professor. It&#39;s important to remember how non-standardized a lot of these classes really are particularly in terms of their assignments, we tend to forget that as students. I would suggest signing up for 189, 161, 168, and the humanities if you can manage it and then decide to drop either the humanities or 161 depending on how you feel once you get a sense of how everything goes. </p>", "created": "2017-08-20T08:37:37Z", "subject": "", "uid_a": "a_1"}], "id": "j6khc6tcohh6be", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}], "config": {}, "created": "2017-08-19T19:26:25Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["enrollments"], "history": [{"anon": "stud", "content": "I am having a hard time deciding if CS 189, CS 161,  and CS168 would be a very heavy workload or would it be better to just switch to CS 189, CS 168, and a humanities?", "created": "2017-08-19T19:26:25Z", "subject": "Workload Difficulty: 189, 161, 168", "uid_a": "a_0"}], "i_edits": [], "id": "j6jp2phdrji613", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 4802, "num_favorites": 2, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654551595175, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "hzab6kpr3c048h", "name": "Justin Luke", "photo": "1473540382_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/hzab6kpr3c048h/1473540382_35.png", "published": true, "role": "student", "us": false}], "tag_good_arr": ["hzab6kpr3c048h"], "tags": ["enrollments", "student"], "type": "question", "unique_views": 487}