{"bookmarked": 2, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "j6ntttsfy1e66p", "type": "create", "uid": "icdxydvnk125h8", "when": "2017-08-22T16:50:34Z"}], "children": [], "config": {}, "created": "2017-08-22T16:50:34Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements"], "history": [{"anon": "no", "content": "<p></p><div>\n<div><b>Stat 157 Sec 3 Seminar on Topics in Probability and Statistics </b><b>(3 units) Class Nbr 67231</b></div>\n<div><b>TITLE:  Nonparametric Inference and Sensitivity Auditing with Applications to Social Good</b></div>\n<div><b></b></div>\nProf. Philip Stark</div>\n<div>TTh 9:30-11am </div>\n<div>334 Evans Hall</div>\n<div>Enrollment limit: 25, currently reserved for Stat majors but any seats remaining when instruction begins will be released to the waiting list</div>\n<div></div>\n<div>\n<div></div>\n<div>\n<div>\n<div><b>Prerequisites:</b> Statistics 133, 134, 135, willingness to work with a team of peers, dedication. Students are expected to be comfortable with LaTeX, Markdown, HTML5, git, GitHub, Python, Javascript, and Jupyter. Some projects might require jQuery and D3.</div>\n</div>\n<div></div>\nMost upper-division students with an interest in data science would probably have the prerequisites. Other examples: double majors between Stat and CS, students who have taken DS100, students who have taken 133, 134, 135, 159. I will provide links to material on those topics for self study.</div>\n<div></div>\n<div><b>Topics: </b></div>\n<div></div>\n<div><b>Theory and Philosophy:</b> pseudo-random number generation, algorithms for random sampling, elements of group theory in probability (invariance, orbits, exchangeability), permutation tests, stratified permutation tests, selecting test statistics, nonparametric inference about effect size, sampling and inference for finite populations, useful probability inequalities for statistical inference, Wald&#39;s sequential probability ratio test, cargo-cult statistics, the ontogeny of probability in applied statistics,  post-normal science, sensitivity analysis and sensitivity auditing, uncertainty quantification.</div>\n<div></div>\n<div><b>Applications</b>: election auditing, gender bias in teaching evaluations, forecasting the price of solar cells, forecasting the economic impact of climate change, predictive policing, ethical considerations in applying data science to societal problems, policy implications of models and uncertainty, communicating statistical ideas to a lay audience.</div>\n<div></div>\n<div><b>Term projects: </b>contribute to an open-source project for permutation methods and to an open-source project for election auditing, and analyze data relevant to an important societal issue, e.g., the partial recount of the 2016 presidential election, crime or recidivism or &#34;predictive policing,&#34; consumer lending or college loans, alternative energy, farm subsidies, mass transportation, bicycle commuting, natural disasters, or climate. Written and oral presentations are required; some projects might involve building an interactive website to present results or enable others to use the techniques. Grades will be based in part on the quality of the writing and the programming, the relevance and acuity of the analysis, the reproducibility of the computations, and the effectiveness of the communication.</div>\n<div></div>\n<div>Written assignments will be submitted using GitHub. There will be emphasis on using good computational hygiene, including revision control systems, unit tests, regression tests, and coverage tests, and on documenting one&#39;s code adequately. We will occasionally have code reviews in class. </div>\n</div>\n<div>\n<div><img src=\"https://ssl.gstatic.com/ui/v1/icons/mail/images/cleardot.gif\" /></div>\n</div>", "created": "2017-08-22T16:50:34Z", "subject": "NEW Fall 2017 Stat 157 Open for Enrollment NOW!", "uid": "icdxydvnk125h8"}], "i_edits": [], "id": "j6ntttsd56v66o", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 4833, "num_favorites": 1, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654551478789, "tag_good": [], "tag_good_arr": [], "tags": ["announcements", "instructor-note"], "type": "note", "unique_views": 647}