{"bookmarked": 3, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "ifph30v6aak8a", "type": "create", "uid": "havqkooc34e66g", "when": "2015-10-13T14:37:17Z"}], "children": [], "config": {}, "created": "2015-10-13T14:37:17Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": {}, "folders": ["cs", "faculty_advising"], "history": [{"anon": "no", "content": "<p>Also, please note that I will <strong>not</strong> be teaching CS160 for at least a year after that. So future students looking to avoid me need only wait until Fall 2016. Otherwise, I&#39;ll be taking time away from CS160 until well after Spring 2017.</p>\n<p></p>\n<p>In Spring 2016 we will be aiming to accommodate around 200 students (it may be slightly more or less depending on several factors). It will be held M&#43;W 2:30-4pm. There will be sections as well once a week. There will be a midterm. There will not be a final exam (ignore any conflicts you have with final exams). We will have a final critique during RRR week (date and time TBD). You must attend the final critique.</p>\n<p></p>\n<p>Enrollment will use the standard policy for computer science upper division courses and will not use a separate application process. This means that waitlist position will matter and students declared as LSCS or EECS who want to prioritize enrollment into this class should consider using phase I of telebears to sign up for CS160. We will take people off the waitlist in waitlist order shortly before the first day of class in January. You must attend the first class or you will be dropped. This means you need to arrange to come back from any trip or vacation in time for the first day of class on Jan 20th 2016 &#64; 2:30pm. Please do not email us with requests to miss this first class. If you cannot make this first class, please do not enroll.</p>\n<p></p>\n<p>During the first half of the semester class time will be used for lectures and workshops focusing on core HCI techniques and material. A midterm will be held. During the second half of the semester, students will break into smaller groups (roughly 5-6 students) across three studios within Jacobs Hall. I will be assigning the groups. Within these smaller teams, students will work on a larger scale design project using the three hour studio time as worksessions, critique time, and for direct interaction with faculty and teaching staff. Students will be expected to attend these studio times. A final project critique and public showcase will replace a final exam.</p>\n<p></p>\n<p>I&#39;m starting to look for great GSIs and Readers for Spring. Please help spread the word. </p>\n<p>More info can be found here:</p>\n<p></p>\n<p><a href=\"http://teaching.paulos.net/cs160_SP2016/\">http://teaching.paulos.net/cs160_SP2016/</a></p>\n<p></p>", "created": "2015-10-13T14:37:17Z", "subject": "I will be teaching CS160 again in Spring 2016", "uid": "havqkooc34e66g"}], "i_edits": [], "id": "ifph30v56r189", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 488, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654556282867, "tag_good": [{"admin": true, "class_sections": ["classof2019_hyq0br1u3kx7dg", "classof2018_hyq0br1u3kx7dg", "classof2017_hyq0br1u3kx7dg", "classof2016_hyq0br1u3kx7dg", "transfers_hyq0br1u3kx7dg"], "endorser": {}, "facebook_id": null, "id": "halg8jo1i9m2ye", "name": "Christopher Hunn", "photo": null, "photo_url": null, "role": "instructor", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "h67fsjb282o2rd", "name": "Kevin Gabriel Chow", "photo": "1345827287_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/h67fsjb282o2rd/1345827287_35.png", "published": true, "role": "student", "us": false}], "tag_good_arr": ["halg8jo1i9m2ye", "h67fsjb282o2rd"], "tags": ["cs", "faculty_advising", "student"], "type": "note", "unique_views": 292}