{"bookmarked": 3, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "j8q0ykwwu3x218", "type": "create", "uid": "i1i1qn178di2vn", "when": "2017-10-13T15:05:10Z"}, {"anon": "no", "to": "j8q0ykwv22v217", "type": "followup", "uid": "j0b75czu7362rq", "when": "2017-11-09T17:49:13Z"}], "children": [{"anon": "no", "bucket_name": "Week 11/5 - 11/11", "bucket_order": 131, "children": [], "config": {}, "created": "2017-11-09T17:49:13Z", "data": {"embed_links": null}, "folders": [], "id": "j9srpk64jgx3dc", "no_answer": 0, "no_upvotes": 0, "subject": "<p></p>\n<h1>Classroom and Enrollment Setup for COMPSCI DeCal Classes</h1>\n<p><br /> <strong><em>Step 1:  Finalizing your Decal proposal form.</em></strong></p>\n<p>Once you have read (and promise to pay attention to) the information that follows below, you can put the name of the CS Scheduler or Enrollment Manager on the Decal form and fill in the bubble that says, “Yes”, you have engaged with us.<br /><br /></p>\n<p><strong><em>Step 2: Get a finalized DeCal proposal to CS Scheduling</em></strong></p>\n<p>The CS Scheduler is the person who reserves a room and sets up the class information into the enrollment system for your class.</p>\n<ol><li>      Once you have a completed a <a href=\"https://academic-senate.berkeley.edu/sites/default/files/course_proposal_form_packet_2017.pdf\">DeCal proposal</a> (including faculty sponsor letter, unit-value worksheet, syllabus, etc.), provide a complete and <em>fully</em> <em>signed</em> copy to the CS Scheduler either in person or as a PDF by email.</li><li>      Send an email to the CS Scheduler with information needed to schedule the course: </li></ol>\n<ul><li>         # of seats needed</li><li>         first choice of day(s)/time to teach,</li><li>         an acceptable range of other options for day(s)/time in case your first choice is not available</li><li>         any specific characteristics of the room you would like to teach in (e.g., movable chairs, specific a/v equipment, etc.).  If you already have a location reserved, let the CS scheduler know that.</li></ul>\n<ol><li><strong>      </strong>The CS Scheduler will create the course in the campus online schedule of classes and share the section # and the class # with you.  Campus Scheduling will be approached to reserve space for your class if there is no appropriate room in Soda.  The CS Scheduler will let you know when a room has been found and a specific schedule has been set.</li></ol>\n<p><strong>Note</strong>: Classrooms for DeCal classes are set up via CS Scheduling. Please do not request a room via bcal in Soda Hall yourself.</p>\n<p><br /> <strong><em>Step 3: Meet/email the CS Enrollment Manager </em></strong></p>\n<p>The CS Enrollment Manager is the person who creates the enrollment capacity for your class and designates how students will be able to enroll. You will work with the Enrollment Manager for any enrollment-related issues as well.</p>\n<p>Once the CS Scheduler has provided you with the section number and class number for your DeCal class, you can contact the CS Enrollment Manager to discuss how to handle enrollment.</p>\n<p></p>\n<p>There are three ways enrollment can be handled for a DeCal class:</p>\n<ul><li>         <strong>Open enrollment</strong> – this is first come, first enrolled no matter who the students are. No priority is given by major, no distinction is made between lower div, upper div or grad students. This method requires the least effort on your part but also allows the least control over enrollment.</li><li>         <strong>Permission code distributed by instructors</strong> – this is the most popular choice because it gives you the most flexibility and control. Enrollment is restricted to ‘instructor consent’ on Cal Central. You can then create your own enrollment form outside Cal Central to help you determine who should get into the class.<br /> <br /> The CS Enrollment Manager provides you with SINGLE USE permission codes that you can distribute to approved students. They use these codes when they enroll into your class.</li><li>         <strong>Student-specific permission codes</strong> – this option prevents students from applying to enroll in your class and then giving the single-use permission code to someone else. <br /> <br /> This method is secure but rarely used because it requires you to provide a full list of students (names and SIDs) to your class to the Enrollment Manager within the first four weeks of the semester. The CS Enrollment Manager then generates the student-specific permissions and you then must notify the students that they can enroll into the class. </li></ul>\n<p><strong><em>Step 4: Request permission to get teaching credit for your DeCal</em></strong></p>\n<p>To get teaching credit for your DeCal, you need to enroll into the CS399 section assigned to your faculty sponsor. To do this:</p>\n<ol><li>       Create a list of instructors/TAs who need this credit. The list should include names and SIDs.</li><li>       Provide and review this list with your faculty sponsor to ensure they know who they will be submitting grades for at the end of the semester.</li><li>      Email the list to the CS Enrollment Manager who will then create student-specific permissions for you and notify you when you can enroll for credit.</li></ol>\n<p><strong><em>Step 5: Manage your DeCal enrollment/waitlist</em></strong></p>\n<p>If you have a waitlist for your class and want to drop students who have enrolled but haven’t attended class, you can request a class roster from the CS Enrollment Manager to cross reference with your attendance records.  The Enrollment Manager would need any list of students you wish to drop for non-attendance by <em>no later than 5pm Wednesday of the third week of class</em>. </p>\n<p>If you plan to drop students for non-attendance, you need to have communicated (in your syllabus and/or the class website) from the beginning of the semester that this is something you will do.</p>\n<p> </p>\n<p>Have additional questions? Please contact either the CS Scheduler or CS Enrollment Manager</p>\n<p></p>\n<p><em>As of 10/20/2017:</em></p>\n<p><em>CS Scheduler: Michael-David Sasson, located in Soda 315</em></p>\n<p><em>CS Enrollment Manager: Cindy Conners, located in Soda 379</em></p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "j0b75czu7362rq", "updated": "2017-11-09T17:49:13Z"}], "config": {}, "created": "2017-10-13T15:05:10Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements", "program_updates"], "history": [{"anon": "no", "content": "<p></p><h1></h1>\n<div>\n<p>Proposals (filled out and with the chair&#39;s signature) for spring 2018 DeCals are due to the Senate by Wednesday November 8th, 2018.  That means that they should be brought to the EE or CS chair&#39;s assistant for the chair&#39;s signature with enough lead time that a facilitator could give time for them to sign (a few days perhaps) and then pick up the form and walk it to the Senate offices in Stephens Hall.  Before then you will need to visit staff in either 315 or 379 Soda for CS DeCals and in 205 Cory for EE or EECS Decals to get information about room scheduling and enrollment management.  </p>\n<p> </p>\n<p>More information regarding opportunities and expectations/requirements can be found here:</p>\n<p><a href=\"http://academic-senate.berkeley.edu/committees/coci/sfc\">http://academic-senate.berkeley.edu/committees/coci/sfc</a><a href=\"http://academic-senate.berkeley.edu/committees/coci/sfc\" target=\"_blank\"></a></p>\n<p>and also here <a href=\"http://www.decal.org/\" target=\"_blank\">www.decal.org</a> (they are copied below ) See particularly: &#34;All students should review and affirm that each item on the Student Checklist in the <a href=\"https://academic-senate.berkeley.edu/sites/default/files/course_proposal_form_packet_2017.pdf\">Course Proposal Form</a> has been addressed before facilitating a course.&#34;  </p>\n<p> </p>\n<p>EECS (EE and CS) don&#39;t have specific earlier deadlines as some departments do but we would appreciate being able to honor campus deadlines.</p>\n<p> </p>\n<p>All the best,</p>\n<p> </p>\n<p>Michael-David</p>\n<p></p>\n<p>PS Note that at least on the CS side, we no longer have capacity to provide separate lab or discussion sections as secondary sections for individual decals.</p>\n<p>---------</p>\n<p>Required Documents</p>\n<p>The course proposal form must be completed each semester by the sponsoring department for every student-facilitated 98 or 198 course offered for academic credit. The following must be submitted to the Academic Senate in hard copy (paper):</p>\n<ol><li>Course proposal form - The <a href=\"https://academic-senate.berkeley.edu/sites/default/files/course_proposal_form_packet_2017.pdf\">form</a>, unit value worksheet, instructions, and three checklists are combined into a course proposal packet that must be completed entirely, including all relevant signatures.<br /> </li><li>Fully developed syllabus - A fully developed syllabus will include at least the following: an outline of course content, a reading list, statement of frequency of class meetings, clear description of assignments and requirements for passing the class, key learning outcomes, method(s) of instruction, and method(s) of evaluation of student performance.<br /><br />An example of a <a href=\"http://teaching.berkeley.edu/sites/default/files/syllabus_components.pdf\">fully developed syllabus(link is external)</a> can be found at the Center for Teaching &amp; Learning. Additional resources may be found at the website for <a href=\"http://slc.berkeley.edu/undergraduate-course-facilitator-training-resources-ucftr\">Undergraduate Course Facilitator Training &amp; Resources (UCFTR)(link is external)</a>.<br /> </li><li>Unit value worksheet - The worksheet to calculate workload and resultant unit value is available for download. Beginning for courses offered in fall 2015, this worksheet is <em>required</em> to be submitted to the Academic Senate.<br /><br /><a href=\"https://academic-senate.berkeley.edu/sites/default/files/unitvalueworksheet_2017.pdf\">Unit value worksheet PDF</a> (open and fill out in Acrobat Reader, then print)<br /><a href=\"https://academic-senate.berkeley.edu/sites/default/files/unitvalueworksheet_2017.doc\">Unit value worksheet Word version</a> (can be printed and filled out by hand)<br /><br />When completing the unit value worksheet ensure that the minimum total work hours are equivalent to the unit value of the course (e.g.: there are at least 45 hours for a 1 unit course). Also ensure that any requirements outlined in the worksheet are explained fully in the course syllabus.<br /> </li><li><em>NEW: Faculty Sponsor Letter of Support</em> – A <a href=\"https://academic-senate.berkeley.edu/sites/default/files/faculty_sponsor_letter.2017.pdf\">letter of support</a> from the instructor of record must be provided for each course the instructor is sponsoring. The letter should address the five questions explaining the role and relationship the instructor has with the course. The letter should be written on department letterhead and signed by the instructor of record. This is required for all student-facilitated course proposals starting spring 2018.</li></ol>\n<p>Resources</p>\n<ol></ol>\n<p>Student Facilitators<br /><br />COCI expects that students interested in facilitating a course have taken serious consideration of the time and responsibility required for preparing and facilitating a course. All students should review and affirm that each item on the Student Checklist in the <a href=\"https://academic-senate.berkeley.edu/sites/default/files/course_proposal_form_packet_2017.pdf\">Course Proposal Form</a> has been addressed before facilitating a course.</p>\n<p><a href=\"http://vcue.berkeley.edu/special-studies\">Special Studies Website(link is external)</a> – Provides overview information about Special Studies 98/198 courses as part of undergraduate education at Berkeley.</p>\n<p><a href=\"http://decal.berkeley.edu/\">DeCal(link is external)</a> – Undergraduate student facilitators who wish to advertise their courses through DeCal should consult the DeCal website. Be aware that the DeCal student organization has different deadlines and requirements than the Academic Senate.<br /><br /><a href=\"https://academic-senate.berkeley.edu/sites/default/files/faq_student_2017.pdf\">FAQ about Student-Facilitated Courses</a> – Provides answers to some of the more frequently asked questions.</p>\n<p><a href=\"http://slc.berkeley.edu/undergraduate-course-facilitator-training-resources-ucftr\">Undergraduate Course Facilitator Training &amp; Resources (UCFTR) Website(link is external)</a> - Provides a volume of information for training workshops, policies, and tools to support students developing their own course.<br /><br /><br />Instructor of Record</p>\n<p>Instructors of record are expected to work with student facilitators to develop courses that are academic in nature and meet workload requirements, supervise the student facilitators, and submit final grades (among other requirements). See the Faculty Checklist in the <a href=\"https://academic-senate.berkeley.edu/sites/default/files/course_proposal_form_packet_2017.pdf\">Course Proposal Form</a> for a detailed checklist of responsibilities for the instructor of record. </p>\n<p><a href=\"https://academic-senate.berkeley.edu/sites/default/files/faq_ior_2017.pdf\">FAQ for instructors of record</a><a href=\"https://academic-senate.berkeley.edu/committees/coci/sfc/faq-ior\"> </a>- COCI has created a frequently asked questions document specifically for instructors who are considering sponsoring a student-facilitated course. COCI strongly recommends that instructors review this document before agreeing to sponsor a student-facilitated course.<br /><br /><em>NEW</em> <a href=\"https://academic-senate.berkeley.edu/sites/default/files/faculty_sponsor_letter.2017.pdf\">Faculty Sponsor Letter of Support</a> – A letter of support from the instructor of record must be provided for each course the instructor is sponsoring. The letter should address the five questions explaining the role and relationship the instructor has with the course. The letter should be written on department letterhead and signed by the instructor of record. This is <em>required</em> for all student-facilitated course proposals starting spring 2018.<br /> </p>\n<p>Department Chair</p>\n<p>COCI expects department chairs ensure that instructors of record are providing appropriate supervision, that courses have academic requirements, and that resources and administrative support are available to student facilitators. See the Department Chair Checklist in the <a href=\"https://academic-senate.berkeley.edu/sites/default/files/course_proposal_form_packet_2017.pdf\">Course Proposal Form</a> for a detailed checklist laying out the responsibilities of the sponsoring department.<br /><br /><br /><a href=\"https://academic-senate.berkeley.edu/sites/default/files/coci_memo_student-faciliated_courses_and_changes_to_proposals_2017.pdf\">COCI Memo on Student-Facilitated Courses and Changes to Proposals</a> – Distributed in 2017, this letter provides an overview of changes to the forms and instructions for student-facilitated course proposals. Effective spring 2018 these proposals must now be accompanied with a Faculty Sponsor Letter and confirmation of student-facilitators having completed training with the Student Learning Center’s Undergraduate Course Facilitator Training and Resources (UCFTR) unit.<br /><br /><a href=\"https://academic-senate.berkeley.edu/sites/default/files/sfc_calmessage_2015-final.pdf\">COCI Communication to Departments about Student-Facilitated Courses</a> – Distributed to campus in 2015, this letter provides an overview of department and instructor responsibilities for student-facilitated courses.<br /><br /><a href=\"https://academic-senate.berkeley.edu/sites/default/files/coci_memo_on_sfcs_and_student_groups.pdf\">COCI Memo about Student-Facilitated Courses and Student Groups</a> – Distributed in 2013, this letter provides an overview of COCI’s recommendations for student-facilitated courses that include fundraising or partnership with outside organizations as part of the course content.</p>\n</div>", "created": "2017-10-13T15:05:10Z", "subject": "Spring 2018 DeCal Courses: Nov 8 Deadline for Proposals to Reach the Academic Senate", "uid": "i1i1qn178di2vn"}], "i_edits": [], "id": "j8q0ykwv22v217", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 5165, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654551187722, "tag_good": [{"admin": true, "class_sections": ["classof2016_hyq0br1u3kx7dg", "classof2017_hyq0br1u3kx7dg", "classof2018_hyq0br1u3kx7dg", "classof2019_hyq0br1u3kx7dg", "testgroup_hyq0br1u3kx7dg", "transfers_hyq0br1u3kx7dg"], "endorser": {}, "facebook_id": null, "id": "j0b75czu7362rq", "name": "Cindy Conners", "photo": "1489597345_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/j0b75czu7362rq/1489597345_35.png", "role": "instructor", "us": false}], "tag_good_arr": ["j0b75czu7362rq"], "tags": ["announcements", "instructor-note", "program_updates"], "type": "note", "unique_views": 496}