{"bookmarked": 3, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "ja4c6ltrydjvw", "type": "create", "uid": "icdxydvnk125h8", "when": "2017-11-17T20:07:49Z"}], "children": [], "config": {"is_announcement": 1}, "created": "2017-11-17T20:07:49Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements", "cs-intended", "eecs", "lscs", "events"], "history": [{"anon": "no", "content": "<p></p><h3>Important L&amp;S CS Deadlines</h3>\n<ul><li>Deadline to obtain a signature from a CS Advisor for the Late Change of Class Schedule is Friday, December 1. </li><li>Deadline to withdraw from the semester is the last day of RRR week) - Friday, December 8. </li><li>Please make sure that you have read the College policy on withdrawal and consult with a college advisor for more information. </li></ul>\n<h3>Applying to the CS Major</h3>\n<p>The deadline to apply to the CS major in Fall 2017 is Friday, December 15. Please submit your application through our <a href=\"https://deptapps.eecs.berkeley.edu/csapp/apply?_ga=2.23581754.1632774253.1510781803-121387960.1502130460\" target=\"_blank\">online application portal</a>. Be sure to upload Double Major and Simultaneous Degree forms, if that is your path. The personal statement is optional, but should be included to strengthen the application for those who may be on the cusps of the GPA threshold. </p>\n<h3>Volunteer with Bair Lab</h3>\n<p>Hello! </p>\n<p>I&#39;m an administrator for the <a href=\"http://bair.berkeley.edu/\" target=\"_blank\">BAIR Lab</a> and <a href=\"https://deepdrive.berkeley.edu/\" target=\"_blank\">Berkeley DeepDrive</a>. Both of these labs are made up of graduate students, postdocs, researchers and faculty working in artificial intelligence (BAIR) and autonomous driving (Berkeley DeepDrive). </p>\n<p></p>\n<p>We will be having a workshop on Nov 28-30, 2017 at the California Memorial Stadium and we are looking for volunteer helpers. I&#39;m hoping you could send out this request to your members to see if they might be interested in volunteering for this event. <a href=\"https://doodle.com/poll/rtde8fhvmivtcpde\" target=\"_blank\">Volunteer Sign-up.</a> </p>\n<p></p>\n<p>Some of the tasks we need help with during the event are, running microphones during Q&amp;A sessions, helping with the set-up of the poster session, helping with the set up/break down for the event (on Nov 27th and Dec 1st) and other administrative tasks. Work shifts are at least two hours long. This event is a great opportunity to network with graduate students, researchers, and industry leaders. Please contact me with any questions. </p>\n<p></p>\n<p> Thank you so much for your assistance with this! </p>\n<p>Roxana,  BAIR/ BDD Admin Team </p>\n<p>510-643-3257 </p>\n<h3>Hiring Literacy or Math Mentors - Earn Work-Study or Units</h3>\n<p dir=\"ltr\">Are you interested in supporting local youth? The Public Service Center is hiring mentors to support K-5th graders in learning how to read or to work with middle school students on understanding math concepts.</p>\n<p> </p>\n<p dir=\"ltr\">Deadline:               Thursday, November 30</p>\n<p dir=\"ltr\">Pay:                        $13.75/hour with Work-Study or volunteer (Ed field study units also available)</p>\n<p dir=\"ltr\">Location:                Berkeley and Oakland Schools</p>\n<p dir=\"ltr\">Literacy Jobs:        <a href=\"http://publicservice.berkeley.edu/programs/build/\">http://publicservice.berkeley.edu/programs/build/</a></p>\n<p dir=\"ltr\">Math Jobs:             <a href=\"http://publicservice.berkeley.edu/programs/bridging-berkeley\">http://publicservice.berkeley.edu/programs/bridging-berkeley</a></p>\n<p> </p>\n<h3>BERC Hackathon</h3>\n<p dir=\"ltr\">Interested in putting your engineering skills to the test? Join the BERC Hackathon this Friday and Saturday for a chance to win some prizes!</p>\n<p dir=\"ltr\">Location: Berkeley Institute for Data Science, 190, Doe Library, Berkeley, CA 94720, USA. Time: 5:00-9:00</p>\n<p dir=\"ltr\">Calling all scientists, software engineers, policy makers, designers, and entrepreneurs - join us for the 5th annual BERC Cleanweb Hackathon! Teams have 24 hours to create new solutions to challenges in energy, environment, and climate, with a chance to win $2000 in cash prizes. Free food, beverages, and swag will be provided throughout the weekend.</p>\n<p dir=\"ltr\">Details and Registration:<a href=\"https://our-hacks.eventbrite.com/\"> https://our-hacks.eventbrite.com<br /></a>Prizes:<br /><br /></p>\n<p dir=\"ltr\">- 1st Place: $1000<br />- 2nd Place:  $750<br />- People’s Choice: $250<br /><br />Given recent political and environmental developments, teams are encouraged (but not required) to work on our Hackathon Themes:<br />- Data and Software for Environmental Justice <br />- Overcoming the Politics of Climate Change<br />- Breakthrough Technological Innovation<br /><br />What makes this hackathon different?</p>\n<p dir=\"ltr\">- Software beyond the startup: the goal is to solve problems with ideas that might not fit into a venture capital pitch (and if they do both, all the better!)<br /><br /></p>\n<p dir=\"ltr\">- People beyond the programmer: we are looking for technologists, policy experts, designers, and social scientists to join (or also be) software hackers.<br /><br />We will be holding a team formation and ideation session on the Friday evening at BIDS, so all you need to bring is yourself and your best ideas to begin building something incredible! You may also enter with a preformed team.</p>\n<p> </p>\n<h3> <a href=\"https://www.bradley.edu/challenge/\">NASA 3D-Printed Habitat Challenge</a></h3>\n<p dir=\"ltr\">Please see attached <a href=\"https://drive.google.com/a/berkeley.edu/file/d/0B-gDXENcUsFoenl3S20yWU03czhxYmhONkNidndja0RnaU9N/view?usp=sharing\">flyer</a> for more information.</p>\n<p> </p>\n<h3>2017 Undergraduate Student CRA Survey</h3>\n<p dir=\"ltr\">The Computing Research Association (CRA) is interested in career development among</p>\n<p dir=\"ltr\">students in computing fields. They would like to hear about your experiences as a</p>\n<p dir=\"ltr\">student, as well as your plans for the future. To that end, I encourage you to complete</p>\n<p dir=\"ltr\">their brief survey, which will take no more than 20 minutes to complete.</p>\n<p> </p>\n<p dir=\"ltr\">Should you decide to complete the survey, you will be entered into a raffle for a $100 gift card to Amazon! Please fill out no later than December 15th to be eligible for the drawing. </p>\n<p> </p>\n<p dir=\"ltr\">If you are interested in completing the survey, please click the link below, or copy and</p>\n<p dir=\"ltr\">paste the URL into your internet browser:</p>\n<p dir=\"ltr\"><a href=\"https://cerp.co1.qualtrics.com/jfe/form/SV_3UH7q6TmdZ8YRPD\">https://cerp.co1.qualtrics.com/jfe/form/SV_3UH7q6TmdZ8YRPD</a></p>\n<p> </p>\n<p dir=\"ltr\">The survey is being conducted by the CRA’s Center for Evaluating the Research Pipeline</p>\n<p dir=\"ltr\">(CERP). For more information on CERP, please visit their website: <a href=\"http://cra.org/cerp/\">http://cra.org/cerp/</a>.</p>\n<p> </p>\n<p><strong>Berkeley Data Science Panel 2017</strong></p>\n<p>Data Science Society at Berkeley&#39;s annual event: Berkeley Data Science Panel 2017 is happening on this upcoming Saturday, Nov 18th from 12:30pm-6:00pm, and I wonder if you can forward this information to all Computer Science Major students.<br /><br />The event is a great chance for student to learn from industrial leaders and network with professionals. This year&#39;s theme is <i><span style=\"text-decoration:underline\">Data Science &amp; Machine Learning in Multimedia &amp; Advertising</span></i>. We will bring 7 leading data scientists from companies like <i>Facebook, Adobe, Baidu, Spotify and Instagram, etc</i>. These speakers will share their research, insights, and findings.<br /><br />RESUME DROP will be available at the door. Statistics Major students can use promo code BERKELEYCS to get $10 discount.<br /><br />There will be 2 discussion sessions, followed by 2 networking sessions. Attendees will have the chance to talk with speakers in person. Food &amp; Beverage will be provided.</p>\n<p><strong></strong></p>\n<p><strong></strong></p>\n<p><strong></strong></p>\n<p><strong>Free College Prep for All | Tech Co-Founder Search, EECS Berkeley</strong></p>\n<p></p>\n<p>My name is Raul Aguilera. </p>\n<p></p>\n<p>We are working on a project to ensure every high school student, regardless of their background, has a fair shot at getting into the college of their choosing. You can read more about it on HackerNoon: https://hackernoon.com/open-source-sat-act-prep-project-9264313e3e1b </p>\n<p></p>\n<p> We are seeking a co-founder to co-lead the technical side of the initiative, as well as technical volunteers. We are hoping to create web based solutions for standardized test preparation, college admission and college success guidance. Our goal is to build services that go along with CollegePrep videos and tools useful to organizations (such as nonprofits, colleges, high schools guidance counselors, college success counselors, etc.). </p>\n<p></p>\n<p>Here&#39;s the form containing all the info and next steps for interested individuals: https://goo.gl/qpRwvQ</p>\n<p></p>\n<p>Also, we are actively recruiting for volunteer contributors to help with video content. Contributions are all virtual and can be as short as a 10-minute video (rough 10 questions)! Interested contributors can sign up via this form: https://goo.gl/UNT0H3 Please let us know if you have any questions for us.</p>\n<p></p>\n<p>Raul Aguilera, CollegePrep Co-Founder</p>\n<p>C: 650.485.1372</p>\n<p></p>\n<p dir=\"ltr\"><strong>Shadow the CEO of a Global Company: Apply to N Fellowship</strong></p>\n<p dir=\"ltr\">[N] Fellowship is a highly-selective, transformative summer experience that offers the unique chance for entrepreneurial engineers to work with a CEO and spark wide-scale technological innovations at large global companies.</p>\n<p></p>\n<p dir=\"ltr\">For 8-10 weeks, Fellows spend their summers abroad with the unprecedented opportunity to work directly with CEOs of billion dollar companies. N Fellowship (<a href=\"http://dmanalytics2.com/click?u=http%3A%2F%2Fwww.nfellowship.com%2F&amp;i=1&amp;d=4WspcES0SwOJ9jZkhzO1ig&amp;e=etempleton%40cs.berkeley.edu&amp;a=ReiJXodCRQmquPcNAznR2w\" target=\"_blank\">http://www.nfellowship.com/</a>) is a pioneering program, where every year, only 15 outstanding engineering students work on internal innovation projects, get a view from the top, identify key market opportunities and learn important managerial practices.</p>\n<p></p>\n<p dir=\"ltr\">Check out more detailed information in this <a href=\"http://dmanalytics2.com/click?u=https%3A%2F%2Fgoo.gl%2FZjCR3b&amp;i=2&amp;d=4WspcES0SwOJ9jZkhzO1ig&amp;e=etempleton%40cs.berkeley.edu&amp;a=ReiJXodCRQmquPcNAznR2w\" target=\"_blank\">One-Pager</a>. </p>\n<p dir=\"ltr\"><a href=\"http://dmanalytics2.com/click?u=https%3A%2F%2Fgoo.gl%2Fforms%2Fh14tkZ53DluFbVi02&amp;i=3&amp;d=4WspcES0SwOJ9jZkhzO1ig&amp;e=etempleton%40cs.berkeley.edu&amp;a=ReiJXodCRQmquPcNAznR2w\" target=\"_blank\">RSVP</a> to join an information session.</p>\n<p dir=\"ltr\"><a href=\"http://dmanalytics2.com/click?u=http%3A%2F%2Fwww.nfellowship.com%2Fapply&amp;i=4&amp;d=4WspcES0SwOJ9jZkhzO1ig&amp;e=etempleton%40cs.berkeley.edu&amp;a=ReiJXodCRQmquPcNAznR2w\" target=\"_blank\">Apply Now!</a></p>\n<p dir=\"ltr\">Applications close Friday, Jan 1 at 11:59PM PST</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\"><b><a href=\"https://english.berkeley.edu/courses/5575\" target=\"_blank\">English 166/6 - Special Topics: Speculative Fiction</a></b><br /></p>\n<ul><li>Date/Time: MW 1pm-2pm, &#43; discussion either F 10am-11am or F 1pm-2pm</li><li>Description: This course will examine in depth the history of speculative fiction and its engagement with the thematics and topoi of the new life sciences—representation of cloning, ecological dystopias, hybrid life-forms, genetic engineering dystopias. While science is the thematic point of departure of speculative fiction, the concerns of this course will be the literary. How does literature&#39;s encounter with the projected realities of the new biology revise our conceptions of the subject? Could there be a Leopold Bloom of the genetically engineered, a subject whose interior voice is the free-flowing expression of experience? Behind the endless removes of social, material, and technological mediation lies the construction of a flesh and blood body, separtated from itself through the workings of consciousness. If indeed the post/modern subject requires a psychic space shaped by the authenticity of &#34;being,&#34; a consciousness deeply rooted in the human experience, then how do we represent that being whose point of origin is the artificial, the inauthentic? These are some of the questions to be addressed in this course. You may of course bring others.  (Course #: 41411)</li></ul>\n<p dir=\"ltr\"></p>", "created": "2017-11-17T20:07:49Z", "subject": "WEEK 13: Undergraduate Announcements", "uid": "icdxydvnk125h8"}], "i_edits": [], "id": "ja4c6ltp35lvv", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 5587, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654550794490, "tag_good": [], "tag_good_arr": [], "tags": ["announcements", "cs-intended", "eecs", "events", "instructor-note", "lscs"], "type": "note", "unique_views": 549}