{"bookmarked": 2, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "ja8r2x375u559i", "type": "create", "uid": "icdxydvnk125h8", "when": "2017-11-20T22:15:56Z"}], "children": [], "config": {}, "created": "2017-11-20T22:15:56Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["other", "announcements"], "history": [{"anon": "no", "content": "<p></p><div>The <a href=\"http://bcnm.berkeley.edu/\" target=\"_blank\">Berkeley Center for New Media</a> is pleased to offer four undergraduate research fellowships for Spring 2018! Selected students will have the opportunity to work closely with new media graduate students on dissertation-level research. Each fellowship comes with a stipend of $1,000.</div>\n<div dir=\"ltr\">\n<div></div>\n<div>To apply, read the descriptions of projects below, then:</div>\n<div><ol><li>Write your name then the name of the project for which you are applying in the subject of the email (ex. Subject: Lara Wolfe - Zagat Gentrification)</li><li>Attach your resume</li><li>In the body of the email, write a paragraph expressing your interest in the position (don&#39;t forget to add any qualifications you may have)</li><li>Send to me at <a href=\"mailto:lara&#64;berkeley.edu\" target=\"_blank\">lara&#64;berkeley.edu</a></li></ol></div>\n<div>If you are interested in multiple projects, <span style=\"text-decoration:underline\">please send separate emails for each application</span>.</div>\n<div></div>\n<div>Applications are due on <b>December 1, 2017</b>.</div>\n<div></div>\n<div>Email me if you have any questions!</div>\n<div></div>\n<div>\n<div>\n<div dir=\"ltr\">\n<div>\n<div dir=\"ltr\">\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>Lara Wolfe</div>\nProgram Officer<br />\n<div></div>\n</div>\nBerkeley Center for New Media</div>\n426 Sutardja Dai Hall</div>\nUC Berkeley, CA 94720-1758<br /><a target=\"_blank\">(510) 495 3505</a><br />................................</div>\n<a href=\"http://bcnm.berkeley.edu/\" target=\"_blank\">bcnm.berkeley.edu</a></div>\n<a href=\"http://facebook.com/CalNewMedia\" target=\"_blank\">facebook.com/CalNewMedia</a></div>\n&#64;CalNewMedia</div>\n<div dir=\"ltr\"></div>\n<div dir=\"ltr\"><img src=\"https://ci3.googleusercontent.com/proxy/0Ync5tEScvUlt1c7j0G421AIBgEdyLmD9W9DbbmiNl-HFGCO0x-3MVPUw4mZLFgZ_SMmQZIzsClwDkB7KhGCfGqmIpTkkFUAtWmOnxsI7_82wBkdkfn38xLs34BPBlcs7CVaXBXPuUG_3Ro1ASF3s1xg3P6FwhLBvABCqs-4efl32ZAKVd_ACIVTBgCNhJT-CCBdT_s2mH2LHXQ=s0-d-e1-ft#https://docs.google.com/uc?export=download&amp;id=0ByUVoJdWKK6IMUFzbzdBa1Fyd1U&amp;revid=0ByUVoJdWKK6IMmQyM293eVhDUWVoY3dwRGdiWjRNVnFNb0gwPQ\" /></div>\n</div>\n<div dir=\"ltr\"></div>\n<b><span style=\"text-decoration:underline\">Projects for Undergraduate Research Fellowship<br /></span></b><br /><br /><span style=\"text-decoration:underline\">Project One: Exploring Alternative Ways of Knowing the Body through Data-Responsive Wearable Displays</span></div>\n<div dir=\"ltr\"></div>\n<div dir=\"ltr\">My research investigates alternative ways of knowing the body with data, beyond Quantified Self. Drawing from speculative and critical design approaches, I design and prototype data-responsive wearables and study the experiences and interpretations of participants who wear these prototypes throughout daily life. These designs seek to unsettle and challenge normative assumptions of self-improvement and emotional wellness. In particular, I explore how shirts with patterns that change color in response to skin conductance data—which is associated with various kinds of emotional excitement—can support emotional reflection for some or aggravate emotional insecurities for others. Grounding these speculative/critical designs in the everyday experiences of real people contributes nuance and empirical diversity to questions of how bodily data influences conceptions of self and emotional wellness.</div>\n<div dir=\"ltr\">\n<div dir=\"ltr\"></div>\n<div dir=\"ltr\">An undergraduate assistant would primarily assist with prototype implementation, with additional opportunities to contribute to design, user studies, analysis, and writing according to their interests. For prototype implementation, tasks would be e-textiles related: (i) programming a microcontroller such as Arduino, (ii) designing/building circuits on breadboards, perfboards, and perhaps PCBs, and (iii) integrating with clothing through soldering to threads, hand sewing, and machine sewing. The primary need on this project is for assistance with making a prototype robust enough to withstand daily wear on the body, but the role is flexible to accommodate student interests and desire for learning and growth. Additional participation could include design ideation, brainstorming, and sketching; developing interview questions and conducting user studies; qualitative analysis of user studies; researching related work in the field; and academic writing.</div>\n</div>\n<div dir=\"ltr\"><br /><br /><span style=\"text-decoration:underline\">Project Two: Gourmet Gentrification? Restaurant Reviews and Neighborhood Change in New York and San Francisco (1987-2017)<br /></span><br />\n<div>I am looking for an undergraduate interested in studying American cities, informational technologies, and cultures of consumption, understanding dynamics of gentrification and income stratification, and using digital humanities techniques like creating interactive web maps of historical data on gourmet restaurants in New York and San Francisco. This research opportunity is part of my dissertation project on the development of digital location-based services (LBS) like Yelp, Foursquare, Google Local, and TripAdvisor, and their role in shaping urban consumption spaces and neighborhood trajectories over time. Theorists of gentrification and other urban scholars have long considered the spread of upscale amenities like cafes, bars, and restaurants to be important visual indicators of gentrification. A number of authors, from urban geographer Neil Smith to sociologists Sharon Zukin and Sylvie Tissot have demonstrated how new businesses are themselves spurs to further change, in an unfolding dialectic of rising cultural and real estate capital. In my work, I examine evolving informational networks, from paper guidebooks to mobile applications, and their interaction with broader trends in urban development and sociospatial segmentation. </div>\n<div></div>\n<div>While today information about the city is continuously produced and shared on millions of smartphones, at the scale of Big Data, by taking a broader view, I aim to understand the historical context in which these practices took shape. The corpus we will be working with consists primarily of two series of printed guidebooks, the Zagat Survey series (from approximately 1987-2017) and the Michelin Guide (from 2007-2017) with a potential to include data from digital location-based services via APIs should time allow. The analysis will also have a qualitative component, involving a close reading of the content of the guidebooks with an eye towards the discursive construction of the city as a whole and individual neighborhoods, particularly explicit or coded references to gentrification, crime, revitalization, change, racial and ethnic difference, and inter-group conflict. In order to share the results of our research beyond academia, and to spur additional work by scholars and activists studying gentrification, social media, food studies, and related fields, we will publish a freely accessible online map of our results. Our map will consist of a variety of data layers, showing the underlying restaurant data along a time slider, along with demographic and other local data for comparison. The undergraduate research assistant will be involved in all phases of data collection, cleaning, analysis, and visualization, giving them a hands-on opportunity to contribute to an ongoing research project.</div>\n<div></div>\n<br /><span style=\"text-decoration:underline\">Project Three: Auditory Representations of Data<br /></span><br />\n<div>I am working on exploring auditory representations of data (data sonification). I am exploring how to represent complex data in intuitive ways: how could an auditory dashboard work? Could we make auditory representations of data that are akin to the New York Times interactive infographics? With the rise of virtual assistants in our daily lives (Siri, Alexa, Google Home), there is a need for best practices for data sonification for these smart speakers.</div>\n<div> </div>\n<div>This role would allow a student research assistant to explore user research, while helping to facilitate user interviews and analyze results. On a day to day basis, this student&#39;s research role would be helping with the logistics of user research (scheduling, setting up equipment, note taking, and hopefully facilitating a few interviews if they are comfortable), as well as analyzing the results with me after. If they start early enough, they could also help me explore designs to test; if there&#39;s enough time too, the student might be able to iterate on the designs and do another round of testing.</div>\n<div dir=\"ltr\"></div>\n<br /><span style=\"text-decoration:underline\">Project Four: Music, Improvisation, &amp; Ethnography<br /></span><br />The assistant would be responsible for the transcription of field recordings of conversations between the researcher and ethnographic subjects, collected during fieldwork over the past several years. More specifically, the recordings are conversations that occur in the context of the researcher asking musicians to play with an interactive music system designed to listen, respond, and play like a human musician and subsequently asking the musician to evaluate and offer critical feedback on how the system behaves. The transcription task allows the assistant to become well-versed in the techniques of conversation analysis (CA) research, a research tradition widely used in the fields of sociolinguistics, linguistic anthropology, and related fields. For each recording, the assistant is to produce two texts: 1) a transcription according to CA conventions, notating pauses, simultaneous speech, and other typical features of conversation, and 2) a &#34;legible&#34; text, one without the CA conventions and more easily readable for a typical scholarly audience unfamiliar with the conventions of CA.<br /><br />In addition to providing the student with an introduction to the basics of CA research, this project also allows the student to become familiar with research in human-computer, musical, and social interaction research. While the topic of the overall project is music, this is a great way to develop an interest in social-science research generally, whether the student&#39;s ultimate interests are in technology, music, or other topics central to this project. The student researcher is not at all responsible for transcribing the musical element of the recordings, but verbal descriptions/notes of these passages of the recordings will be appreciated! Last but not least: German language proficiency is preferred, but not required, as several of these sessions were at least partially conducted in German.</div>\n</div>\n</div>\n</div>", "created": "2017-11-20T22:15:56Z", "subject": "Undergraduate New Media Research Opportunity", "uid": "icdxydvnk125h8"}], "i_edits": [], "id": "ja8r2x33fwb59h", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 5599, "num_favorites": 1, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654550716886, "tag_good": [], "tag_good_arr": [], "tags": ["announcements", "instructor-note", "other"], "type": "note", "unique_views": 452}