{"bookmarked": 3, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "ja8u2ebj71p1lk", "type": "create", "uid_a": "a_0", "when": "2017-11-20T23:39:30Z"}, {"anon": "no", "data": "ja8wn7vz2fn6ln", "to": "ja8u2ebgd3w1lj", "type": "i_answer", "uid": "gxj8rtteeuaa9", "when": "2017-11-21T00:51:41Z"}, {"anon": "stud", "data": "ja8wx0vwdpj5e3", "to": "ja8u2ebgd3w1lj", "type": "s_answer", "uid_a": "a_1", "when": "2017-11-21T00:59:19Z"}, {"anon": "stud", "data": "ja8wylkv27q6e8", "type": "s_answer_update", "uid_a": "a_1", "when": "2017-11-21T01:00:32Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2017-11-21T00:51:41Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "no", "content": "<p>The real question is &#34;why?&#34; The lower-division is prereq to the upper-division for good reason, because it helps build the maturity required to understand what is going on as well as providing certain foundational knowledge/skills to build upon. The goal isn&#39;t to survive the upper-division, it is to thrive there and learn a lot.</p>\n<p></p>\n<p>There are plenty of technical courses that can/should be taken while you finish the six lower-div prereqs. For example, lower-division courses in Physics or other sciences. If you have spare cycles, you can also give back by joining course staff or CS Mentors and support 16A, 61A, and 61B. All that will make you stronger.</p>\n<p></p>\n<p>In rare cases when a student already has the maturity, then depending on the kind of maturity, the question you are asking resolves to the knowledge being assumed. This seems to be where your question is coming from. Now, if you already have a lot of mathematical maturity, then you can just try to take 16B and 70 concurrently. So in that case, the question you are asking has an obvious answer: take 70. The fact that you are still asking suggests that you consider yourself extra mature/strong in some dimension other than the mathematical maturity one. This is tricky.</p>\n<p></p>\n<p>In general, this leaves three major maturity dimensions related to this department: software design maturity,  hardware design/analysis maturity, and physics maturity. Taking any non-mathy software-oriented course without 61C under your belt is probably not a great idea. But if you&#39;ve got a lot of prior background (and you find 61B a breeze), then that could be possible. On the hardware side, if you have the background, then it might be possible to take 105 in parallel with 16B. This is especially true since the lecture/discussion content on circuits is largely limited to the first few weeks of 16B. (Lab skills keep getting exercised throughout however, so this assumes you are strong in lab from other experiences in your background...) If you already have strong physics/chemistry (and at least a vague understanding of probability), then 130 also might be possible. 130 will lean less on the material in 16B than 105 will. Especially if you are willing to self-study a bit ahead regarding the first couple of weeks of 16B. </p>\n<p></p>\n<p>I hope this answer helps, but the right answer probably remains to not take upper-division courses until your lower-division is completed. </p>", "created": "2017-11-21T00:51:41Z", "subject": "", "uid": "gxj8rtteeuaa9"}], "id": "ja8wn7vtl486lm", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "j52tuayf2uf7om", "name": "Dev Ojha", "photo": "1504021332_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/j52tuayf2uf7om/1504021332_35.png", "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["j52tuayf2uf7om"], "type": "i_answer"}, {"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2017-11-21T00:59:19Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>You can try taking CS 186 next semester. I know the class lists CS 61C as one of its prerequisites but the content required from 61C is extremely minimal (plus you are taking it concurrently anyway). If you were comfortable with 61B, then I can be fairly certain 186 shouldn&#39;t be too difficult for you.</p>", "created": "2017-11-21T01:00:32Z", "subject": "", "uid_a": "a_1"}, {"anon": "stud", "content": "<p>You can try taking CS 186 next semester. I know the class lists CS 61C as one of its prerequisites but the content required from 61C is very minimal. If you were comfortable with 61B, then I can be fairly certain 186 shouldn&#39;t be too difficult for you.</p>", "created": "2017-11-21T00:59:19Z", "subject": "", "uid_a": "a_1"}], "id": "ja8wx0vv9qk5e2", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}], "config": {}, "created": "2017-11-20T23:39:30Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["enrollments"], "history": [{"anon": "stud", "content": "<p>Can anyone recommend some good upper div courses to take based on the following information?: </p>\n<p></p>\n<p>I took 61B and 16A this semester.  I am taking 61C and 16B next semester but I won&#39;t be taking 70 until summer.  This makes it hard to find a good course to take since some combination of the latter are almost unilaterally prereqs for all EECS courses.  </p>\n<p></p>\n<p>160 is full and I am not especially interested in 184.  168 is not offered this Spring.  I am basically looking for courses which have &#34;soft&#34; prereqs where the instructor teaches us what we need to know from the prereq or it can be taken concurrently (with 61C, 16B, and/or 70) and I will be ok.  </p>", "created": "2017-11-20T23:39:30Z", "subject": "Upper Div EECS Course  - Questions about prereqs", "uid_a": "a_0"}], "i_edits": [], "id": "ja8u2ebgd3w1lj", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 5601, "num_favorites": 1, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654550719173, "tag_good": [], "tag_good_arr": [], "tags": ["enrollments", "student"], "type": "question", "unique_views": 541}