{"bookmarked": 5, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "jayccns1gg471z", "type": "create", "uid": "hkyddknu435n5", "when": "2017-12-08T20:05:37Z"}, {"anon": "no", "data": "jayinjlo481kx", "type": "update", "uid": "icdxydvnk125h8", "when": "2017-12-08T23:02:02Z"}, {"anon": "no", "data": "jb8jtxma5v75i", "type": "update", "uid": "hkyddknu435n5", "when": "2017-12-15T23:32:42Z"}], "children": [], "config": {}, "created": "2017-12-08T20:05:37Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements"], "history": [{"anon": "no", "content": "<p></p>\n<div>\n<div><span style=\"font-family:&#34;Arial&#34;;color:#000000\">Dear Students,</span></div>\n<div><span style=\"font-family:&#34;Arial&#34;;color:#000000\"> </span></div>\n<div><span style=\"font-family:&#34;Arial&#34;;color:#000000\">It&#39;s finals week! You&#39;re all almost done. Best of luck! Another semester has ended and you all should be super proud of yourselves. Enjoy your winter break!</span></div>\n<div><span style=\"font-family:&#34;Arial&#34;;color:#000000\"> </span></div>\n<div><span style=\"font-family:&#34;Arial&#34;;color:#000000\"><img src=\"https://mail.google.com/mail/u/0/?ui=2&amp;ik=adb3d3468b&amp;view=fimg&amp;th=16037ba5913f483a&amp;attid=0.0.3&amp;disp=emb&amp;realattid=ii_16036ff1e68d8ddb&amp;attbid=ANGjdJ9pY6_5e5jWEiJE1fNXPLjIfz2qGBWkYUEqSceEXutbm6eHwev_MpNAvUEaRFaVOh0BaPyzI6sxaBJ-K5ZLZGjJRfU4X1HIDScComSIjZzCNCcTi2hNCQ8VtDE&amp;sz=w714-h476&amp;ats=1512763452733&amp;rm=16037ba5913f483a&amp;zw&amp;atsh=1\" alt=\"Inline image 1\" width=\"357\" height=\"238\" /><br /></span></div>\n</div>\n<div>\n<p>EECS De-Stress Week<b></b></p>\n<p>This RRR week was filled with many fun events lead by our amazing student organizations. We hope you were able to attend and de-stress! There&#39;s one final event happening next week: IEEE will be providing breakfast outside some of the 8am finals, we hope you are one of those lucky students!</p>\n<p><b> <img src=\"https://mail.google.com/mail/u/0/?ui=2&amp;ik=adb3d3468b&amp;view=fimg&amp;th=16037ba5913f483a&amp;attid=0.0.1&amp;disp=emb&amp;realattid=ii_jassx3jc2_16023c47d92d6f22&amp;attbid=ANGjdJ-JgUw9_M6WA0esXqqo5MdM4y4HvVJIPjIHfvHBJolJVOp-NPIYRiqiEMu07-zfnKuNAxUU1uJ7OeASj1_GTqBUx7sRlX_5RSrw7Fs96LZCTvNeHNgm0lV6Bp4&amp;sz=w1470-h1100&amp;ats=1512763452734&amp;rm=16037ba5913f483a&amp;zw&amp;atsh=1\" width=\"735\" height=\"550\" /><br />​</b></p>\n<p>Help the EECS Department &amp; Win Amazon Gift Cards!</p>\n<p>Hi everyone!</p>\n<p>Want to have your voice heard by EECS faculty, staff, and the Chairs?</p>\n<p>HKN and other EECS student organizations have composed the 2017-18 EECS Undergraduate Survey so you can provide input and feedback to our very own EECS Department. This is a great opportunity for you to make a real impact in your classes, student life, and campus culture. Your thoughts <i>will </i>reach faculty and will be used to help improve the department and the community!</p>\n<p>In addition, once you complete the survey, you can choose to enter a prize drawing to win one of fifteen (15) $10 Amazon gift cards!</p>\n<p>Your response is completely anonymous. We encourage you to respond openly and honestly!</p>\n<p>The survey is available here:</p>\n<p><a href=\"https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5\" target=\"_blank\">https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5</a></p>\n<p><b> </b></p>\n<p>TreeHacks 2018</p>\n<p>My name is Sara Frigui and I&#39;m excited to announce that TreeHacks 2018 applications are now open. TreeHacks is Stanford&#39;s annual national 36-hour hackathon and is expected to have hundreds of participants from colleges all over the world and will take place at Stanford from <b>February 16 to February 18, 2018.</b></p>\n<p>We aim to challenge underrepresentation in the tech field. We encourage you all to apply by <b>December 9th.</b><br /><br />Feel free to contact Sara Frigui at <b><a href=\"mailto:sfrig01&#64;stanford.edu\" target=\"_blank\">sfrig01&#64;stanford.edu</a></b> or <b><a target=\"_blank\">502-939-1579</a> </b>if you have any questions.</p>\n<p></p>\n<p>2017 Undergraduate Student CRA Survey </p>\n<p>The Computing Research Association (CRA) is interested in career development among students in computing fields. They would like to hear about your experiences as a student, as well as your plans for the future. To that end, I encourage you to complete their brief survey, which will take no more than 20 minutes to complete.</p>\n<p><b><i>Should you decide to complete the survey, you will be entered into a raffle for a $100 gift card to Amazon! Please fill out no later than December 15th to be eligible for the drawing. </i></b></p>\n<p>If you are interested in completing the survey, please click the link below, or copy and</p>\n<p>paste the URL into your internet browser:</p>\n<p><a href=\"https://cerp.co1.qualtrics.com/jfe/form/SV_3UH7q6TmdZ8YRPD\" target=\"_blank\">https://cerp.co1.qualtrics.com/jfe/form/SV_3UH7q6TmdZ8YRPD<br /></a></p>\n<p>The survey is being conducted by the CRA’s Center for Evaluating the Research Pipeline</p>\n<p>(CERP). For more information on CERP, please visit their website: <a href=\"http://cra.org/cerp/\" target=\"_blank\">http://cra.org/cerp/</a>.</p>\n<p>  </p>\n<p>UC Davis Collegiate Hackathon</p>\n<p>For those of you interested in making awesome projects with your programming skills to solve social issues, you should definitely apply to <a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=http%3A%2F%2Fhackdavis.io%2F\" target=\"_blank\">HackDavis</a>!</p>\n<p><b>HackDavis</b> is a 24-hour long coding event, taking place on <b>January 20th - 21st, 2018</b>, that helps address some of the world&#39;s most pressing issues related to the Environment, Health &amp; Wellness, and Education. </p>\n<p>This event is <b>free</b> for all admitted participants and people of <b>all programming levels</b> are welcome. During the event we will have free food and swag, and participants will also have access to mentors from many different companies who will host workshops and help guide them. A hackathon is an amazing opportunity to challenge yourself to learn something completely new such as making a web server, controlling a drone, or even reading brain waves! Last year, a team combined an Arduino, motion sensors, and light controls to create a device that automatically shuts off the lights when no one is in the room. </p>\n<p>Applications are <b>open now </b>at <a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=http%3A%2F%2Fhackdavis.io\" target=\"_blank\">hackdavis.io</a> and are due by <b>December 31st at 11:59pm</b>. Feel free to contact us at <a href=\"mailto:team&#64;hackdavis.io\" target=\"_blank\">team&#64;hackdavis.io</a> if you have any questions.</p>\n<p>Check HackDavis out on social media:</p>\n<p><a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=https%3A%2F%2Fwww.facebook.com%2Fevents%2F376865076091009%2F\" target=\"_blank\">Event Page</a></p>\n<p><a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=https%3A%2F%2Fwww.facebook.com%2FHackDavis%2F\" target=\"_blank\">Facebook</a></p>\n<p><a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=https%3A%2F%2Fwww.instagram.com%2Fhackdavis%2F\" target=\"_blank\">Instagram</a></p>\n<p><a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=https%3A%2F%2Ftwitter.com%2Fhack_davis%3Flang%3Den\" target=\"_blank\">Twitter</a></p>\n<p></p>\n<p><a href=\"https://medium.com/&#64;HackDavis\" target=\"_blank\">Medium</a></p>\n<p> </p>\n<p>Career Opportunities at HRL Laboratories in Malibu, CA</p>\n<p>HRL Laboratories LLC in Malibu, CA is recruiting outstanding young scientists and engineers for an exciting project at the frontier of science and technology. In particular, we are looking for graduating seniors, recent graduates, and graduate students who are interested in working in an industrial laboratory setting on research utilizing nanoscale quantum-effect devices at cryogenic temperatures.  Individuals at the Bachelor’s, Master’s, and PhD level who have completed rigorous training in physics, applied physics, or electrical engineering are encouraged to apply to join our team at HRL.  These openings are not internships; candidates are expected to work full time for at least one year and preference is given to those who have more long-term interests.  Previous laboratory experience with low noise electrical measurements, nanoscale electronic devices, and cryogenics is desirable, but good scientific communication skills, a strong work ethic, and a natural scientific curiosity are required.  In addition, US citizenship is required and applicants must be willing to apply for a security clearance. Please email me at <a href=\"mailto:mtrakher&#64;hrl.com\" target=\"_blank\">mtrakher&#64;hrl.com</a> directly for more information.</p>\n<p> </p>\n<p>Undergraduate research opportunity for EECS majors </p>\n<p>The Pines lab is looking for motivated undergraduates to participate in cutting edge NMR methodology research. Six Nobel prizes have been awarded for discoveries over the course of the past century that have enabled NMR and MRI in becoming the revolutionary tools they are today. Our research aims to improve established industrial equipment and technology.  We are performing spectroscopy of a defect in diamond called the nitrogen vacancy (NV) center, making use of it to &#34;<i>hyperpolarize</i>&#34; and detect spins through <i>optical</i> means, providing signal amplification by over 5 orders of magnitude, <i>without</i> the need for a magnet. The technological implications are compelling: taking MRI/NMR to the desktop and wearables, microfluidic chip biosensors, revolutionary tools in catalysis and surface science, and in-vivo medical diagnostics, and paradigm-changing applications to spin-based quantum computing and spintronics.</p>\n<p> </p>\n<p>Here is a link to our youtube video on our technique:</p>\n<p><a href=\"https://www.youtube.com/watch?v=rF1g5TDP9WY\" target=\"_blank\">https://www.youtube.com/watch?v=rF1g5TDP9WY</a></p>\n<p></p>\n<p>If you are interested please email <a href=\"mailto:ashokaj&#64;berkeley.edu\" target=\"_blank\">ashokaj&#64;berkeley.edu</a></p>\n<p><img src=\"https://mail.google.com/mail/u/0/?ui=2&amp;ik=adb3d3468b&amp;view=fimg&amp;th=16037ba5913f483a&amp;attid=0.0.2&amp;disp=emb&amp;realattid=ii_160277414acd2a92&amp;attbid=ANGjdJ_JocmZaiAHxZ79IybYKVAEJ9BGOx5fhLQAoEaZl6fow8yLw7vk0u95hPOOCeHeXPf4b-BGJB8KK1QUP_BWUY7wPxnfwkEDMbPYm8bZv0zy_9-4PVb6H0P34Sg&amp;sz=w686-h572&amp;ats=1512763452738&amp;rm=16037ba5913f483a&amp;zw&amp;atsh=1\" alt=\"Inline image 1\" width=\"343\" height=\"286\" /></p>\n</div>\n<div>\n<div></div>\n<div>\n<p>Scholarships</p>\n<p>Introducing an exciting scholarship opportunity! For more information, please be sure to check out our <a href=\"https://www.livecareer.com/education-opportunities\" target=\"_blank\">scholarship page</a> for full details!</p>\n<p>1.    We will be awarding three scholarships of $1,500 each</p>\n<p>2.    We are asking students to write an original essay of between 200-800 words on the following: &#34;What personal/educational accomplishment would you be more proud to share with your future employers and why?&#34;</p>\n<p>3.    Students MUST also include the following to be eligible: full name, email, date of birth, mailing address, phone number, and school they&#39;re attending. All essays must be submitted through form-field found on <a href=\"https://www.livecareer.com/education-opportunities\" target=\"_blank\">https://www.livecareer.com/education-opportunities</a></p>\n<p>4.    The last day to enter is February 28, 2018 11:59:59 PM PST</p>\n<p>Please share this link to our <a href=\"https://www.livecareer.com/education-opportunities\" target=\"_blank\">scholarship page</a> so students at Berkeley can participate in this opportunity for financial aid! We greatly value education and understand it&#39;s not always easy to find the funds to pay for school, which is why we&#39;re so excited about our annual scholarship program.</p>\n<p> </p>\n<p>Jacobs Institute Innovation Catalysts</p>\n<p>The Jacobs Institute Innovation Catalysts, made possible by the Eustace-Kwan Family Foundation, is a new student grant program that provides an avenue for these ambitious student innovators to unlock further potential in their projects. </p>\n<p>Berkeley students are invited to propose projects that they aim to develop over the course of a semester. Selected grantees will work on their projects in the spring semester, with the support of resources from the <a href=\"http://jacobsinstitute.berkeley.edu/\" target=\"_blank\">Jacobs Institute</a> and <a href=\"http://invent.citris-uc.org/\" target=\"_blank\">CITRIS Invention Lab</a>, and as part of a cohort of fellow student innovators. </p>\n<p>Two types of grants will be awarded through the Innovation Catalysts program: </p>\n<p>·  <b><i>Ignite grants</i></b> are for in-progress projects, with existing prototypes and demonstrated potential for impact. Up to $2000 will be awarded for each project. </p>\n<p>·  <b><i>Spark grants</i></b> are for early-stage projects or ideas. Up to $500 will be awarded for each project. </p>\n<p>For more information about the Innovation Catalysts program and application process, <a href=\"http://jacobsinstitute.berkeley.edu/the-jacobs-institute-innovation-catalysts/\" target=\"_blank\">visit the program webpage</a>. There is an <b>info session this Friday, December 8th 12-1pm in 220 Jacobs Hall</b>; you can also contact me at <a href=\"mailto:amydinh&#64;berkeley.edu\" target=\"_blank\">amydinh&#64;berkeley.edu</a> with questions.</p>\n<p></p>\n<p>Applications for the inaugural spring 2018 cohort are <b>due Wednesday, December 20th</b>. <a href=\"https://goo.gl/forms/rsUcMYacB85B3Muq2\" target=\"_blank\">Sign up for important announcements and deadlines here</a>.</p>\n<p> </p>\n<p>Physiologic Informatics Research Opportunity at UCSF: Students and Recent Grads</p>\n<p></p>\n<p>Join a team of physicians and engineers developing clinical decision support tools to reduce preventable deaths caused by sepsis and patient discharge errors. This NIH funded project involves predictive analysis of EHR (electronic health record) data through machine learning. Students interested in a long-term, self-directed research opportunity in preparation for medical or graduate school, or for an undergraduate thesis, are encouraged to apply for Spring 2018. We also have full-time opportunities, effective immediately, for recent graduates, such as those taking a gap year prior to graduate or medical school.</p>\n<p></p>\n<p>We have clinical, regulatory, statistical algorithm development, programming, and peer-review manuscript writing opportunities available. Students must be able to make a substantial commitment to this position during the spring semester and work full-time on this project throughout the summer. Recent graduates must be able to work full time for a minimum of 6 months.</p>\n<p></p>\n<p>If this sounds interesting, apply here (this takes less than 10 minutes!): <a href=\"https://phys-inf.typeform.com/to/zh9Yd9\" target=\"_blank\">https://phys-inf.typeform.com/to/zh9Yd9</a>. We will be accepting applications until the positions are filled, so apply early!</p>\n<p>For further information, please email Prof. Chris Barton (<a href=\"mailto:chris.barton&#64;emergency.ucsf.edu\" target=\"_blank\">chris.barton&#64;emergency.ucsf.edu</a>).</p>\n<p> </p>\n<p>Division of Data Science Opportunities</p>\n<p>The Division of Data Science student teams have opportunities available for Spring 2018! We are recruiting for a wide range of different roles including data science research, communications and marketing strategy, video and media production, applied data science, software engineering, and curriculum development.</p>\n<p></p>\n<p>To get involved, <a href=\"https://goo.gl/TMLNuY\" target=\"_blank\">apply here</a>! Our first round of recruitment runs through December 9th. Candidates who apply in this period will receive higher priority.</p>\n<p></p>\n<p>We will also be showcasing the work of the student teams this semester at our Fall 2017 Data Science Showcase on Thursday, December 7th from 3PM - 5PM in Moffitt 405!</p>\n<p></p>\n<p></p>\n<p>If you have any questions about the student teams application, please email us at <a href=\"mailto:dsep_recruit&#64;berkeley.edu\" target=\"_blank\">dsep_recruit&#64;berkeley.edu</a>.</p>\n<p> </p>\n<p>Demography Courses: Social Networks</p>\n<p><span style=\"text-decoration:underline\">Demography 180: Social Networks</span></p>\n<p>Professor Dennis Feehan <br />Spring 2018</p>\n<p>Class meetings Tu/Th 11am-12.30pm, 141 McCone<br />Class number: 41045<br /><a href=\"http://dennisfeehan.org/teaching/2018sp_demog180.html\" target=\"_blank\">http://dennisfeehan.org/teaching/2018sp_demog180.html</a></p>\n<p>Overview</p>\n<p>The science of social networks focuses on measuring, modeling, and understanding the different ways that people are connected to one another. In this class, we will use a broad toolkit of theories and methods drawn from the social, natural, and mathematical sciences to learn what a social network is, to understand how to work with social network data, and to illustrate some of the ways that social networks can be useful in theory and in practice. We will see that network ideas are powerful enough to be used everywhere from CDC and UNAIDS, where network models help epidemiologists prevent the spread of HIV, to Silicon Valley, where data scientists use network ideas to build products that enable people all across the globe to connect with one another.</p>\n<p><span style=\"text-decoration:underline\">Demography 260: Social Networks</span></p>\n<p>Professor Dennis Feehan <br />Spring 2018</p>\n<p>Class meetings Wednesdays, 2-5pm, Demography Seminar Room (2232 Piedmont Avenue, room 100)<br />Class number: 23375<br /><a href=\"http://dennisfeehan.org/teaching/2018sp_demog260.html\" target=\"_blank\">http://dennisfeehan.org/teaching/2018sp_demog260.html</a></p>\n<p>Overview</p>\n<p>This course provides a broad introduction to the empirical and theoretical study of social networks. We will cover classic and contemporary studies, beginning with fundamental definitions and models, and then moving through a range of topics, including models of network formation and structure (homophily, foci, communities); dynamic processes on networks (contagion, influence, and disease models); collaborative networks; personal networks; online networks; and network sampling and data collection. The course material is intended to be of interest to students from a wide range of disciplinary backgrounds, including demography, sociology, statistics, computer science, and related fields.</p>\n<p> </p>\n<p>2018 Santa Clara Valley SWE (SWE-SCV) Scholarship Applications: NOW OPEN</p>\n<p>The Santa Clara Valley SWE scholarship applications for 2018 are now open. <b><i><span style=\"text-decoration:underline\">The deadline is December 23, 2017</span></i></b>. Winners will be notified in late February and honored at our scholarship luncheon in early March (the schedule is two months earlier this year: we moved it based on feedback from prior applicants and recipients).</p>\n<p><b>The scholarship application process for college school year 18-19 opened on November 16, 2017. Applications are welcome for the 18-19 college school year. Due date is earlier than prior years.  </b></p>\n<p><b>For details, see <a href=\"http://www.swescv.com/scholarships/application\" target=\"_blank\">2018 Scholarship Application</a></b></p>\n<p>Society of Women Engineers (SWE), founded in 1950, is a not-for-profit organization that supports professional and collegiate female engineers through professional development and career guidance programs. The organization has a goal to encourage more females in the field of engineering and technology through scholarships and outreach programs.</p>\n<p>Each year the Santa Clara Valley section of SWE awards several scholarships, primarily on the basis of scholastic achievement, motivation and interest in engineering demonstrated in the application form. We also provide need-based scholarships. We would greatly appreciate if you can help us inform qualified candidates about this scholarship program.</p>\n<p><b>2018 SWE-SCV Scholarships (School Year 2018-19)</b></p>\n<p>Scholarship recipients will be awarded $1,000 to $2500 for tuition expenses. Read more about our scholarship namesakes below.</p>\n<p>·  <a href=\"http://www.swescv.com/scholarships/scholarship-descriptions\" target=\"_blank\">Irmgard Flugge-Lotz Scholarship</a></p>\n<p>·  <a href=\"http://www.swescv.com/scholarships/scholarship-descriptions\" target=\"_blank\">Al Gardner Scholarship</a></p>\n<p>·  <a href=\"http://www.swescv.com/scholarships/scholarship-descriptions\" target=\"_blank\">Mary G. Ross Scholarship</a></p>\n<p>·  <a href=\"http://www.swescv.com/scholarships/scholarship-descriptions\" target=\"_blank\">Esther Williams Scholarship</a></p>\n<p>·  <a href=\"http://www.swescv.com/scholarships\" target=\"_blank\">Mary Nell Rogers</a></p>\n<p><b>Student Eligibility Requirements</b></p>\n<p>Female high school seniors, college and graduate students pursuing a BS and/or MS in engineering or computer science are eligible for these scholarships, <b>as well as community college students</b> pursuing a path to those fields. Students should be enrolled full time and attend college that has ABET or CSAB accredited engineering programs. Other interdisciplinary engineering or computer science programs may qualify as well. If you program is one of these, please write <a href=\"mailto:SWE_SCV_Scholarships&#64;yahoo.com\" target=\"_blank\">SWE_SCV_Scholarships&#64;yahoo.com</a> to find out if your program is accepted. <br /><br />Applicants must be a permanent resident of or attend school in the South San Francisco Bay Area, which are located in the following zip codes: 94002-94003, 94010-94011, 94018-94028, 94030, 94035, 94037-94043, 94059-94065, 94070-94071, 94074, 94086-94091, 943**, 944**, 94536-94546, 94552, 94555, 94557, 94560, 94587, 950**, 951**</p>\n<p><b>The Scholarship Application Process</b></p>\n<p>Please read the <a href=\"http://www.swescv.com/scholarships/application\" target=\"_blank\">Tips for Success</a> (see files on that page) and <a href=\"http://www.swescv.com/scholarships/scholarships-faq\" target=\"_blank\">Frequently Asked Questions</a> before beginning the application. Personal and financial information will be held in strict confidence. If a question does not apply, indicate “N/A.” If you need more space to answer questions, please leverage the &#34;comments&#34; section.<br /><br />Please note that your application is not complete until the scholarship committee has received the following, via the JotForm link upload (see notes on <a href=\"http://www.swescv.com/scholarships/application\" target=\"_blank\">2018 Scholarship Application</a>:)  </p>\n<p>·  Completed application (follow links to download <a href=\"http://www.swescv.com/scholarships/application\" target=\"_blank\">application </a>(see files at bottom of that page) and <a href=\"https://docs.google.com/viewer?a=v&amp;pid=sites&amp;srcid=ZGVmYXVsdGRvbWFpbnxzd2VzY3YyfGd4OmVlZTJhOWRhMzY1NWRmMg\" target=\"_blank\">resume template</a></p>\n<p>·  Two (2) letters of recommendation  (these can be uploaded via JotForm Application OR sent separately by email from the recommender directly to<a href=\"mailto:SWE_SCV_Scholarships&#64;Yahoo.com\" target=\"_blank\">SWE_SCV_Scholarships&#64;Yahoo.com</a>)</p>\n<p>·  Standardized test score(s)  (high school applicants)</p>\n<p>·  Publication samples (college applicants)</p>\n<p>·  Transcript(s)</p>\n<p>All documents were submitted via the<a href=\"https://form.jotform.com/SWESCVScholarships/swe-scv-scholarship-2018\" target=\"_blank\"> JotForm input proces</a>s. Any missing files or questions, write to <a href=\"mailto:SWE_SCV_Scholarships&#64;yahoo.com\" target=\"_blank\">SWE_SCV_Scholarships&#64;yahoo.com</a> </p>\n<p>Mailing address is (only if needed) <br />        SWE- Society of Women Engineers - Scholarships <br />        Santa Clara Valley Section <br />        PO Box 61333 Sunnyvale, CA 94088-1333</p>\n<p><b>Selection &amp; Payment of Scholarship</b></p>\n<p>Proof of enrollment will be requested at the beginning of the school year. Once proof is received and accepted, the scholarship will be paid directly to the college/university&#39;s bursar&#39;s office. Each receipt will be required to submit a verification of enrollment document (on the institution’s letterhead) to SWE-SCV and must contain the following information:</p>\n<p>1.    Current engineering and/or computer science program of study (this means you must declare a major in engineering and/or computer science by winter semester/quarter)</p>\n<p>2.    Semester enrolled</p>\n<p>3.    Number of credits you are taking</p>\n<p>4.    Current classes you are taking (Please note that your course work must be engineering and/or computer science related)</p>\n<p>5.    The document you provide must be a verification of enrollment document that is on your institution’s letterhead. This document can be obtained by your institution’s bursar&#39;s office.</p>\n<p></p>\n<p>If you have any questions, please contact us at <a href=\"mailto:swe_scv_scholarships&#64;yahoo.com\">swe_scv_scholarships&#64;yahoo.com</a></p>\n<p></p>\n</div>\n</div>", "created": "2017-12-15T23:32:42Z", "subject": "12.8.2017 Undergraduate Announcements", "uid": "hkyddknu435n5"}, {"anon": "no", "content": "<p></p>\n<div>\n<div><span style=\"font-family:&#34;Arial&#34;;color:#000000\">Dear Students,</span></div>\n<div><span style=\"font-family:&#34;Arial&#34;;color:#000000\"> </span></div>\n<div><span style=\"font-family:&#34;Arial&#34;;color:#000000\">It&#39;s finals week! You&#39;re all almost done. Best of luck! Another semester has ended and you all should be super proud of yourselves. Enjoy your winter break!</span></div>\n<div><span style=\"font-family:&#34;Arial&#34;;color:#000000\"> </span></div>\n<div><span style=\"font-family:&#34;Arial&#34;;color:#000000\"><img src=\"https://mail.google.com/mail/u/0/?ui=2&amp;ik=adb3d3468b&amp;view=fimg&amp;th=16037ba5913f483a&amp;attid=0.0.3&amp;disp=emb&amp;realattid=ii_16036ff1e68d8ddb&amp;attbid=ANGjdJ9pY6_5e5jWEiJE1fNXPLjIfz2qGBWkYUEqSceEXutbm6eHwev_MpNAvUEaRFaVOh0BaPyzI6sxaBJ-K5ZLZGjJRfU4X1HIDScComSIjZzCNCcTi2hNCQ8VtDE&amp;sz=w714-h476&amp;ats=1512763452733&amp;rm=16037ba5913f483a&amp;zw&amp;atsh=1\" alt=\"Inline image 1\" width=\"357\" height=\"238\" /><br /></span></div>\n</div>\n<div>\n<p>EECS De-Stress Week<b></b></p>\n<p>This RRR week was filled with many fun events lead by our amazing student organizations. We hope you were able to attend and de-stress! There&#39;s one final event happening next week: IEEE will be providing breakfast outside some of the 8am finals, we hope you are one of those lucky students!</p>\n<p><b> <img src=\"https://mail.google.com/mail/u/0/?ui=2&amp;ik=adb3d3468b&amp;view=fimg&amp;th=16037ba5913f483a&amp;attid=0.0.1&amp;disp=emb&amp;realattid=ii_jassx3jc2_16023c47d92d6f22&amp;attbid=ANGjdJ-JgUw9_M6WA0esXqqo5MdM4y4HvVJIPjIHfvHBJolJVOp-NPIYRiqiEMu07-zfnKuNAxUU1uJ7OeASj1_GTqBUx7sRlX_5RSrw7Fs96LZCTvNeHNgm0lV6Bp4&amp;sz=w1470-h1100&amp;ats=1512763452734&amp;rm=16037ba5913f483a&amp;zw&amp;atsh=1\" width=\"735\" height=\"550\" /><br />​</b></p>\n<p>Help the EECS Department &amp; Win Amazon Gift Cards!</p>\n<p>Hi everyone!</p>\n<p>Want to have your voice heard by EECS faculty, staff, and the Chairs?</p>\n<p>HKN and other EECS student organizations have composed the 2017-18 EECS Undergraduate Survey so you can provide input and feedback to our very own EECS Department. This is a great opportunity for you to make a real impact in your classes, student life, and campus culture. Your thoughts <i>will </i>reach faculty and will be used to help improve the department and the community!</p>\n<p>In addition, once you complete the survey, you can choose to enter a prize drawing to win one of fifteen (15) $10 Amazon gift cards!</p>\n<p>Your response is completely anonymous. We encourage you to respond openly and honestly!</p>\n<p>The survey is available here:</p>\n<p><a href=\"https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5\" target=\"_blank\">https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5</a></p>\n<p><b> </b></p>\n<p>TreeHacks 2018</p>\n<p>My name is Sara Frigui and I&#39;m excited to announce that TreeHacks 2018 applications are now open. TreeHacks is Stanford&#39;s annual national 36-hour hackathon and is expected to have hundreds of participants from colleges all over the world and will take place at Stanford from <b>February 16 to February 18, 2018.</b></p>\n<p>We aim to challenge underrepresentation in the tech field. We encourage you all to apply by <b>December 9th.</b><br /><br />Feel free to contact Sara Frigui at <b><a href=\"mailto:sfrig01&#64;stanford.edu\" target=\"_blank\">sfrig01&#64;stanford.edu</a></b> or <b><a target=\"_blank\">502-939-1579</a> </b>if you have any questions.</p>\n<p></p>\n<p>2017 Undergraduate Student CRA Survey </p>\n<p>The Computing Research Association (CRA) is interested in career development among students in computing fields. They would like to hear about your experiences as a student, as well as your plans for the future. To that end, I encourage you to complete their brief survey, which will take no more than 20 minutes to complete.</p>\n<p><b><i>Should you decide to complete the survey, you will be entered into a raffle for a $100 gift card to Amazon! Please fill out no later than December 15th to be eligible for the drawing. </i></b></p>\n<p>If you are interested in completing the survey, please click the link below, or copy and</p>\n<p>paste the URL into your internet browser:</p>\n<p><a href=\"https://cerp.co1.qualtrics.com/jfe/form/SV_3UH7q6TmdZ8YRPD\" target=\"_blank\">https://cerp.co1.qualtrics.com/jfe/form/SV_3UH7q6TmdZ8YRPD<br /></a></p>\n<p>The survey is being conducted by the CRA’s Center for Evaluating the Research Pipeline</p>\n<p>(CERP). For more information on CERP, please visit their website: <a href=\"http://cra.org/cerp/\" target=\"_blank\">http://cra.org/cerp/</a>.</p>\n<p>  </p>\n<p>UC Davis Collegiate Hackathon</p>\n<p>For those of you interested in making awesome projects with your programming skills to solve social issues, you should definitely apply to <a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=http%3A%2F%2Fhackdavis.io%2F\" target=\"_blank\">HackDavis</a>!</p>\n<p><b>HackDavis</b> is a 24-hour long coding event, taking place on <b>January 20th - 21st, 2018</b>, that helps address some of the world&#39;s most pressing issues related to the Environment, Health &amp; Wellness, and Education. </p>\n<p>This event is <b>free</b> for all admitted participants and people of <b>all programming levels</b> are welcome. During the event we will have free food and swag, and participants will also have access to mentors from many different companies who will host workshops and help guide them. A hackathon is an amazing opportunity to challenge yourself to learn something completely new such as making a web server, controlling a drone, or even reading brain waves! Last year, a team combined an Arduino, motion sensors, and light controls to create a device that automatically shuts off the lights when no one is in the room. </p>\n<p>Applications are <b>open now </b>at <a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=http%3A%2F%2Fhackdavis.io\" target=\"_blank\">hackdavis.io</a> and are due by <b>December 31st at 11:59pm</b>. Feel free to contact us at <a href=\"mailto:team&#64;hackdavis.io\" target=\"_blank\">team&#64;hackdavis.io</a> if you have any questions.</p>\n<p>Check HackDavis out on social media:</p>\n<p><a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=https%3A%2F%2Fwww.facebook.com%2Fevents%2F376865076091009%2F\" target=\"_blank\">Event Page</a></p>\n<p><a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=https%3A%2F%2Fwww.facebook.com%2FHackDavis%2F\" target=\"_blank\">Facebook</a></p>\n<p><a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=https%3A%2F%2Fwww.instagram.com%2Fhackdavis%2F\" target=\"_blank\">Instagram</a></p>\n<p><a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=https%3A%2F%2Ftwitter.com%2Fhack_davis%3Flang%3Den\" target=\"_blank\">Twitter</a></p>\n<p></p>\n<p><a href=\"https://medium.com/&#64;HackDavis\" target=\"_blank\">Medium</a></p>\n<p> </p>\n<p>Career Opportunities at HRL Laboratories in Malibu, CA</p>\n<p>HRL Laboratories LLC in Malibu, CA is recruiting outstanding young scientists and engineers for an exciting project at the frontier of science and technology. In particular, we are looking for graduating seniors, recent graduates, and graduate students who are interested in working in an industrial laboratory setting on research utilizing nanoscale quantum-effect devices at cryogenic temperatures.  Individuals at the Bachelor’s, Master’s, and PhD level who have completed rigorous training in physics, applied physics, or electrical engineering are encouraged to apply to join our team at HRL.  These openings are not internships; candidates are expected to work full time for at least one year and preference is given to those who have more long-term interests.  Previous laboratory experience with low noise electrical measurements, nanoscale electronic devices, and cryogenics is desirable, but good scientific communication skills, a strong work ethic, and a natural scientific curiosity are required.  In addition, US citizenship is required and applicants must be willing to apply for a security clearance. Please email me at <a href=\"mailto:mtrakher&#64;hrl.com\" target=\"_blank\">mtrakher&#64;hrl.com</a> directly for more information.</p>\n<p> </p>\n<p>Undergraduate research opportunity for EECS majors </p>\n<p>The Pines lab is looking for motivated undergraduates to participate in cutting edge NMR methodology research. Six Nobel prizes have been awarded for discoveries over the course of the past century that have enabled NMR and MRI in becoming the revolutionary tools they are today. Our research aims to improve established industrial equipment and technology.  We are performing spectroscopy of a defect in diamond called the nitrogen vacancy (NV) center, making use of it to &#34;<i>hyperpolarize</i>&#34; and detect spins through <i>optical</i> means, providing signal amplification by over 5 orders of magnitude, <i>without</i> the need for a magnet. The technological implications are compelling: taking MRI/NMR to the desktop and wearables, microfluidic chip biosensors, revolutionary tools in catalysis and surface science, and in-vivo medical diagnostics, and paradigm-changing applications to spin-based quantum computing and spintronics.</p>\n<p> </p>\n<p>Here is a link to our youtube video on our technique:</p>\n<p><a href=\"https://www.youtube.com/watch?v=rF1g5TDP9WY\" target=\"_blank\">https://www.youtube.com/watch?v=rF1g5TDP9WY</a></p>\n<p></p>\n<p>If you are interested please email <a href=\"mailto:ashokaj&#64;berkeley.edu\" target=\"_blank\">ashokaj&#64;berkeley.edu</a></p>\n<p><img src=\"https://mail.google.com/mail/u/0/?ui=2&amp;ik=adb3d3468b&amp;view=fimg&amp;th=16037ba5913f483a&amp;attid=0.0.2&amp;disp=emb&amp;realattid=ii_160277414acd2a92&amp;attbid=ANGjdJ_JocmZaiAHxZ79IybYKVAEJ9BGOx5fhLQAoEaZl6fow8yLw7vk0u95hPOOCeHeXPf4b-BGJB8KK1QUP_BWUY7wPxnfwkEDMbPYm8bZv0zy_9-4PVb6H0P34Sg&amp;sz=w686-h572&amp;ats=1512763452738&amp;rm=16037ba5913f483a&amp;zw&amp;atsh=1\" alt=\"Inline image 1\" width=\"343\" height=\"286\" /></p>\n</div>\n<div>\n<div></div>\n<div>\n<p>Scholarships</p>\n<p>Introducing an exciting scholarship opportunity! For more information, please be sure to check out our <a href=\"https://www.livecareer.com/education-opportunities\" target=\"_blank\">scholarship page</a> for full details!</p>\n<p>1.    We will be awarding three scholarships of $1,500 each</p>\n<p>2.    We are asking students to write an original essay of between 200-800 words on the following: &#34;What personal/educational accomplishment would you be more proud to share with your future employers and why?&#34;</p>\n<p>3.    Students MUST also include the following to be eligible: full name, email, date of birth, mailing address, phone number, and school they&#39;re attending. All essays must be submitted through form-field found on <a href=\"https://www.livecareer.com/education-opportunities\" target=\"_blank\">https://www.livecareer.com/education-opportunities</a></p>\n<p>4.    The last day to enter is February 28, 2018 11:59:59 PM PST</p>\n<p>Please share this link to our <a href=\"https://www.livecareer.com/education-opportunities\" target=\"_blank\">scholarship page</a> so students at Berkeley can participate in this opportunity for financial aid! We greatly value education and understand it&#39;s not always easy to find the funds to pay for school, which is why we&#39;re so excited about our annual scholarship program.</p>\n<p> </p>\n<p>Jacobs Institute Innovation Catalysts</p>\n<p>The Jacobs Institute Innovation Catalysts, made possible by the Eustace-Kwan Family Foundation, is a new student grant program that provides an avenue for these ambitious student innovators to unlock further potential in their projects. </p>\n<p>Berkeley students are invited to propose projects that they aim to develop over the course of a semester. Selected grantees will work on their projects in the spring semester, with the support of resources from the <a href=\"http://jacobsinstitute.berkeley.edu/\" target=\"_blank\">Jacobs Institute</a> and <a href=\"http://invent.citris-uc.org/\" target=\"_blank\">CITRIS Invention Lab</a>, and as part of a cohort of fellow student innovators. </p>\n<p>Two types of grants will be awarded through the Innovation Catalysts program: </p>\n<p>·  <b><i>Ignite grants</i></b> are for in-progress projects, with existing prototypes and demonstrated potential for impact. Up to $2000 will be awarded for each project. </p>\n<p>·  <b><i>Spark grants</i></b> are for early-stage projects or ideas. Up to $500 will be awarded for each project. </p>\n<p>For more information about the Innovation Catalysts program and application process, <a href=\"http://jacobsinstitute.berkeley.edu/the-jacobs-institute-innovation-catalysts/\" target=\"_blank\">visit the program webpage</a>. There is an <b>info session this Friday, December 8th 12-1pm in 220 Jacobs Hall</b>; you can also contact me at <a href=\"mailto:amydinh&#64;berkeley.edu\" target=\"_blank\">amydinh&#64;berkeley.edu</a> with questions.</p>\n<p></p>\n<p>Applications for the inaugural spring 2018 cohort are <b>due Wednesday, December 20th</b>. <a href=\"https://goo.gl/forms/rsUcMYacB85B3Muq2\" target=\"_blank\">Sign up for important announcements and deadlines here</a>.</p>\n<p> </p>\n<p>Physiologic Informatics Research Opportunity at UCSF: Students and Recent Grads</p>\n<p></p>\n<p>Join a team of physicians and engineers developing clinical decision support tools to reduce preventable deaths caused by sepsis and patient discharge errors. This NIH funded project involves predictive analysis of EHR (electronic health record) data through machine learning. Students interested in a long-term, self-directed research opportunity in preparation for medical or graduate school, or for an undergraduate thesis, are encouraged to apply for Spring 2018. We also have full-time opportunities, effective immediately, for recent graduates, such as those taking a gap year prior to graduate or medical school.</p>\n<p></p>\n<p>We have clinical, regulatory, statistical algorithm development, programming, and peer-review manuscript writing opportunities available. Students must be able to make a substantial commitment to this position during the spring semester and work full-time on this project throughout the summer. Recent graduates must be able to work full time for a minimum of 6 months.</p>\n<p></p>\n<p>If this sounds interesting, apply here (this takes less than 10 minutes!): <a href=\"https://phys-inf.typeform.com/to/zh9Yd9\" target=\"_blank\">https://phys-inf.typeform.com/to/zh9Yd9</a>. We will be accepting applications until the positions are filled, so apply early!</p>\n<p>For further information, please email Prof. Chris Barton (<a href=\"mailto:chris.barton&#64;emergency.ucsf.edu\" target=\"_blank\">chris.barton&#64;emergency.ucsf.edu</a>).</p>\n<p> </p>\n<p>Division of Data Science Opportunities</p>\n<p>The Division of Data Science student teams have opportunities available for Spring 2018! We are recruiting for a wide range of different roles including data science research, communications and marketing strategy, video and media production, applied data science, software engineering, and curriculum development.</p>\n<p></p>\n<p>To get involved, <a href=\"https://goo.gl/TMLNuY\" target=\"_blank\">apply here</a>! Our first round of recruitment runs through December 9th. Candidates who apply in this period will receive higher priority.</p>\n<p></p>\n<p>We will also be showcasing the work of the student teams this semester at our Fall 2017 Data Science Showcase on Thursday, December 7th from 3PM - 5PM in Moffitt 405!</p>\n<p></p>\n<p></p>\n<p>If you have any questions about the student teams application, please email us at <a href=\"mailto:dsep_recruit&#64;berkeley.edu\" target=\"_blank\">dsep_recruit&#64;berkeley.edu</a>.</p>\n<p> </p>\n<p>Demography Courses: Social Networks</p>\n<p><span style=\"text-decoration:underline\">Demography 180: Social Networks</span></p>\n<p>Professor Dennis Feehan <br />Spring 2018</p>\n<p>Class meetings Tu/Th 11am-12.30pm, 141 McCone<br />Class number: 41045<br /><a href=\"http://dennisfeehan.org/teaching/2018sp_demog180.html\" target=\"_blank\">http://dennisfeehan.org/teaching/2018sp_demog180.html</a></p>\n<p>Overview</p>\n<p>The science of social networks focuses on measuring, modeling, and understanding the different ways that people are connected to one another. In this class, we will use a broad toolkit of theories and methods drawn from the social, natural, and mathematical sciences to learn what a social network is, to understand how to work with social network data, and to illustrate some of the ways that social networks can be useful in theory and in practice. We will see that network ideas are powerful enough to be used everywhere from CDC and UNAIDS, where network models help epidemiologists prevent the spread of HIV, to Silicon Valley, where data scientists use network ideas to build products that enable people all across the globe to connect with one another.</p>\n<p><span style=\"text-decoration:underline\">Demography 260: Social Networks</span></p>\n<p>Professor Dennis Feehan <br />Spring 2018</p>\n<p>Class meetings Wednesdays, 2-5pm, Demography Seminar Room (2232 Piedmont Avenue, room 100)<br />Class number: 23375<br /><a href=\"http://dennisfeehan.org/teaching/2018sp_demog260.html\" target=\"_blank\">http://dennisfeehan.org/teaching/2018sp_demog260.html</a></p>\n<p>Overview</p>\n<p>This course provides a broad introduction to the empirical and theoretical study of social networks. We will cover classic and contemporary studies, beginning with fundamental definitions and models, and then moving through a range of topics, including models of network formation and structure (homophily, foci, communities); dynamic processes on networks (contagion, influence, and disease models); collaborative networks; personal networks; online networks; and network sampling and data collection. The course material is intended to be of interest to students from a wide range of disciplinary backgrounds, including demography, sociology, statistics, computer science, and related fields.</p>\n<p> </p>\n<p>2018 Santa Clara Valley SWE (SWE-SCV) Scholarship Applications: NOW OPEN</p>\n<p>The Santa Clara Valley SWE scholarship applications for 2018 are now open. <b><i><span style=\"text-decoration:underline\">The deadline is December 23, 2017</span></i></b>. Winners will be notified in late February and honored at our scholarship luncheon in early March (the schedule is two months earlier this year: we moved it based on feedback from prior applicants and recipients).</p>\n<p><b>The scholarship application process for college school year 18-19 opened on November 16, 2017. Applications are welcome for the 18-19 college school year. Due date is earlier than prior years.  </b></p>\n<p><b>For details, see <a href=\"http://www.swescv.com/scholarships/application\" target=\"_blank\">2018 Scholarship Application</a></b></p>\n<p>Society of Women Engineers (SWE), founded in 1950, is a not-for-profit organization that supports professional and collegiate female engineers through professional development and career guidance programs. The organization has a goal to encourage more females in the field of engineering and technology through scholarships and outreach programs.</p>\n<p>Each year the Santa Clara Valley section of SWE awards several scholarships, primarily on the basis of scholastic achievement, motivation and interest in engineering demonstrated in the application form. We also provide need-based scholarships. We would greatly appreciate if you can help us inform qualified candidates about this scholarship program.</p>\n<p><b>2018 SWE-SCV Scholarships (School Year 2018-19)</b></p>\n<p>Scholarship recipients will be awarded $1,000 to $2500 for tuition expenses. Read more about our scholarship namesakes below.</p>\n<p>·  <a href=\"http://www.swescv.com/scholarships/scholarship-descriptions\" target=\"_blank\">Irmgard Flugge-Lotz Scholarship</a></p>\n<p>·  <a href=\"http://www.swescv.com/scholarships/scholarship-descriptions\" target=\"_blank\">Al Gardner Scholarship</a></p>\n<p>·  <a href=\"http://www.swescv.com/scholarships/scholarship-descriptions\" target=\"_blank\">Mary G. Ross Scholarship</a></p>\n<p>·  <a href=\"http://www.swescv.com/scholarships/scholarship-descriptions\" target=\"_blank\">Esther Williams Scholarship</a></p>\n<p>·  <a href=\"http://www.swescv.com/scholarships\" target=\"_blank\">Mary Nell Rogers</a></p>\n<p><b>Student Eligibility Requirements</b></p>\n<p>Female high school seniors, college and graduate students pursuing a BS and/or MS in engineering or computer science are eligible for these scholarships, <b>as well as community college students</b> pursuing a path to those fields. Students should be enrolled full time and attend college that has ABET or CSAB accredited engineering programs. Other interdisciplinary engineering or computer science programs may qualify as well. If you program is one of these, please write <a href=\"mailto:SWE_SCV_Scholarships&#64;yahoo.com\" target=\"_blank\">SWE_SCV_Scholarships&#64;yahoo.com</a> to find out if your program is accepted. <br /><br />Applicants must be a permanent resident of or attend school in the South San Francisco Bay Area, which are located in the following zip codes: 94002-94003, 94010-94011, 94018-94028, 94030, 94035, 94037-94043, 94059-94065, 94070-94071, 94074, 94086-94091, 943**, 944**, 94536-94546, 94552, 94555, 94557, 94560, 94587, 950**, 951**</p>\n<p><b>The Scholarship Application Process</b></p>\n<p>Please read the <a href=\"http://www.swescv.com/scholarships/application\" target=\"_blank\">Tips for Success</a> (see files on that page) and <a href=\"http://www.swescv.com/scholarships/scholarships-faq\" target=\"_blank\">Frequently Asked Questions</a> before beginning the application. Personal and financial information will be held in strict confidence. If a question does not apply, indicate “N/A.” If you need more space to answer questions, please leverage the &#34;comments&#34; section.<br /><br />Please note that your application is not complete until the scholarship committee has received the following, via the JotForm link upload (see notes on <a href=\"http://www.swescv.com/scholarships/application\" target=\"_blank\">2018 Scholarship Application</a>:)  </p>\n<p>·  Completed application (follow links to download <a href=\"http://www.swescv.com/scholarships/application\" target=\"_blank\">application </a>(see files at bottom of that page) and <a href=\"https://docs.google.com/viewer?a=v&amp;pid=sites&amp;srcid=ZGVmYXVsdGRvbWFpbnxzd2VzY3YyfGd4OmVlZTJhOWRhMzY1NWRmMg\" target=\"_blank\">resume template</a></p>\n<p>·  Two (2) letters of recommendation  (these can be uploaded via JotForm Application OR sent separately by email from the recommender directly to<a href=\"mailto:SWE_SCV_Scholarships&#64;Yahoo.com\" target=\"_blank\">SWE_SCV_Scholarships&#64;Yahoo.com</a>)</p>\n<p>·  Standardized test score(s)  (high school applicants)</p>\n<p>·  Publication samples (college applicants)</p>\n<p>·  Transcript(s)</p>\n<p>All documents were submitted via the<a href=\"https://form.jotform.com/SWESCVScholarships/swe-scv-scholarship-2018\" target=\"_blank\"> JotForm input proces</a>s. Any missing files or questions, write to <a href=\"mailto:SWE_SCV_Scholarships&#64;yahoo.com\" target=\"_blank\">SWE_SCV_Scholarships&#64;yahoo.com</a> </p>\n<p>Mailing address is (only if needed) <br />        SWE- Society of Women Engineers - Scholarships <br />        Santa Clara Valley Section <br />        PO Box 61333 Sunnyvale, CA 94088-1333</p>\n<p><b>Selection &amp; Payment of Scholarship</b></p>\n<p>Proof of enrollment will be requested at the beginning of the school year. Once proof is received and accepted, the scholarship will be paid directly to the college/university&#39;s bursar&#39;s office. Each receipt will be required to submit a verification of enrollment document (on the institution’s letterhead) to SWE-SCV and must contain the following information:</p>\n<p>1.    Current engineering and/or computer science program of study (this means you must declare a major in engineering and/or computer science by winter semester/quarter)</p>\n<p>2.    Semester enrolled</p>\n<p>3.    Number of credits you are taking</p>\n<p>4.    Current classes you are taking (Please note that your course work must be engineering and/or computer science related)</p>\n<p>5.    The document you provide must be a verification of enrollment document that is on your institution’s letterhead. This document can be obtained by your institution’s bursar&#39;s office.</p>\n<p></p>\n<p>If you have any questions, please contact us at <a href=\"mailto:swe_scv_scholarships&#64;yahoo.com\">swe_scv_scholarships&#64;yahoo.com</a></p>\n<p></p>\n<p>#pin</p>\n</div>\n</div>", "created": "2017-12-08T23:02:02Z", "subject": "12.8.2017 Undergraduate Announcements", "uid": "icdxydvnk125h8"}, {"anon": "no", "content": "<p></p><div>\n<div><span style=\"font-family:&#34;Arial&#34;;color:#000000\">Dear Students,</span></div>\n<div><span style=\"font-family:&#34;Arial&#34;;color:#000000\"> </span></div>\n<div><span style=\"font-family:&#34;Arial&#34;;color:#000000\">It&#39;s finals week! You&#39;re all almost done. Best of luck! Another semester has ended and you all should be super proud of yourselves. Enjoy your winter break!</span></div>\n<div><span style=\"font-family:&#34;Arial&#34;;color:#000000\"> </span></div>\n<div><span style=\"font-family:&#34;Arial&#34;;color:#000000\"><img src=\"https://mail.google.com/mail/u/0/?ui=2&amp;ik=adb3d3468b&amp;view=fimg&amp;th=16037ba5913f483a&amp;attid=0.0.3&amp;disp=emb&amp;realattid=ii_16036ff1e68d8ddb&amp;attbid=ANGjdJ9pY6_5e5jWEiJE1fNXPLjIfz2qGBWkYUEqSceEXutbm6eHwev_MpNAvUEaRFaVOh0BaPyzI6sxaBJ-K5ZLZGjJRfU4X1HIDScComSIjZzCNCcTi2hNCQ8VtDE&amp;sz=w714-h476&amp;ats=1512763452733&amp;rm=16037ba5913f483a&amp;zw&amp;atsh=1\" alt=\"Inline image 1\" width=\"357\" height=\"238\" /><br /></span></div>\n</div>\n<div>\n<p>EECS De-Stress Week<b></b></p>\n<p>This RRR week was filled with many fun events lead by our amazing student organizations. We hope you were able to attend and de-stress! There&#39;s one final event happening next week: IEEE will be providing breakfast outside some of the 8am finals, we hope you are one of those lucky students!</p>\n<p><b> <img src=\"https://mail.google.com/mail/u/0/?ui=2&amp;ik=adb3d3468b&amp;view=fimg&amp;th=16037ba5913f483a&amp;attid=0.0.1&amp;disp=emb&amp;realattid=ii_jassx3jc2_16023c47d92d6f22&amp;attbid=ANGjdJ-JgUw9_M6WA0esXqqo5MdM4y4HvVJIPjIHfvHBJolJVOp-NPIYRiqiEMu07-zfnKuNAxUU1uJ7OeASj1_GTqBUx7sRlX_5RSrw7Fs96LZCTvNeHNgm0lV6Bp4&amp;sz=w1470-h1100&amp;ats=1512763452734&amp;rm=16037ba5913f483a&amp;zw&amp;atsh=1\" width=\"735\" height=\"550\" /><br />​</b></p>\n<p>Help the EECS Department &amp; Win Amazon Gift Cards!</p>\n<p>Hi everyone!</p>\n<p>Want to have your voice heard by EECS faculty, staff, and the Chairs?</p>\n<p>HKN and other EECS student organizations have composed the 2017-18 EECS Undergraduate Survey so you can provide input and feedback to our very own EECS Department. This is a great opportunity for you to make a real impact in your classes, student life, and campus culture. Your thoughts <i>will </i>reach faculty and will be used to help improve the department and the community!</p>\n<p>In addition, once you complete the survey, you can choose to enter a prize drawing to win one of fifteen (15) $10 Amazon gift cards!</p>\n<p>Your response is completely anonymous. We encourage you to respond openly and honestly!</p>\n<p>The survey is available here:</p>\n<p><a href=\"https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5\" target=\"_blank\">https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5</a></p>\n<p><b> </b></p>\n<p>TreeHacks 2018</p>\n<p>My name is Sara Frigui and I&#39;m excited to announce that TreeHacks 2018 applications are now open. TreeHacks is Stanford&#39;s annual national 36-hour hackathon and is expected to have hundreds of participants from colleges all over the world and will take place at Stanford from <b>February 16 to February 18, 2018.</b></p>\n<p>We aim to challenge underrepresentation in the tech field. We encourage you all to apply by <b>December 9th.</b><br /><br />Feel free to contact Sara Frigui at <b><a href=\"mailto:sfrig01&#64;stanford.edu\" target=\"_blank\">sfrig01&#64;stanford.edu</a></b> or <b><a target=\"_blank\">502-939-1579</a> </b>if you have any questions.</p>\n<p><br /></p>\n<p>2017 Undergraduate Student CRA Survey </p>\n<p>The Computing Research Association (CRA) is interested in career development among students in computing fields. They would like to hear about your experiences as a student, as well as your plans for the future. To that end, I encourage you to complete their brief survey, which will take no more than 20 minutes to complete.</p>\n<p><b><i>Should you decide to complete the survey, you will be entered into a raffle for a $100 gift card to Amazon! Please fill out no later than December 15th to be eligible for the drawing. </i></b></p>\n<p>If you are interested in completing the survey, please click the link below, or copy and</p>\n<p>paste the URL into your internet browser:</p>\n<p><a href=\"https://cerp.co1.qualtrics.com/jfe/form/SV_3UH7q6TmdZ8YRPD\" target=\"_blank\">https://cerp.co1.qualtrics.com/jfe/form/SV_3UH7q6TmdZ8YRPD<br /></a></p>\n<p>The survey is being conducted by the CRA’s Center for Evaluating the Research Pipeline</p>\n<p>(CERP). For more information on CERP, please visit their website: <a href=\"http://cra.org/cerp/\" target=\"_blank\">http://cra.org/cerp/</a>.</p>\n<p>  </p>\n<p>UC Davis Collegiate Hackathon</p>\n<p>For those of you interested in making awesome projects with your programming skills to solve social issues, you should definitely apply to <a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=http%3A%2F%2Fhackdavis.io%2F\" target=\"_blank\">HackDavis</a>!</p>\n<p><b>HackDavis</b> is a 24-hour long coding event, taking place on <b>January 20th - 21st, 2018</b>, that helps address some of the world&#39;s most pressing issues related to the Environment, Health &amp; Wellness, and Education. </p>\n<p>This event is <b>free</b> for all admitted participants and people of <b>all programming levels</b> are welcome. During the event we will have free food and swag, and participants will also have access to mentors from many different companies who will host workshops and help guide them. A hackathon is an amazing opportunity to challenge yourself to learn something completely new such as making a web server, controlling a drone, or even reading brain waves! Last year, a team combined an Arduino, motion sensors, and light controls to create a device that automatically shuts off the lights when no one is in the room. </p>\n<p>Applications are <b>open now </b>at <a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=http%3A%2F%2Fhackdavis.io\" target=\"_blank\">hackdavis.io</a> and are due by <b>December 31st at 11:59pm</b>. Feel free to contact us at <a href=\"mailto:team&#64;hackdavis.io\" target=\"_blank\">team&#64;hackdavis.io</a> if you have any questions.</p>\n<p>Check HackDavis out on social media:</p>\n<p><a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=https%3A%2F%2Fwww.facebook.com%2Fevents%2F376865076091009%2F\" target=\"_blank\">Event Page</a></p>\n<p><a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=https%3A%2F%2Fwww.facebook.com%2FHackDavis%2F\" target=\"_blank\">Facebook</a></p>\n<p><a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=https%3A%2F%2Fwww.instagram.com%2Fhackdavis%2F\" target=\"_blank\">Instagram</a></p>\n<p><a href=\"https://hackdavis-dot-yamm-track.appspot.com/Redirect?ukey=1sUFSzXyF9dvvZCXOUEj-Bh6SiPWo4Mh5ZOX-x7W6Zjk-1204846951&amp;key=YAMMID-13522056&amp;link=https%3A%2F%2Ftwitter.com%2Fhack_davis%3Flang%3Den\" target=\"_blank\">Twitter</a></p>\n<p></p>\n<p><a href=\"https://medium.com/&#64;HackDavis\" target=\"_blank\">Medium</a></p>\n<p> </p>\n<p>Career Opportunities at HRL Laboratories in Malibu, CA</p>\n<p>HRL Laboratories LLC in Malibu, CA is recruiting outstanding young scientists and engineers for an exciting project at the frontier of science and technology. In particular, we are looking for graduating seniors, recent graduates, and graduate students who are interested in working in an industrial laboratory setting on research utilizing nanoscale quantum-effect devices at cryogenic temperatures.  Individuals at the Bachelor’s, Master’s, and PhD level who have completed rigorous training in physics, applied physics, or electrical engineering are encouraged to apply to join our team at HRL.  These openings are not internships; candidates are expected to work full time for at least one year and preference is given to those who have more long-term interests.  Previous laboratory experience with low noise electrical measurements, nanoscale electronic devices, and cryogenics is desirable, but good scientific communication skills, a strong work ethic, and a natural scientific curiosity are required.  In addition, US citizenship is required and applicants must be willing to apply for a security clearance. Please email me at <a href=\"mailto:mtrakher&#64;hrl.com\" target=\"_blank\">mtrakher&#64;hrl.com</a> directly for more information.</p>\n<p> </p>\n<p>Undergraduate research opportunity for EECS majors </p>\n<p>The Pines lab is looking for motivated undergraduates to participate in cutting edge NMR methodology research. Six Nobel prizes have been awarded for discoveries over the course of the past century that have enabled NMR and MRI in becoming the revolutionary tools they are today. Our research aims to improve established industrial equipment and technology.  We are performing spectroscopy of a defect in diamond called the nitrogen vacancy (NV) center, making use of it to &#34;<i>hyperpolarize</i>&#34; and detect spins through <i>optical</i> means, providing signal amplification by over 5 orders of magnitude, <i>without</i> the need for a magnet. The technological implications are compelling: taking MRI/NMR to the desktop and wearables, microfluidic chip biosensors, revolutionary tools in catalysis and surface science, and in-vivo medical diagnostics, and paradigm-changing applications to spin-based quantum computing and spintronics.</p>\n<p> </p>\n<p>Here is a link to our youtube video on our technique:</p>\n<p><a href=\"https://www.youtube.com/watch?v=rF1g5TDP9WY\" target=\"_blank\">https://www.youtube.com/watch?v=rF1g5TDP9WY</a></p>\n<p></p>\n<p>If you are interested please email <a href=\"mailto:ashokaj&#64;berkeley.edu\" target=\"_blank\">ashokaj&#64;berkeley.edu</a></p>\n<p><img src=\"https://mail.google.com/mail/u/0/?ui=2&amp;ik=adb3d3468b&amp;view=fimg&amp;th=16037ba5913f483a&amp;attid=0.0.2&amp;disp=emb&amp;realattid=ii_160277414acd2a92&amp;attbid=ANGjdJ_JocmZaiAHxZ79IybYKVAEJ9BGOx5fhLQAoEaZl6fow8yLw7vk0u95hPOOCeHeXPf4b-BGJB8KK1QUP_BWUY7wPxnfwkEDMbPYm8bZv0zy_9-4PVb6H0P34Sg&amp;sz=w686-h572&amp;ats=1512763452738&amp;rm=16037ba5913f483a&amp;zw&amp;atsh=1\" alt=\"Inline image 1\" width=\"343\" height=\"286\" /></p>\n</div>\n<div>\n<div></div>\n<div>\n<p>Scholarships</p>\n<p>Introducing an exciting scholarship opportunity! For more information, please be sure to check out our <a href=\"https://www.livecareer.com/education-opportunities\" target=\"_blank\">scholarship page</a> for full details!</p>\n<p>1.    We will be awarding three scholarships of $1,500 each</p>\n<p>2.    We are asking students to write an original essay of between 200-800 words on the following: &#34;What personal/educational accomplishment would you be more proud to share with your future employers and why?&#34;</p>\n<p>3.    Students MUST also include the following to be eligible: full name, email, date of birth, mailing address, phone number, and school they&#39;re attending. All essays must be submitted through form-field found on <a href=\"https://www.livecareer.com/education-opportunities\" target=\"_blank\">https://www.livecareer.com/education-opportunities</a></p>\n<p>4.    The last day to enter is February 28, 2018 11:59:59 PM PST</p>\n<p>Please share this link to our <a href=\"https://www.livecareer.com/education-opportunities\" target=\"_blank\">scholarship page</a> so students at Berkeley can participate in this opportunity for financial aid! We greatly value education and understand it&#39;s not always easy to find the funds to pay for school, which is why we&#39;re so excited about our annual scholarship program.</p>\n<p> </p>\n<p>Jacobs Institute Innovation Catalysts</p>\n<p>The Jacobs Institute Innovation Catalysts, made possible by the Eustace-Kwan Family Foundation, is a new student grant program that provides an avenue for these ambitious student innovators to unlock further potential in their projects. </p>\n<p>Berkeley students are invited to propose projects that they aim to develop over the course of a semester. Selected grantees will work on their projects in the spring semester, with the support of resources from the <a href=\"http://jacobsinstitute.berkeley.edu/\" target=\"_blank\">Jacobs Institute</a> and <a href=\"http://invent.citris-uc.org/\" target=\"_blank\">CITRIS Invention Lab</a>, and as part of a cohort of fellow student innovators. </p>\n<p>Two types of grants will be awarded through the Innovation Catalysts program: </p>\n<p>·  <b><i>Ignite grants</i></b> are for in-progress projects, with existing prototypes and demonstrated potential for impact. Up to $2000 will be awarded for each project. </p>\n<p>·  <b><i>Spark grants</i></b> are for early-stage projects or ideas. Up to $500 will be awarded for each project. </p>\n<p>For more information about the Innovation Catalysts program and application process, <a href=\"http://jacobsinstitute.berkeley.edu/the-jacobs-institute-innovation-catalysts/\" target=\"_blank\">visit the program webpage</a>. There is an <b>info session this Friday, December 8th 12-1pm in 220 Jacobs Hall</b>; you can also contact me at <a href=\"mailto:amydinh&#64;berkeley.edu\" target=\"_blank\">amydinh&#64;berkeley.edu</a> with questions.</p>\n<p></p>\n<p>Applications for the inaugural spring 2018 cohort are <b>due Wednesday, December 20th</b>. <a href=\"https://goo.gl/forms/rsUcMYacB85B3Muq2\" target=\"_blank\">Sign up for important announcements and deadlines here</a>.</p>\n<p> </p>\n<p>Physiologic Informatics Research Opportunity at UCSF: Students and Recent Grads</p>\n<p></p>\n<p>Join a team of physicians and engineers developing clinical decision support tools to reduce preventable deaths caused by sepsis and patient discharge errors. This NIH funded project involves predictive analysis of EHR (electronic health record) data through machine learning. Students interested in a long-term, self-directed research opportunity in preparation for medical or graduate school, or for an undergraduate thesis, are encouraged to apply for Spring 2018. We also have full-time opportunities, effective immediately, for recent graduates, such as those taking a gap year prior to graduate or medical school.</p>\n<p></p>\n<p>We have clinical, regulatory, statistical algorithm development, programming, and peer-review manuscript writing opportunities available. Students must be able to make a substantial commitment to this position during the spring semester and work full-time on this project throughout the summer. Recent graduates must be able to work full time for a minimum of 6 months.</p>\n<p></p>\n<p>If this sounds interesting, apply here (this takes less than 10 minutes!): <a href=\"https://phys-inf.typeform.com/to/zh9Yd9\" target=\"_blank\">https://phys-inf.typeform.com/to/zh9Yd9</a>. We will be accepting applications until the positions are filled, so apply early!</p>\n<p>For further information, please email Prof. Chris Barton (<a href=\"mailto:chris.barton&#64;emergency.ucsf.edu\" target=\"_blank\">chris.barton&#64;emergency.ucsf.edu</a>).</p>\n<p> </p>\n<p>Division of Data Science Opportunities</p>\n<p>The Division of Data Science student teams have opportunities available for Spring 2018! We are recruiting for a wide range of different roles including data science research, communications and marketing strategy, video and media production, applied data science, software engineering, and curriculum development.</p>\n<p></p>\n<p>To get involved, <a href=\"https://goo.gl/TMLNuY\" target=\"_blank\">apply here</a>! Our first round of recruitment runs through December 9th. Candidates who apply in this period will receive higher priority.</p>\n<p></p>\n<p>We will also be showcasing the work of the student teams this semester at our Fall 2017 Data Science Showcase on Thursday, December 7th from 3PM - 5PM in Moffitt 405!</p>\n<p></p>\n<p></p>\n<p>If you have any questions about the student teams application, please email us at <a href=\"mailto:dsep_recruit&#64;berkeley.edu\" target=\"_blank\">dsep_recruit&#64;berkeley.edu</a>.</p>\n<p> </p>\n<p>Demography Courses: Social Networks</p>\n<p><span style=\"text-decoration:underline\">Demography 180: Social Networks</span></p>\n<p>Professor Dennis Feehan <br />Spring 2018</p>\n<p>Class meetings Tu/Th 11am-12.30pm, 141 McCone<br />Class number: 41045<br /><a href=\"http://dennisfeehan.org/teaching/2018sp_demog180.html\" target=\"_blank\">http://dennisfeehan.org/teaching/2018sp_demog180.html</a></p>\n<p>Overview</p>\n<p>The science of social networks focuses on measuring, modeling, and understanding the different ways that people are connected to one another. In this class, we will use a broad toolkit of theories and methods drawn from the social, natural, and mathematical sciences to learn what a social network is, to understand how to work with social network data, and to illustrate some of the ways that social networks can be useful in theory and in practice. We will see that network ideas are powerful enough to be used everywhere from CDC and UNAIDS, where network models help epidemiologists prevent the spread of HIV, to Silicon Valley, where data scientists use network ideas to build products that enable people all across the globe to connect with one another.</p>\n<p><span style=\"text-decoration:underline\">Demography 260: Social Networks</span></p>\n<p>Professor Dennis Feehan <br />Spring 2018</p>\n<p>Class meetings Wednesdays, 2-5pm, Demography Seminar Room (2232 Piedmont Avenue, room 100)<br />Class number: 23375<br /><a href=\"http://dennisfeehan.org/teaching/2018sp_demog260.html\" target=\"_blank\">http://dennisfeehan.org/teaching/2018sp_demog260.html</a></p>\n<p>Overview</p>\n<p>This course provides a broad introduction to the empirical and theoretical study of social networks. We will cover classic and contemporary studies, beginning with fundamental definitions and models, and then moving through a range of topics, including models of network formation and structure (homophily, foci, communities); dynamic processes on networks (contagion, influence, and disease models); collaborative networks; personal networks; online networks; and network sampling and data collection. The course material is intended to be of interest to students from a wide range of disciplinary backgrounds, including demography, sociology, statistics, computer science, and related fields.</p>\n<p> </p>\n<p>2018 Santa Clara Valley SWE (SWE-SCV) Scholarship Applications: NOW OPEN</p>\n<p>The Santa Clara Valley SWE scholarship applications for 2018 are now open. <b><i><span style=\"text-decoration:underline\">The deadline is December 23, 2017</span></i></b>. Winners will be notified in late February and honored at our scholarship luncheon in early March (the schedule is two months earlier this year: we moved it based on feedback from prior applicants and recipients).</p>\n<p><b>The scholarship application process for college school year 18-19 opened on November 16, 2017. Applications are welcome for the 18-19 college school year. Due date is earlier than prior years.  </b></p>\n<p><b>For details, see <a href=\"http://www.swescv.com/scholarships/application\" target=\"_blank\">2018 Scholarship Application</a></b></p>\n<p>Society of Women Engineers (SWE), founded in 1950, is a not-for-profit organization that supports professional and collegiate female engineers through professional development and career guidance programs. The organization has a goal to encourage more females in the field of engineering and technology through scholarships and outreach programs.</p>\n<p>Each year the Santa Clara Valley section of SWE awards several scholarships, primarily on the basis of scholastic achievement, motivation and interest in engineering demonstrated in the application form. We also provide need-based scholarships. We would greatly appreciate if you can help us inform qualified candidates about this scholarship program.</p>\n<p><b>2018 SWE-SCV Scholarships (School Year 2018-19)</b></p>\n<p>Scholarship recipients will be awarded $1,000 to $2500 for tuition expenses. Read more about our scholarship namesakes below.</p>\n<p>·  <a href=\"http://www.swescv.com/scholarships/scholarship-descriptions\" target=\"_blank\">Irmgard Flugge-Lotz Scholarship</a></p>\n<p>·  <a href=\"http://www.swescv.com/scholarships/scholarship-descriptions\" target=\"_blank\">Al Gardner Scholarship</a></p>\n<p>·  <a href=\"http://www.swescv.com/scholarships/scholarship-descriptions\" target=\"_blank\">Mary G. Ross Scholarship</a></p>\n<p>·  <a href=\"http://www.swescv.com/scholarships/scholarship-descriptions\" target=\"_blank\">Esther Williams Scholarship</a></p>\n<p>·  <a href=\"http://www.swescv.com/scholarships\" target=\"_blank\">Mary Nell Rogers</a></p>\n<p><b>Student Eligibility Requirements</b></p>\n<p>Female high school seniors, college and graduate students pursuing a BS and/or MS in engineering or computer science are eligible for these scholarships, <b>as well as community college students</b> pursuing a path to those fields. Students should be enrolled full time and attend college that has ABET or CSAB accredited engineering programs. Other interdisciplinary engineering or computer science programs may qualify as well. If you program is one of these, please write <a href=\"mailto:SWE_SCV_Scholarships&#64;yahoo.com\" target=\"_blank\">SWE_SCV_Scholarships&#64;yahoo.com</a> to find out if your program is accepted. <br /><br />Applicants must be a permanent resident of or attend school in the South San Francisco Bay Area, which are located in the following zip codes: 94002-94003, 94010-94011, 94018-94028, 94030, 94035, 94037-94043, 94059-94065, 94070-94071, 94074, 94086-94091, 943**, 944**, 94536-94546, 94552, 94555, 94557, 94560, 94587, 950**, 951**</p>\n<p><b>The Scholarship Application Process</b></p>\n<p>Please read the <a href=\"http://www.swescv.com/scholarships/application\" target=\"_blank\">Tips for Success</a> (see files on that page) and <a href=\"http://www.swescv.com/scholarships/scholarships-faq\" target=\"_blank\">Frequently Asked Questions</a> before beginning the application. Personal and financial information will be held in strict confidence. If a question does not apply, indicate “N/A.” If you need more space to answer questions, please leverage the &#34;comments&#34; section.<br /><br />Please note that your application is not complete until the scholarship committee has received the following, via the JotForm link upload (see notes on <a href=\"http://www.swescv.com/scholarships/application\" target=\"_blank\">2018 Scholarship Application</a>:)  </p>\n<p>·  Completed application (follow links to download <a href=\"http://www.swescv.com/scholarships/application\" target=\"_blank\">application </a>(see files at bottom of that page) and <a href=\"https://docs.google.com/viewer?a=v&amp;pid=sites&amp;srcid=ZGVmYXVsdGRvbWFpbnxzd2VzY3YyfGd4OmVlZTJhOWRhMzY1NWRmMg\" target=\"_blank\">resume template</a></p>\n<p>·  Two (2) letters of recommendation  (these can be uploaded via JotForm Application OR sent separately by email from the recommender directly to<a href=\"mailto:SWE_SCV_Scholarships&#64;Yahoo.com\" target=\"_blank\">SWE_SCV_Scholarships&#64;Yahoo.com</a>)</p>\n<p>·  Standardized test score(s)  (high school applicants)</p>\n<p>·  Publication samples (college applicants)</p>\n<p>·  Transcript(s)</p>\n<p>All documents were submitted via the<a href=\"https://form.jotform.com/SWESCVScholarships/swe-scv-scholarship-2018\" target=\"_blank\"> JotForm input proces</a>s. Any missing files or questions, write to <a href=\"mailto:SWE_SCV_Scholarships&#64;yahoo.com\" target=\"_blank\">SWE_SCV_Scholarships&#64;yahoo.com</a> </p>\n<p>Mailing address is (only if needed) <br />        SWE- Society of Women Engineers - Scholarships <br />        Santa Clara Valley Section <br />        PO Box 61333 Sunnyvale, CA 94088-1333</p>\n<p><b>Selection &amp; Payment of Scholarship</b></p>\n<p>Proof of enrollment will be requested at the beginning of the school year. Once proof is received and accepted, the scholarship will be paid directly to the college/university&#39;s bursar&#39;s office. Each receipt will be required to submit a verification of enrollment document (on the institution’s letterhead) to SWE-SCV and must contain the following information:</p>\n<p>1.    Current engineering and/or computer science program of study (this means you must declare a major in engineering and/or computer science by winter semester/quarter)</p>\n<p>2.    Semester enrolled</p>\n<p>3.    Number of credits you are taking</p>\n<p>4.    Current classes you are taking (Please note that your course work must be engineering and/or computer science related)</p>\n<p>5.    The document you provide must be a verification of enrollment document that is on your institution’s letterhead. This document can be obtained by your institution’s bursar&#39;s office.</p>\n<p></p>\n<p>If you have any questions, please contact us at <a href=\"mailto:swe_scv_scholarships&#64;yahoo.com\" target=\"_blank\">swe_scv_scholarships&#64;yahoo.com</a></p>\n</div>\n</div>", "created": "2017-12-08T20:05:37Z", "subject": "12.8.2017 Undergraduate Announcements", "uid": "hkyddknu435n5"}], "i_edits": [], "id": "jayccnrydx871y", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 5739, "num_favorites": 2, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654550649093, "tag_good": [], "tag_good_arr": [], "tags": ["announcements", "instructor-note"], "type": "note", "unique_views": 940}