{"bookmarked": 10, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jc4k6hzfsqo76", "type": "create", "uid_a": "a_0", "when": "2018-01-07T09:11:06Z"}, {"anon": "stud", "to": "jc4k6hzd5vw75", "type": "followup", "uid_a": "a_1", "when": "2018-01-07T10:12:06Z"}, {"anon": "stud", "to": "jc4k6hzd5vw75", "type": "followup", "uid_a": "a_2", "when": "2018-01-07T21:29:07Z"}, {"anon": "stud", "data": "jc5f90sprib4kq", "to": "jc4k6hzd5vw75", "type": "s_answer", "uid_a": "a_3", "when": "2018-01-07T23:40:51Z"}, {"anon": "stud", "to": "jc4k6hzd5vw75", "type": "feedback", "uid_a": "a_4", "when": "2018-01-08T22:52:03Z"}, {"anon": "stud", "to": "jc4k6hzd5vw75", "type": "followup", "uid_a": "a_5", "when": "2018-01-09T06:17:56Z"}, {"anon": "stud", "to": "jc4k6hzd5vw75", "type": "feedback", "uid_a": "a_2", "when": "2018-01-09T15:47:51Z"}, {"anon": "stud", "to": "jc4k6hzd5vw75", "type": "feedback", "uid_a": "a_3", "when": "2018-01-09T22:56:15Z"}, {"anon": "stud", "to": "jc4k6hzd5vw75", "type": "feedback", "uid_a": "a_2", "when": "2018-01-09T23:55:59Z"}, {"anon": "stud", "to": "jc4k6hzd5vw75", "type": "feedback", "uid_a": "a_4", "when": "2018-01-09T23:57:36Z"}, {"anon": "stud", "to": "jc4k6hzd5vw75", "type": "feedback", "uid_a": "a_4", "when": "2018-01-10T00:14:18Z"}, {"anon": "stud", "to": "jc4k6hzd5vw75", "type": "feedback", "uid_a": "a_4", "when": "2018-01-10T00:25:25Z"}], "children": [{"anon": "stud", "bucket_name": "Week 12/31 - 1/6", "bucket_order": 116, "children": [], "config": {}, "created": "2018-01-07T10:12:06Z", "data": {"embed_links": null}, "folders": [], "id": "jc4mcy21pwv6c5", "no_answer": 0, "no_upvotes": 0, "subject": "Email the PhD or post-doc who’s in charge of the project. That’s a much better approach than bugging the professor. ", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_1", "updated": "2018-01-07T10:12:06Z"}, {"anon": "stud", "bucket_name": "Week 1/7 - 1/13", "bucket_order": 115, "children": [{"anon": "stud", "bucket_name": "Week 1/7 - 1/13", "bucket_order": 115, "children": [], "config": {}, "created": "2018-01-08T22:52:03Z", "data": {"embed_links": null}, "folders": [], "id": "jc6sy3ugt076ce", "subject": "<p>This is probably not the answer you&#39;re looking for but research is good if you are working in a field that you are interested in and hoping to pursue further where your role gives you good experience in the research process in that field. Research is especially valuable if you get lucky enough to work on material which could potentially be publishable because the experience of participating in a publication helps you learn how to produce research which is appropriate to be shared with the greater research community in your field of interest. <br /><br />Research is relevant to people who are trying to get into grad school or get industry positions with research oriented elements. It can also be very rewarding and help you learn things you wouldn&#39;t have learned otherwise in your classes. Your chances of getting into grad school go up significantly if you have research experience, particularly if your research experience is close to the subject of the programs you are applying to. If you think you may be interested in graduate studies or if you think you may want to research in your future career you should try to pursue a ugrad research position. </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_4", "updated": "2018-01-08T22:52:03Z"}, {"anon": "stud", "bucket_name": "Week 1/7 - 1/13", "bucket_order": 115, "children": [], "config": {}, "created": "2018-01-09T15:47:51Z", "data": {"embed_links": null}, "folders": [], "id": "jc7t8fyurkr1lu", "subject": "<p>Same OP as the first comment in this sub-thread.</p>\n<p></p>\n<p>That&#39;s a fair point. I think broadly though, there are differences in research positions. Some people might be buying supplies for a professor, while others might be designing a research program autonomously, with lab resources. I have an interest in attending graduate school or doing research-based industry work, but I have difficulty understanding concretely what signifies good research for those purposes.</p>\n<p></p>\n<p>Should I just be doing enough to garner letters of recommendation?</p>\n<p></p>\n<p>Are publications important, and if so, should I be churning out papers or focusing on long-run material?</p>\n<p></p>\n<p>If I am doing research relevant to my interests, should that research be very applied and perhaps multi-disciplinary, or more theoretical/foundational and tied closer to the EECS department?</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_2", "updated": "2018-01-09T15:47:51Z"}, {"anon": "stud", "bucket_name": "Week 1/7 - 1/13", "bucket_order": 115, "children": [], "config": {}, "created": "2018-01-09T22:56:15Z", "data": {"embed_links": null}, "folders": [], "id": "jc88jd1rsp856c", "subject": "Not really experienced with research. But as with any other profession you should focus on something you are passionate about, not worrying about the end goal. “Garnering lor” or “churning out papers” suggests you care more about getting into grad school than actually learning about something you’re interested in...", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2018-01-09T22:56:15Z"}, {"anon": "stud", "bucket_name": "Week 1/7 - 1/13", "bucket_order": 115, "children": [], "config": {}, "created": "2018-01-09T23:55:59Z", "data": {"embed_links": null}, "folders": [], "id": "jc8ao6ck6ipup", "subject": "<p>I mean realistically speaking, research is a trade-off. I would be spending my summers doing NSF grants and stuff instead of higher paying internships, and I would take longer to graduate by taking more research oriented courses, especially on the EE side. If it turns out I need say a minimum of 10 papers to make it to a top 5 PhD program, then I&#39;ll have wasted my time and my parents&#39; sacrifice.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_2", "updated": "2018-01-09T23:55:59Z"}, {"anon": "stud", "bucket_name": "Week 1/7 - 1/13", "bucket_order": 115, "children": [], "config": {}, "created": "2018-01-09T23:57:36Z", "data": {"embed_links": null}, "folders": [], "id": "jc8aq953r4l2o6", "subject": "<p>I&#39;m first annon. You&#39;re totally right that ugrad research roles vary significantly. The more your role requires creative thinking and understanding of the material you are working on, the better. Broadly speaking, research requires you to come up with new ideas and test them rigorously. Ideally, you would like to be able to point to specific experiences where you can say that you contributed to generating ideas and testing them. So for example let&#39;s say you are working in an electronics lab and the group is trying to test a new idea. Let&#39;s compare two possible roles. One where you are soldering circuits for a test from a design that someone else made verses a role where you are given the open ended problem of designing a test for this theory and you design and solder the circuit yourself; the later role would be better. This is because the later role required you to demonstrated greater understanding of the material and the ability to come up with original ideas where the former demonstrates that you have lab skills and that you were exposed to research. The later is closer to a research role where the former is closer to a lab tech role. Both are good but the later is better if you are looking for research experience.   <br /><br />Of course you are an undergrad and you will be doing at least some level of (and more likely at first a lot of) &#34;undergrad work&#34; which generally is work that other people would prefer not to do. That is ok and to be expected (you are after all an undergrad). A typical trajectory for a ugrad student is to begin with work that is less interesting and then as you prove yourself your group will give you more interesting work. As you progress you should be open with your professor if you feel that you aren&#39;t learning from your assignments. Most professors who take on ugrads to begin with care about their ugrad students and will do their best to get you work that you find valuable, of course there are limitations which they need to work within. I would suggest that when you initially start doing research in a new lab you don&#39;t do it for course credit or pay. That way if you feel that the lab you are working in turns out to not a good fit, it is easier for you to leave. If you know you love a lab, by all means work in it for pay or course credit (disclaimer most labs won&#39;t pay you but course credit is generally easy to arrange). You should always be up front with the professors you are working with and prompt to let them know if you are planning to leave the lab. You should always have complete and polite closure with them if you decide to leave. They won&#39;t hold it against you. The worst thing you can do is sort of &#34;fizzle away&#34; without communicating with them. That gives ugrads a bad rep. I hope that better answers your questions about role, let me know if you have other questions.<br /><br />As the other anon said it is important to be passionate about what you are working on but I think it&#39;s important to keep in mind that sometimes it is difficult to find a group that exactly matches what you are looking for. At Berkeley you should be able to find something that is close enough to what you want that you will be happy and will gain valuable experience, even if it isn&#39;t quite what you see yourself doing long term. You should also make sure that the fit with your group is good. You will get more out of your research if you have a supportive group that is a little further from your research interest than you would in a less supportive group that does work exactly aligned with your research interests.  <br /><br />Publications are a bit of a tricky subject. Unfortunately bc publications are valuable there is a lot of bad science that people try to push through publication. If you are trying to go to grad school it helps your chances significantly to publish, so if you want to go to grad school you should make publishing a focus. It is difficult to get a publication however, and the quality of what you publish matters so I wouldn&#39;t focus on &#34;churning out&#34; publications but I would certainly make sure that what you are working on has a realistic potential of being published. Often times publishing is &#34;long-run material&#34; so I don&#39;t know what specifically you are referring to with regards to that. For many undergrads getting a publication is their long-run goal. If you get a publication, you will have an advantage over many undergrads when applying to grad programs. But again just like the anon above said, you should make sure you are trying to get into grad school for the right reasons. Generally speaking in EE/CS going to a phd program hurts your finances long term (I don&#39;t know about masters). For most people you will be financially better off if you start working straight out of ugrad and save properly than if you go to a phd program, even accounting for the pay increase from having a phd (this isn&#39;t always the case but it tends to be true). Grad school is difficult and if you are going for a phd it takes a really long time, you should only be pursuing this if you really want to do it for the right reasons.   <br /><br />Whether your research is more applied or theoretical will be determined by whether your interests are more in applied work or theoretical work. Research for theory and applied material can be quite different, even within the same field. Where your work will lie on the spectrum between application and theory will be determined by your interests (sorry if this is also a cop-out answer).</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_4", "updated": "2018-01-09T23:57:36Z"}, {"anon": "stud", "bucket_name": "Week 1/7 - 1/13", "bucket_order": 115, "children": [], "config": {}, "created": "2018-01-10T00:14:18Z", "data": {"embed_links": null}, "folders": [], "id": "jc8bbqcehb596", "subject": "<p>People successfully do internships, graduate on time, and get into great phd programs. It can be helpful to spend a summer doing research instead of doing an internship, particularly if you start doing research later in you ugrad career, but it isn&#39;t a necessity. Your decision of whether you plan to go straight to industry or do a phd program should be based on what life path you see making yourself the most happy, there is no catch-all right answer and no one can make that decision better than you can. <br /><br />No program requires a specific number of papers to get in. I know you are using hyperbole but basically no undergrads are applying with 10 publications. Very few apply with 3 or more. You should talk to professors here about what makes a good grad app since Berkeley has amazing, competitive programs and our professors are the ones admitting students. The number of publications is no where near as important as the quality of the publications and your contribution. A first author paper will be viewed with higher regard than a paper with lower authorship. Letters of rec are also very important. <br /><br />I also caution you from ranking phd programs. While there are definitely better phd programs than others, what is most important for a phd program is the work that the group you are joining is doing. Chasing name and ranking rather than looking for the right fit is a great way to make you hate your experience and that is very bad since 4-6 years is a long time to be unhappy. </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_4", "updated": "2018-01-10T00:14:18Z"}, {"anon": "stud", "bucket_name": "Week 1/7 - 1/13", "bucket_order": 115, "children": [], "config": {}, "created": "2018-01-10T00:25:25Z", "data": {"embed_links": null}, "folders": [], "id": "jc8bq1drnvo2as", "subject": "<p>And I also want to add that people go on to lead very happy, financially strong, successful lives where they contribute significantly to society, their families, their communities, their countries, and the greater scientific community whether they went to grad school or not. The same can be said for people who went to grad schools of all different rankings. You should check out where our professors went to school, they didn&#39;t all go to &#34;top 5&#34; programs and all of them do incredible work. If you succeed in Berkeley engineering, it is very likely your life trajectory will be positive, regardless of whether you go to grad school or not. So make the choice that you think would make you happiest. </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_4", "updated": "2018-01-10T00:25:25Z"}], "config": {}, "created": "2018-01-07T21:29:07Z", "data": {"embed_links": null}, "folders": [], "id": "jc5ajm373pu6e3", "no_answer": 0, "no_upvotes": 0, "subject": "<p>What constitutes &#34;good&#34; research and why is it so relevant? </p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_2", "updated": "2018-01-07T21:29:07Z"}, {"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2018-01-07T23:40:51Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "There was a similar reddit thread, there’s 3 ways, from most likely to least:\n1) Know a friend who is currently researching. If they put in a good word for you and they’re leaving their position you can probably fill in for them.\n2) Apply to urap, beehive. This is probably the standard way, but it’s really competitive so doing “decent” in classes probably isn’t enough merit on its own. It sucks but it’s a huge school and you’re not entitled to research just by virtue of passing your classes.\n3) Cold email professors. This is risky because some profs think it’s unprofessional, you should read their opinions on this on their website.\nSome people say to email grad students, but apparently that runs the risk of not being really worth your time if you’re not somehow related to a prof.", "created": "2018-01-07T23:40:51Z", "subject": "", "uid_a": "a_3"}], "id": "jc5f90sh2x64kp", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "j3l3zadxpy7594", "name": "Viraj Attre", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["j3l3zadxpy7594"], "type": "s_answer"}, {"anon": "stud", "bucket_name": "Week 1/7 - 1/13", "bucket_order": 115, "children": [], "config": {}, "created": "2018-01-09T06:17:56Z", "data": {"embed_links": null}, "folders": [], "id": "jc78vihsl042wh", "no_answer": 0, "no_upvotes": 0, "subject": "What I&#39;ve done is drop in on the professor&#39;s office hours.", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_5", "updated": "2018-01-09T06:17:56Z"}], "config": {}, "created": "2018-01-07T09:11:06Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["eecs", "faculty_advising", "peer_directed", "lscs", "other"], "history": [{"anon": "stud", "content": "So I&#39;ve been trying to apply to some eecs research positions this spring/summer and I am finding it very difficult as most of the professors either don&#39;t respond or require previous experience in the field. I have taken many courses and the necessary courses and have done decently in them and have expressed my strong desire to learn but it seems like I need research experience in a certain field to start research in that certain field which seems circular or I get ignored. Is anyone else having similar problems and mind suggesting some tips in getting involved in eecs undergrad research especially in centers and labs here at berkeley?", "created": "2018-01-07T09:11:06Z", "subject": "EECS Research Help", "uid_a": "a_0"}], "i_edits": [], "id": "jc4k6hzd5vw75", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 5918, "num_favorites": 10, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654550470542, "tag_good": [{"admin": false, "endorser": {"global": 1557212965, "jpdq1epqrr3231": 1557211704, "jqtyr3q4ryo4z3": 1554878989}, "facebook_id": null, "id": "j3qb8b5k8gni8", "name": "Bryan Chen", "photo": "1548706388_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/j3qb8b5k8gni8/1548706388_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p6tenz6b5ny", "name": "Zipeng Qin", "photo": "1529141551_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/is6p6tenz6b5ny/1529141551_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"hyq0br1u3kx7dg": 1548279114}, "facebook_id": null, "id": "iy0l2muelq84t9", "name": "Sai Mandava", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is9ei2yilid4ql", "name": "Katherine Yen", "photo": "1567144735_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/is9ei2yilid4ql/1567144735_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p8zl3nphb8", "name": "Dominic Carrano", "photo": "1539468621_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/is6p8zl3nphb8/1539468621_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p815tz306kj", "name": "Averal Kandala", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "it3yyo9tj157o2", "name": "Leon Kwak", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p759ji5o5ws", "name": "Vera Wang", "photo": "1529996635_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/is6p759ji5o5ws/1529996635_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvhopc26l6a8", "name": "Laiming Huang", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["j3qb8b5k8gni8", "is6p6tenz6b5ny", "iy0l2muelq84t9", "is9ei2yilid4ql", "is6p8zl3nphb8", "is6p815tz306kj", "it3yyo9tj157o2", "is6p759ji5o5ws", "jktvhopc26l6a8"], "tags": ["eecs", "faculty_advising", "lscs", "other", "peer_directed", "student"], "type": "question", "unique_views": 512}