{"bookmarked": 3, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "jcck6lvfne9761", "type": "create", "uid": "hkyddknu435n5", "when": "2018-01-12T23:33:20Z"}, {"anon": "no", "data": "jcckeqj3lad45q", "type": "update", "uid": "hkyddknu435n5", "when": "2018-01-12T23:39:39Z"}, {"anon": "no", "data": "jccmpnzxqfj1n1", "type": "update", "uid": "hkyddknu435n5", "when": "2018-01-13T00:44:09Z"}, {"anon": "no", "data": "jcmaoxizf62e6", "type": "update", "uid": "hz4ud741s6s1gn", "when": "2018-01-19T19:05:21Z"}], "children": [], "config": {}, "created": "2018-01-12T23:33:20Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements"], "history": [{"anon": "no", "content": "<p><strong>Help the EECS Department &amp; Win Amazon Gift Cards!</strong></p>\n<p>Hi everyone!</p>\n<p>Want to have your voice heard by EECS faculty, staff, and the Chairs?</p>\n<p>HKN and other EECS student organizations have composed the 2017-18 EECS Undergraduate Survey so you can provide input and feedback to our very own EECS Department. This is a great opportunity for you to make a real impact in your classes, student life, and campus culture. Your thoughts <em>will </em>reach faculty and will be used to help improve the department and the community!</p>\n<p>In addition, once you complete the survey, you can choose to enter a prize drawing to win one of fifteen (15) $10 Amazon gift cards!</p>\n<p>Your response is completely anonymous. We encourage you to respond openly and honestly!</p>\n<p>The survey is available here:</p>\n<p><a href=\"https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5\">https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5</a></p>\n<p> </p>\n<p><strong>CTSP Data for Good Competition</strong></p>\n<p>The Center for Technology, Society &amp; Policy (CTSP) seeks proposals for a <strong><a href=\"https://ctsp.berkeley.edu/data-for-good-competition/\">Data for Good Competition</a></strong>. The competition will be hosted and promoted by CTSP and made possible through funds provided by Facebook.<br /><br />Team proposals will apply data science skills to address a social good problem with public open data. The objective of the Data for Good Competition is to incentivize students from across the UC Berkeley campus to apply their data science skills towards a compelling public policy or social justice issue.<br /><br />The competition is intended to encourage the creation of data tools or analyses of open data. Issues that may be relevant and addressed via this competition include environmental issues, civic engagement (e.g., voting), government accountability, land use (e.g., housing challenges, agriculture), criminal justice, access to health care, etc. CTSP suggests that teams should consider using local or California state data since there may be additional opportunities for access and collaboration with agencies who produce and maintain these datasets.<br /><br />The competition will consist of three phases:<br />-Initial proposal phase when teams work on developing proposals (<strong>Due January 28, 2018</strong>)<br />-Seed grant execution phase when selected teams execute on their proposals (<strong>Comes with $800 per team</strong>)<br />-Final competition and presentation of completed projects at an event in April 2018 (<strong>$5000 grand prize; $2000 runner-up</strong>)<br /><br />More information may be found on CTSP&#39;s website (<a href=\"https://ctsp.berkeley.edu/data-for-good-competition/\">https://ctsp.berkeley.edu/data-for-good-competition/</a>) and questions may be directed to <a href=\"mailto:CTSP&#64;berkeley.edu\">CTSP&#64;berkeley.edu</a></p>\n<p></p>\n<p><strong>Tokyo Tech CAMPUS Asia SUMMER SCHOOL 2018 [Applications due January 31]</strong></p>\n<p>Under the CAMPUS Asia Initiative of the governments of Japan, China and South Korea, Tokyo Tech is an active participant in and contributor to the TKT CAMPUS Asia Consortium, a joint education and research program with Tsinghua University and KAIST. In our Summer School 2018, as part of the Consortium&#39;s activities, we offer two types of Summer Program: a Course-Oriented Program for undergraduate students, and a Research-Oriented Program for undergraduate and graduate students. In the Summer School, students from countries outside Asia will also participate. </p>\n<p> </p>\n<p>For program details, please visit their website:</p>\n<p><a href=\"http://www.ipo.titech.ac.jp/campusasia/intl_students/\">http://www.ipo.titech.ac.jp/campusasia/intl_students/</a>.</p>\n<p> </p>\n<p><strong>The Fung Fellowship for Wellness and Technology Innovation Program:</strong></p>\n<p>The <a href=\"https://fungfellows.berkeley.edu/\">Fung Fellowship</a> is a unique opportunity for rising juniors to participate in an interdisciplinary fellowship experience at the intersection of public health, design, and digital technology. Students from ALL majors work in teams to create innovative health and wellness solutions to address real-world challenges alongside our community and industry partners. Fung Fellows utilize the iterative human-centered design process, public health principles, and emerging technology, such as VR, AI, machine learning, and blockchain. <br /><br /></p>\n<p>As a Fung Fellow you will:</p>\n<ul><li>  Explore the Health &#43; Tech space</li><li>  Experience the design process from prototype to product</li><li>  Embed in communities to co-create with them</li><li>  Establish yourself as a young leader in an emerging field</li></ul>\n<p> </p>\n<p>Selected Fung Fellows attend a 3-unit course each semester, are supported in a summer internship, and have the opportunity to apply to a second year honors program. <br /><br /></p>\n<p><strong>Required Qualifications:</strong></p>\n<ul><li>  Registered student at UC Berkeley</li><li>  Rising Junior with a passion for health, wellness, social impact, design, and/or technology<br /><br /></li></ul>\n<p><strong>Find out more at our Info Sessions:</strong></p>\n<ul><li>  Tuesday, January 23rd at 4:00pm</li><li>  Friday, January 26th at 12:00pm</li><li>  Sign up and learn more about the <a href=\"https://goo.gl/forms/CoxoMUn3jStcLQsW2\">FF Info Session here</a></li></ul>\n<p> </p>\n<p><strong>How to Apply:</strong></p>\n<ol><li>    Learn more about the program at: <a href=\"https://fungfellows.berkeley.edu/\">https://fungfellows.berkeley.edu/</a></li><li>    Sign up for an<a href=\"https://goo.gl/forms/CoxoMUn3jStcLQsW2\"> info session</a> to find out more about our program</li><li>    Please apply by completing this <a href=\"https://goo.gl/forms/cUTFixKxVoRun1px2\">online application form</a>.</li><li>    Deadline to apply: <strong>February 1st, 2018 5:00pm PST</strong>. We will begin interviewing candidates on a rolling basis.</li></ol>\n<p></p>\n<p><strong>Spring Courses on Entrepreneurship Alternative Meat/ BlockChain/</strong></p>\n<p>The <a href=\"http://scet.berkeley.edu/\">Center for Entrepreneurship &amp; Technology</a> has a few spring 2018 Challenge Lab courses with open seats. Although our courses and center are in the College of Engineering, our classes are open to<em> all</em> majors.  This semester our courses range from alternative meat solutions, to Blockchain, and disaster and recovery.</p>\n<p> </p>\n<p>INDENG 185-001: The Challenge Lab; Blockchain</p>\n<p>Th 4PM-7PM; Instructor(s) P.C. Wu; 4 units</p>\n<p><em>Blockchain is among the most exciting recent developments in computer science. While it has served the basis of the Bitcoin currency, it has significantly more potential because its crypto-locked distributed database has the potential to offer trust, security, and smart contracts to a new generation of internet applications.</em></p>\n<p>INDENG 185-002: The Challenge Lab; Disaster and Recovery in Puerto Rico</p>\n<p>Th 4-7PM; Instructor(s) R. Powers; 4 units</p>\n<p><em>In this course, you will learn how to apply the Berkeley Method of Entrepreneurship (BMoE) to build novel solutions and social enterprises that will help deliver the next generation of solutions to aide and recovery of natural disasters. Given the shifting global climate, disaster and recovery is an emerging need and growth area worldwide. The climate crisis is no longer an abstract issue and needs to be addressed in our lifetime.</em></p>\n<p> </p>\n<p>INDENG 185-003: The Challenge Lab; Data &amp; Internet Privacy</p>\n<p>W 5-8PM; Instructor(s) L Edwards; 4 units</p>\n<p><em>Today, online data trails provide large volumes of personal, real-time consumer information to companies doing business on the Internet. Data tracking and mining provide tremendous opportunity for businesses to personalize content and make decisions about which customers to pursue and what to offer them. At the same time, purchase and use histories, GPS locations, browsing behaviors or social media postings allow companies to connect and mine data streams to gain insights and details that consumers may consider private and may incorrectly assume is undiscoverable.</em></p>\n<p>INDENG 185-004: The Challenge Lab; Cybersecurity</p>\n<p>W 3PM-6PM; Instructor(s) R. Rasmussen; 4 units</p>\n<p><em>Information breaches clearly aren’t being solved by cybersecurity technology alone. Since the information you’re protecting, who you’re protecting it from and why are drastically different for corporations, nation states and critical infrastructure providers, an integrated holistic approach to thwarting bad actors is required. This Challenge Lab explores the next generation of Cybersecurity paradigms as they relate to attacker motivation and actions.</em></p>\n<p><br />INDENG 185-005: The Challenge Lab; Alternative Meat</p>\n<p>W 4-7PM; Instructor(s) R. San Martin; 4 units</p>\n<p><em>This course is for students interested in <strong>creating the next generation</strong> of healthy, delicious, affordable and <strong>sustainable plant-based protein</strong> foods. Embark on a unique, team-based challenge to <strong>build novel enterprises</strong> to address the most pressing <strong>environmental and ethical issues</strong> of our times.</em></p>\n<p></p>\n<p><strong>DUE 12N, Tues 2/20/17 - Prytanean Prize - $1250</strong></p>\n<p>The Prytanean Alumnae, Inc. (<a href=\"http://www.prytanean.org/\">www.prytanean.org</a>) is currently accepting applications for the <strong>Prytanean Prize </strong>for female UCB student with junior standing.  The prize is given in recognition of campus and community service, as well as, academic excellence (GPA of 3.2 or better is required).  The recipient will receive a $1,250 cash prize at the Prytanean Alumni Brunch on Sat, April 14, 2017, 9 a.m. - noon at the Bancroft Hotel.  Applicants: Save the date!</p>\n<p> </p>\n<p>The Prytanean Women&#39;s Honor Society was founded at Berkeley in 1900 to recognize Cal women students who demonstrate faith, service and loyalty to the University of California, Berkeley.</p>\n<p> </p>\n<p>The instructions and nomination forms can be accessed <a href=\"https://alumnichapters.berkeley.edu/prytanean/2018awardapplications0\">here</a>.  Prize application packets are due 12n on Tuesday, February 20, 2018 via email to <a href=\"mailto:PRYTPRIZE&#64;GMAIL.COM\">PRYTPRIZE&#64;GMAIL.COM</a></p>\n<p> </p>\n<p>PACKET CHECKLIST (to be attached to with submission):</p>\n<p>Completed nominations should include:</p>\n<p>• nomination form</p>\n<p>• current résumé  </p>\n<p>• unofficial UCB transcript (for GPA verification purposes),</p>\n<p>• leadership and service essay, and </p>\n<p>• at least one letter of recommendation* (three maximum faculty, staff, students, or community members)</p>\n<p>• brief bio &amp; statement </p>\n<p> </p>\n<p>If you have questions, please contact our Prytanean Student Awards Chair, Aviva Shiff Boedecker at <a href=\"mailto:Boedecker.a&#64;gmail.com\">Boedecker.a&#64;gmail.com</a>.</p>\n<p> </p>\n<p><strong><em>APPLICATIONS MUST BE RECEIVED BY 12NOON, TUESDAY, FEBRUARY 20, 2018</em></strong></p>\n<p><strong><em> </em></strong></p>\n<p><strong>SLC Mastering the Social Sciences Workshop Series (First two weeks of the Spring 2018 semester)</strong></p>\n<p>The  Student Learning Center (SLC) Social Science Program is happy to announce the <a href=\"http://slc.berkeley.edu/special-events-and-workshops\">Mastering the Social Sciences Workshop Series at the SLC</a>.  We designed these workshops for incoming first-year students, new transfer students, and continuing students taking social science courses who are seeking to develop useful learning processes. </p>\n<p> </p>\n<p>Students can <a href=\"https://docs.google.com/a/berkeley.edu/forms/d/e/1FAIpQLSdAkOU38CoGMUuwjTQEzZg7Yo0zd00n5d5HE6dntBzJ56_ALQ/viewform\">RSVP</a> for any or all of these free workshops occurring the first two weeks of classes. The workshop topics, days/times, &amp; attached flyer can be found below.</p>\n<p></p>\n<p>Getting Your &#34;Mindset&#34; for a Successful Semester</p>\n<p><strong>Tuesday, January 16 </strong></p>\n<p><strong>12:30-2:00 p.m.(151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (113 Chavez Center)</strong></p>\n<p>Get off to a great start by learning about Carol S. Dweck’s Mindsets.  Her groundbreaking research has been used by students transitioning to the university, professional athletes, and successful people at the top of their fields.  This workshop will introduce you to the mindsets so that you might apply them in developing powerful learning processes for success.  The workshop will connect the mindsets to the other workshops in the workshop series.</p>\n<p> </p>\n<p>Calendaring &amp; Organizing for Success</p>\n<p><strong>Wednesday, January 17</strong></p>\n<p><strong>12:00-1:30 p.m. (151 Chavez Center)</strong></p>\n<p><strong>2:00-3:30 p.m. (151 Chavez Center)</strong></p>\n<p>The first step to mastering social science courses at Cal is to develop a process for getting organized for the semester.  This workshop will support students to: 1) Read, understand, and analyze the course syllabus to understand the expectations and keys to success in the particular social science courses, 2) Utilize the 17-week SLC Calendar to plan and manage time in the long-term and short term, 3) Anticipate and avoid pitfalls that may occur during the long semester.</p>\n<p> </p>\n<p>Predicting Questions and Preparing in Advance for Exams &amp; Papers</p>\n<p><strong>Thursday, January 18 </strong></p>\n<p><strong>12:30-2:00 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (151 Chavez Center)</strong></p>\n<p>The secret to engagement and success is to predict paper prompts and examination questions well in advance.  Can a student actually predict examination questions and paper prompts weeks before a paper or exam format is actually introduced?  The answer is yes!  This workshop will unveil the secrets and allow you to practice this skill beginning on your first day of class. The secret might also be the source that motivates, engages, and leads students to ultimate success. </p>\n<p> </p>\n<p>The Secrets to Reading: Addressing Volume &amp; Density</p>\n<p><strong>Monday, January 22 </strong></p>\n<p><strong>12:00-1:30 p.m. (151 Chavez Center)</strong></p>\n<p><strong>2:00-3:30 p.m. (151 Chavez Center)</strong></p>\n<p>Does the dense and large volumes of reading in social sciences concern you?  This workshop will support students by: 1) Informing students of the different types of reading assigned and how to prioritize, 2) Providing students with basic reading strategies that will allow them to synthesize, connect, and review assigned texts, 3) Developing a reading process that will allow students to understand concepts deeply in order to prepare for papers, quizzes, and midterm exams.</p>\n<p> </p>\n<p>The Art of Note-taking: Triangulating Reading, Lecture/Discussion, &amp; Office Hours</p>\n<p><strong>Tuesday, January 23</strong></p>\n<p><strong>12:30-2:00 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (113 Chavez Center)</strong></p>\n<p>The large, undergraduate lecture can be a difficult educational format to navigate given the fact that lecturers are given in various styles and at various speeds.  Moreover, note-taking is complicated because students can take-notes in lecture, discussion, and for office hours.  This workshop will: 1) identify various lectures styles and course situations, 2) discuss different note-taking processes that might optimize different types of learning styles, and 3) examining tangible strategies for students to develop note-taking to meet course assessment expectations. </p>\n<p> </p>\n<p>Forming Powerful Study Groups</p>\n<p><strong>Wednesday, January 24</strong></p>\n<p><strong>12:00-1:30 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:00-4:30 p.m. (151 Chavez Center)</strong></p>\n<p>Powerful study groups can facilitate efficient studying and deeper understanding of course concepts.  This workshop will: 1)Take inventory of facets that students should consider when establishing study partnerships, 2)Provide practical tools students can use when collaborating, and 3) Suggest tips to ensure focused and welcoming spaces that foster academic integrity. Powerful study groups can cultivate lifelong friendships.  This workshop can foster community building while making the social sciences more social and fun!</p>\n<p> </p>\n<p>The Art of the Office Hour </p>\n<p><strong>Thursday, January 25</strong></p>\n<p><strong>12:30-2:00 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (151 Chavez Center)</strong></p>\n<p>The art of the office hour is knowing the context of the visit, preparing adequately in advance, &amp; ensuring that one leaves a good impression.  This workshop can help you build rapport with your instructors &amp; increase you course engagement.</p>\n<p> </p>\n<p>Navigating Your Discipline</p>\n<p><strong>Friday, January 26</strong></p>\n<p><strong>12:00-1:30 p.m. (113 Chavez Center)</strong></p>\n<p><strong>3:00-4:30 p.m. (113 Chavez Center)</strong></p>\n<p>This workshop can support your development of a process to make more informed decisions about the discipline you choose and your navigation within it at Cal and beyond.</p>\n<p> </p>\n<p><strong>Student Tech Services Now Hiring!</strong></p>\n<p><a href=\"https://studenttech.berkeley.edu/\">Student Tech Services</a> is now hiring! Jobs for the summer and 2018/19 school year are now open at <a href=\"https://studenttech.berkeley.edu/student-jobs\">studenttech.berkeley.edu/student-jobs</a></p>\n<p> </p>\n<ul><li>  A variety of positions with competitive pay! ($15-22.75/hr)</li><li>  Flexible schedules in a student friendly office</li><li>  On the job training, no experience required for many of our positions</li></ul>\n<p> </p>\n<p>Join us for our Student IT Job Fair on Monday, February 5th for a chance to talk with our current staff and get help with your resume! <a href=\"http://bit.ly/IT_Job_Fair\">http://bit.ly/IT_Job_Fair</a><br /><br /></p>\n<p>Apply by 5pm, Friday February 9th!</p>\n<p> </p>\n<p><a href=\"https://www.youtube.com/watch?v=KxiaweXB2Vo\">Student Tech Services Promo Video</a></p>\n<p></p>\n<p><strong>ICRA2018 DJI RoboMaster AI Challenge</strong></p>\n<p>RoboMaster is a robotics competition brand created by DJI, the world-leading drone manufacturer. The aim of this competition to nurture next generation robotics engineer and educate general public about state-of-art robotics technologies. The annual competition requests teams who to build ground robots that use shooting mechanisms to battle with other robots, and the performance of the robots are monitored by a specially designed Referee System, converting projectile hits into Health Point deduction of robots. The competition balances technology and entertainment. Many game elements in the competition are similar to video games.</p>\n<p>RoboMaster now has two competition tracks targeting different groups of students. </p>\n<p>Track 1, the main track, is RoboMaster FPS competition. Its target participants are mainly undergraduate students who can gain basic system design and implementation experience from making shooter robots, which benefits their future careers as engineers. To compete in this track, a team of 3-35 members should be organized. And estimated cost for attending the competition is $50,000 USD. Students are encouraged to explore sponsors and school support by themselves to cover the cost. Since each year millions of people will watch RoboMaster FPS competition live broadcast and the competition organizing committee will help students to promote their teams, potential sponsors can have global brand exposure. The registration process for RoboMaster FPS competition 2018 is finished by this November. To see the RoboMaster2018 promotional video, go to <a href=\"https://youtu.be/uI2uoV58pzQ\">https://youtu.be/uI2uoV58pzQ</a></p>\n<p>Track 2, RoboMaster Technical Challenge. This track is harder to participate because all robots enter the challenge must be fully autonomous. Correspondingly, the game theme is simplified in order to let autonomous robots maneuver within it. The Challenge in 2018 will be hosted alongside with IEEE International Conference on Robotics &amp; Automation (ICRA) 2018 in Brisbane, Australia. It is called AI Challenge because the goal of this Challenge is to design autonomous shooter robots that can team up, make decisions and fight with opponent shooter robots. To accomplish this task, strong AI should be planted in robots. The Technical Challenge aims to stimulate new robotics systems that better combine AI with multiple robots. And participants are expected to publish research papers about their systems used for the Challenge. Team can have 1-10 members. We recommend the majority of the team members are graduate students. For AI Challenge rulebook downloading, please visit <a href=\"https://www.robomaster.com/en-US/resource/pages/728?type=announcementSub\">https://www.robomaster.com/en-US/resource/pages/728?type=announcementSub</a> .</p>\n<p>The ICRA 2018 DJI RoboMaster AI Challenge is currently open for registration to university students. Interested teams can go to <a href=\"https://www.robomaster.com/en-US/user/login\">https://www.robomaster.com/en-US/user/login</a> to submit their applications. Attachments are slides contain detailed information for AI Challenge such as challenge overview, entry instructions and schedule.</p>\n<p>RoboMaster Website: <a href=\"https://www.robomaster.com/en-US\">https://www.robomaster.com/en-US</a></p>\n<p>RoboMaster Q&amp;A Email: <a href=\"mailto:robomaster&#64;dji.com\">robomaster&#64;dji.com</a></p>\n<p>ICRA2018 Website: <a href=\"http://icra2018.org/\">http://icra2018.org/</a>​​</p>\n<p>ICRA2018 DJI RoboMaster AI Challenge: <a href=\"http://icra2018.org/dji-robomaster-ai-challenge/\">http://icra2018.org/dji-robomaster-ai-challenge/</a><a href=\"http://icra2018.org/dji-robomaster-ai-challenge/\"></a></p>\n<p></p>\n<p><strong>Summer 2018 Engineering Internship Opportunity: San Francisco Bay Area Rapid Transit</strong></p>\n<p>We are very excited to be announcing our Summer 2018 internship opportunity. We will begin accepting applications through our <a href=\"https://www.bart.gov/about/jobs\">website</a> on January 22, 2018. Flyer <a href=\"https://www.bart.gov/sites/default/files/docs/BART_summer_%20internship_2018_flyer.pdf\">here</a>.</p>\n<p> </p>\n<p>This summer internship program is scheduled to run for eight (8) weeks beginning on June 18, 2018 and ending on August 10, 2018. All candidates selected must be able to attend the entire program.</p>\n<p> </p>\n<p>Candidates will be selected from one or more of the following majors:</p>\n<p>•             Civil Engineering</p>\n<p>•             Construction Management</p>\n<p>•             Computer Engineering</p>\n<p>•             Computer Science</p>\n<p>•             Electronic Engineering</p>\n<p>•             Mechanical Engineering</p>\n<p>•             Mechatronic Engineering</p>\n<p>•             Structural Engineering</p>\n<p>•             Systems &amp; Control Engineering</p>\n<p> </p>\n<p>Summer Interns that have completed our internship program have stated:</p>\n<ul><li>        <em>“I’ve learned a lot about the actual application and safety that engineers are entitled to abide by. BART’s friendly environment has definitely made me more of an extrovert and improved my communication skills within a working environment and my personal life. I have realized that without clear and concise communication, many small tasks may potentially lead into a bigger problem down the line.”</em></li><li>        <em>“The BART internship gave me exactly the opportunity to apply the knowledge I had to real life application that can affect 450,000 people a day. I am proud that my project can improve overall safety for the BART power system as well as the BART passengers. Aside from that, the teamwork and time management skills I learned from the summer internship can also be beneficial in my future career.”</em></li></ul>\n<p><em> </em></p>\n<p><strong>SIEPR / Econ Predoctoral Research Fellows Program, 2018-19</strong></p>\n<p>The Stanford Institute for Economic Policy Research (SIEPR) and Stanford Economics are pleased to open applications for our <strong>Predoctoral Research Fellowship Program</strong>. Applications are being accepted for positions starting Summer 2018.</p>\n<p> </p>\n<p>Full program and application information is available on our website at: <a href=\"https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship\">https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship</a>. Applications received on or before <strong>March 31, 2018</strong> will be reviewed on a rolling basis.</p>\n<p> </p>\n<p>The SIEPR/Economics Predoctoral Research Fellowship program is a full-time, post baccalaureate program designed to prepare individuals wishing to gain valuable training and experience toward a career in academic research in economics or public policy. Fellows will be expected to fully engage in the intellectual life at Stanford University. They dedicate a significant portion of their time to an empirical research project and can take graduate-level courses at Stanford University for credit (up to one course per quarter). The fellowship offers tuition, health insurance, and a living stipend. We seek individuals to join our program for a period of at least one year. International applicants are welcome to apply.</p>\n<p> </p>\n<p>Ideal candidates will have:</p>\n<ul><li>Completed a 4-year undergraduate degree (bachelors or foreign equivalent) in economics, statistics, applied mathematics, or a related field;</li><li>A strong quantitative background and interest in learning cutting-edge research methods;</li><li>Creative and independent problem-solving skills;</li><li>Experience programming in Stata and R, and may have experience with GIS, Matlab, and other statistical packages; and</li><li>An interest in pursuing a PhD in Economics or a related field.</li></ul>\n<p> </p>\n<p>For position descriptions, application information, and FAQs, please visit our website: <a href=\"https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship\">https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship</a><a href=\"https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship\"></a></p>\n<p></p>\n<p><strong>Advanced Computational Research Experience for Undergraduates (ACRES)</strong></p>\n<p>Michigan State University will host a 10-week NSF Summer Research Experience for Undergraduates (REU) in computational and data science beginning May 21-July 27, 2018. </p>\n<p>Projects provided through iCER ACRES: Advanced Computational Research Experience for Students (ACRES) focus on the development and enhancement of algorithms, models, and software for applications in multiple research areas that require high-performance computing resources.  </p>\n<p> </p>\n<p><strong>Research areas include:</strong> computational chemistry, biology, biomechanics, physics, astrophysics, mathematics, machine learning, materials science, earth science (seismology) and neuroscience.</p>\n<p><strong>Who should apply:</strong> Undergraduate US citizens or permanent residents from a wide variety of fields, including STEM disciplines are invited to apply. Women and other underrepresented minorities are encouraged to apply.</p>\n<p> </p>\n<p><strong>We are now accepting applications! </strong>For more information and to apply visit: <a href=\"http://icer-acres.msu.edu/\">http://icer-acres.msu.edu</a>. </p>\n<p> Applications received by<strong> </strong>February 16, 2018 will be given first preference.</p>\n<p></p>\n<p></p>", "created": "2018-01-19T19:05:21Z", "subject": "1.12.2018 Undergraduate Announcements", "uid": "hz4ud741s6s1gn"}, {"anon": "no", "content": "<p><strong>Help the EECS Department &amp; Win Amazon Gift Cards!</strong></p>\n<p>Hi everyone!</p>\n<p>Want to have your voice heard by EECS faculty, staff, and the Chairs?</p>\n<p>HKN and other EECS student organizations have composed the 2017-18 EECS Undergraduate Survey so you can provide input and feedback to our very own EECS Department. This is a great opportunity for you to make a real impact in your classes, student life, and campus culture. Your thoughts <em>will </em>reach faculty and will be used to help improve the department and the community!</p>\n<p>In addition, once you complete the survey, you can choose to enter a prize drawing to win one of fifteen (15) $10 Amazon gift cards!</p>\n<p>Your response is completely anonymous. We encourage you to respond openly and honestly!</p>\n<p>The survey is available here:</p>\n<p><a href=\"https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5\">https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5</a></p>\n<p> </p>\n<p><strong>CTSP Data for Good Competition</strong></p>\n<p>The Center for Technology, Society &amp; Policy (CTSP) seeks proposals for a <strong><a href=\"https://ctsp.berkeley.edu/data-for-good-competition/\">Data for Good Competition</a></strong>. The competition will be hosted and promoted by CTSP and made possible through funds provided by Facebook.<br /><br />Team proposals will apply data science skills to address a social good problem with public open data. The objective of the Data for Good Competition is to incentivize students from across the UC Berkeley campus to apply their data science skills towards a compelling public policy or social justice issue.<br /><br />The competition is intended to encourage the creation of data tools or analyses of open data. Issues that may be relevant and addressed via this competition include environmental issues, civic engagement (e.g., voting), government accountability, land use (e.g., housing challenges, agriculture), criminal justice, access to health care, etc. CTSP suggests that teams should consider using local or California state data since there may be additional opportunities for access and collaboration with agencies who produce and maintain these datasets.<br /><br />The competition will consist of three phases:<br />-Initial proposal phase when teams work on developing proposals (<strong>Due January 28, 2018</strong>)<br />-Seed grant execution phase when selected teams execute on their proposals (<strong>Comes with $800 per team</strong>)<br />-Final competition and presentation of completed projects at an event in April 2018 (<strong>$5000 grand prize; $2000 runner-up</strong>)<br /><br />More information may be found on CTSP&#39;s website (<a href=\"https://ctsp.berkeley.edu/data-for-good-competition/\">https://ctsp.berkeley.edu/data-for-good-competition/</a>) and questions may be directed to <a href=\"mailto:CTSP&#64;berkeley.edu\">CTSP&#64;berkeley.edu</a></p>\n<p></p>\n<p><strong>Tokyo Tech CAMPUS Asia SUMMER SCHOOL 2018 [Applications due January 31]</strong></p>\n<p>Under the CAMPUS Asia Initiative of the governments of Japan, China and South Korea, Tokyo Tech is an active participant in and contributor to the TKT CAMPUS Asia Consortium, a joint education and research program with Tsinghua University and KAIST. In our Summer School 2018, as part of the Consortium&#39;s activities, we offer two types of Summer Program: a Course-Oriented Program for undergraduate students, and a Research-Oriented Program for undergraduate and graduate students. In the Summer School, students from countries outside Asia will also participate. </p>\n<p> </p>\n<p>For program details, please visit their website:</p>\n<p><a href=\"http://www.ipo.titech.ac.jp/campusasia/intl_students/\">http://www.ipo.titech.ac.jp/campusasia/intl_students/</a>.</p>\n<p> </p>\n<p><strong>The Fung Fellowship for Wellness and Technology Innovation Program:</strong></p>\n<p>The <a href=\"https://fungfellows.berkeley.edu/\">Fung Fellowship</a> is a unique opportunity for rising juniors to participate in an interdisciplinary fellowship experience at the intersection of public health, design, and digital technology. Students from ALL majors work in teams to create innovative health and wellness solutions to address real-world challenges alongside our community and industry partners. Fung Fellows utilize the iterative human-centered design process, public health principles, and emerging technology, such as VR, AI, machine learning, and blockchain. <br /><br /></p>\n<p>As a Fung Fellow you will:</p>\n<ul><li>  Explore the Health &#43; Tech space</li><li>  Experience the design process from prototype to product</li><li>  Embed in communities to co-create with them</li><li>  Establish yourself as a young leader in an emerging field</li></ul>\n<p> </p>\n<p>Selected Fung Fellows attend a 3-unit course each semester, are supported in a summer internship, and have the opportunity to apply to a second year honors program. <br /><br /></p>\n<p><strong>Required Qualifications:</strong></p>\n<ul><li>  Registered student at UC Berkeley</li><li>  Rising Junior with a passion for health, wellness, social impact, design, and/or technology<br /><br /></li></ul>\n<p><strong>Find out more at our Info Sessions:</strong></p>\n<ul><li>  Tuesday, January 23rd at 4:00pm</li><li>  Friday, January 26th at 12:00pm</li><li>  Sign up and learn more about the <a href=\"https://goo.gl/forms/CoxoMUn3jStcLQsW2\">FF Info Session here</a></li></ul>\n<p> </p>\n<p><strong>How to Apply:</strong></p>\n<ol><li>    Learn more about the program at: <a href=\"https://fungfellows.berkeley.edu/\">https://fungfellows.berkeley.edu/</a></li><li>    Sign up for an<a href=\"https://goo.gl/forms/CoxoMUn3jStcLQsW2\"> info session</a> to find out more about our program</li><li>    Please apply by completing this <a href=\"https://goo.gl/forms/cUTFixKxVoRun1px2\">online application form</a>.</li><li>    Deadline to apply: <strong>February 1st, 2018 5:00pm PST</strong>. We will begin interviewing candidates on a rolling basis.</li></ol>\n<p></p>\n<p><strong>Spring Courses on Entrepreneurship Alternative Meat/ BlockChain/</strong></p>\n<p>The <a href=\"http://scet.berkeley.edu/\">Center for Entrepreneurship &amp; Technology</a> has a few spring 2018 Challenge Lab courses with open seats. Although our courses and center are in the College of Engineering, our classes are open to<em> all</em> majors.  This semester our courses range from alternative meat solutions, to Blockchain, and disaster and recovery.</p>\n<p> </p>\n<p>INDENG 185-001: The Challenge Lab; Blockchain</p>\n<p>Th 4PM-7PM; Instructor(s) P.C. Wu; 4 units</p>\n<p><em>Blockchain is among the most exciting recent developments in computer science. While it has served the basis of the Bitcoin currency, it has significantly more potential because its crypto-locked distributed database has the potential to offer trust, security, and smart contracts to a new generation of internet applications.</em></p>\n<p>INDENG 185-002: The Challenge Lab; Disaster and Recovery in Puerto Rico</p>\n<p>Th 4-7PM; Instructor(s) R. Powers; 4 units</p>\n<p><em>In this course, you will learn how to apply the Berkeley Method of Entrepreneurship (BMoE) to build novel solutions and social enterprises that will help deliver the next generation of solutions to aide and recovery of natural disasters. Given the shifting global climate, disaster and recovery is an emerging need and growth area worldwide. The climate crisis is no longer an abstract issue and needs to be addressed in our lifetime.</em></p>\n<p> </p>\n<p>INDENG 185-003: The Challenge Lab; Data &amp; Internet Privacy</p>\n<p>W 5-8PM; Instructor(s) L Edwards; 4 units</p>\n<p><em>Today, online data trails provide large volumes of personal, real-time consumer information to companies doing business on the Internet. Data tracking and mining provide tremendous opportunity for businesses to personalize content and make decisions about which customers to pursue and what to offer them. At the same time, purchase and use histories, GPS locations, browsing behaviors or social media postings allow companies to connect and mine data streams to gain insights and details that consumers may consider private and may incorrectly assume is undiscoverable.</em></p>\n<p>INDENG 185-004: The Challenge Lab; Cybersecurity</p>\n<p>W 3PM-6PM; Instructor(s) R. Rasmussen; 4 units</p>\n<p><em>Information breaches clearly aren’t being solved by cybersecurity technology alone. Since the information you’re protecting, who you’re protecting it from and why are drastically different for corporations, nation states and critical infrastructure providers, an integrated holistic approach to thwarting bad actors is required. This Challenge Lab explores the next generation of Cybersecurity paradigms as they relate to attacker motivation and actions.</em></p>\n<p><br />INDENG 185-005: The Challenge Lab; Alternative Meat</p>\n<p>W 4-7PM; Instructor(s) R. San Martin; 4 units</p>\n<p><em>This course is for students interested in <strong>creating the next generation</strong> of healthy, delicious, affordable and <strong>sustainable plant-based protein</strong> foods. Embark on a unique, team-based challenge to <strong>build novel enterprises</strong> to address the most pressing <strong>environmental and ethical issues</strong> of our times.</em></p>\n<p></p>\n<p><strong>DUE 12N, Tues 2/20/17 - Prytanean Prize - $1250</strong></p>\n<p>The Prytanean Alumnae, Inc. (<a href=\"http://www.prytanean.org/\">www.prytanean.org</a>) is currently accepting applications for the <strong>Prytanean Prize </strong>for female UCB student with junior standing.  The prize is given in recognition of campus and community service, as well as, academic excellence (GPA of 3.2 or better is required).  The recipient will receive a $1,250 cash prize at the Prytanean Alumni Brunch on Sat, April 14, 2017, 9 a.m. - noon at the Bancroft Hotel.  Applicants: Save the date!</p>\n<p> </p>\n<p>The Prytanean Women&#39;s Honor Society was founded at Berkeley in 1900 to recognize Cal women students who demonstrate faith, service and loyalty to the University of California, Berkeley.</p>\n<p> </p>\n<p>The instructions and nomination forms can be accessed <a href=\"https://alumnichapters.berkeley.edu/prytanean/2018awardapplications0\">here</a>.  Prize application packets are due 12n on Tuesday, February 20, 2018 via email to <a href=\"mailto:PRYTPRIZE&#64;GMAIL.COM\">PRYTPRIZE&#64;GMAIL.COM</a></p>\n<p> </p>\n<p>PACKET CHECKLIST (to be attached to with submission):</p>\n<p>Completed nominations should include:</p>\n<p>• nomination form</p>\n<p>• current résumé  </p>\n<p>• unofficial UCB transcript (for GPA verification purposes),</p>\n<p>• leadership and service essay, and </p>\n<p>• at least one letter of recommendation* (three maximum faculty, staff, students, or community members)</p>\n<p>• brief bio &amp; statement </p>\n<p> </p>\n<p>If you have questions, please contact our Prytanean Student Awards Chair, Aviva Shiff Boedecker at <a href=\"mailto:Boedecker.a&#64;gmail.com\">Boedecker.a&#64;gmail.com</a>.</p>\n<p> </p>\n<p><strong><em>APPLICATIONS MUST BE RECEIVED BY 12NOON, TUESDAY, FEBRUARY 20, 2018</em></strong></p>\n<p><strong><em> </em></strong></p>\n<p><strong>SLC Mastering the Social Sciences Workshop Series (First two weeks of the Spring 2018 semester)</strong></p>\n<p>The  Student Learning Center (SLC) Social Science Program is happy to announce the <a href=\"http://slc.berkeley.edu/special-events-and-workshops\">Mastering the Social Sciences Workshop Series at the SLC</a>.  We designed these workshops for incoming first-year students, new transfer students, and continuing students taking social science courses who are seeking to develop useful learning processes. </p>\n<p> </p>\n<p>Students can <a href=\"https://docs.google.com/a/berkeley.edu/forms/d/e/1FAIpQLSdAkOU38CoGMUuwjTQEzZg7Yo0zd00n5d5HE6dntBzJ56_ALQ/viewform\">RSVP</a> for any or all of these free workshops occurring the first two weeks of classes. The workshop topics, days/times, &amp; attached flyer can be found below.</p>\n<p></p>\n<p>Getting Your &#34;Mindset&#34; for a Successful Semester</p>\n<p><strong>Tuesday, January 16 </strong></p>\n<p><strong>12:30-2:00 p.m.(151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (113 Chavez Center)</strong></p>\n<p>Get off to a great start by learning about Carol S. Dweck’s Mindsets.  Her groundbreaking research has been used by students transitioning to the university, professional athletes, and successful people at the top of their fields.  This workshop will introduce you to the mindsets so that you might apply them in developing powerful learning processes for success.  The workshop will connect the mindsets to the other workshops in the workshop series.</p>\n<p> </p>\n<p>Calendaring &amp; Organizing for Success</p>\n<p><strong>Wednesday, January 17</strong></p>\n<p><strong>12:00-1:30 p.m. (151 Chavez Center)</strong></p>\n<p><strong>2:00-3:30 p.m. (151 Chavez Center)</strong></p>\n<p>The first step to mastering social science courses at Cal is to develop a process for getting organized for the semester.  This workshop will support students to: 1) Read, understand, and analyze the course syllabus to understand the expectations and keys to success in the particular social science courses, 2) Utilize the 17-week SLC Calendar to plan and manage time in the long-term and short term, 3) Anticipate and avoid pitfalls that may occur during the long semester.</p>\n<p> </p>\n<p>Predicting Questions and Preparing in Advance for Exams &amp; Papers</p>\n<p><strong>Thursday, January 18 </strong></p>\n<p><strong>12:30-2:00 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (151 Chavez Center)</strong></p>\n<p>The secret to engagement and success is to predict paper prompts and examination questions well in advance.  Can a student actually predict examination questions and paper prompts weeks before a paper or exam format is actually introduced?  The answer is yes!  This workshop will unveil the secrets and allow you to practice this skill beginning on your first day of class. The secret might also be the source that motivates, engages, and leads students to ultimate success. </p>\n<p> </p>\n<p>The Secrets to Reading: Addressing Volume &amp; Density</p>\n<p><strong>Monday, January 22 </strong></p>\n<p><strong>12:00-1:30 p.m. (151 Chavez Center)</strong></p>\n<p><strong>2:00-3:30 p.m. (151 Chavez Center)</strong></p>\n<p>Does the dense and large volumes of reading in social sciences concern you?  This workshop will support students by: 1) Informing students of the different types of reading assigned and how to prioritize, 2) Providing students with basic reading strategies that will allow them to synthesize, connect, and review assigned texts, 3) Developing a reading process that will allow students to understand concepts deeply in order to prepare for papers, quizzes, and midterm exams.</p>\n<p> </p>\n<p>The Art of Note-taking: Triangulating Reading, Lecture/Discussion, &amp; Office Hours</p>\n<p><strong>Tuesday, January 23</strong></p>\n<p><strong>12:30-2:00 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (113 Chavez Center)</strong></p>\n<p>The large, undergraduate lecture can be a difficult educational format to navigate given the fact that lecturers are given in various styles and at various speeds.  Moreover, note-taking is complicated because students can take-notes in lecture, discussion, and for office hours.  This workshop will: 1) identify various lectures styles and course situations, 2) discuss different note-taking processes that might optimize different types of learning styles, and 3) examining tangible strategies for students to develop note-taking to meet course assessment expectations. </p>\n<p> </p>\n<p>Forming Powerful Study Groups</p>\n<p><strong>Wednesday, January 24</strong></p>\n<p><strong>12:00-1:30 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:00-4:30 p.m. (151 Chavez Center)</strong></p>\n<p>Powerful study groups can facilitate efficient studying and deeper understanding of course concepts.  This workshop will: 1)Take inventory of facets that students should consider when establishing study partnerships, 2)Provide practical tools students can use when collaborating, and 3) Suggest tips to ensure focused and welcoming spaces that foster academic integrity. Powerful study groups can cultivate lifelong friendships.  This workshop can foster community building while making the social sciences more social and fun!</p>\n<p> </p>\n<p>The Art of the Office Hour </p>\n<p><strong>Thursday, January 25</strong></p>\n<p><strong>12:30-2:00 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (151 Chavez Center)</strong></p>\n<p>The art of the office hour is knowing the context of the visit, preparing adequately in advance, &amp; ensuring that one leaves a good impression.  This workshop can help you build rapport with your instructors &amp; increase you course engagement.</p>\n<p> </p>\n<p>Navigating Your Discipline</p>\n<p><strong>Friday, January 26</strong></p>\n<p><strong>12:00-1:30 p.m. (113 Chavez Center)</strong></p>\n<p><strong>3:00-4:30 p.m. (113 Chavez Center)</strong></p>\n<p>This workshop can support your development of a process to make more informed decisions about the discipline you choose and your navigation within it at Cal and beyond.</p>\n<p> </p>\n<p><strong>Student Tech Services Now Hiring!</strong></p>\n<p><a href=\"https://studenttech.berkeley.edu/\">Student Tech Services</a> is now hiring! Jobs for the summer and 2018/19 school year are now open at <a href=\"https://studenttech.berkeley.edu/student-jobs\">studenttech.berkeley.edu/student-jobs</a></p>\n<p> </p>\n<ul><li>  A variety of positions with competitive pay! ($15-22.75/hr)</li><li>  Flexible schedules in a student friendly office</li><li>  On the job training, no experience required for many of our positions</li></ul>\n<p> </p>\n<p>Join us for our Student IT Job Fair on Monday, February 5th for a chance to talk with our current staff and get help with your resume! <a href=\"http://bit.ly/IT_Job_Fair\">http://bit.ly/IT_Job_Fair</a><br /><br /></p>\n<p>Apply by 5pm, Friday February 9th!</p>\n<p> </p>\n<p><a href=\"https://www.youtube.com/watch?v=KxiaweXB2Vo\">Student Tech Services Promo Video</a></p>\n<p></p>\n<p><strong>ICRA2018 DJI RoboMaster AI Challenge</strong></p>\n<p>RoboMaster is a robotics competition brand created by DJI, the world-leading drone manufacturer. The aim of this competition to nurture next generation robotics engineer and educate general public about state-of-art robotics technologies. The annual competition requests teams who to build ground robots that use shooting mechanisms to battle with other robots, and the performance of the robots are monitored by a specially designed Referee System, converting projectile hits into Health Point deduction of robots. The competition balances technology and entertainment. Many game elements in the competition are similar to video games.</p>\n<p>RoboMaster now has two competition tracks targeting different groups of students. </p>\n<p>Track 1, the main track, is RoboMaster FPS competition. Its target participants are mainly undergraduate students who can gain basic system design and implementation experience from making shooter robots, which benefits their future careers as engineers. To compete in this track, a team of 3-35 members should be organized. And estimated cost for attending the competition is $50,000 USD. Students are encouraged to explore sponsors and school support by themselves to cover the cost. Since each year millions of people will watch RoboMaster FPS competition live broadcast and the competition organizing committee will help students to promote their teams, potential sponsors can have global brand exposure. The registration process for RoboMaster FPS competition 2018 is finished by this November. To see the RoboMaster2018 promotional video, go to <a href=\"https://youtu.be/uI2uoV58pzQ\">https://youtu.be/uI2uoV58pzQ</a></p>\n<p>Track 2, RoboMaster Technical Challenge. This track is harder to participate because all robots enter the challenge must be fully autonomous. Correspondingly, the game theme is simplified in order to let autonomous robots maneuver within it. The Challenge in 2018 will be hosted alongside with IEEE International Conference on Robotics &amp; Automation (ICRA) 2018 in Brisbane, Australia. It is called AI Challenge because the goal of this Challenge is to design autonomous shooter robots that can team up, make decisions and fight with opponent shooter robots. To accomplish this task, strong AI should be planted in robots. The Technical Challenge aims to stimulate new robotics systems that better combine AI with multiple robots. And participants are expected to publish research papers about their systems used for the Challenge. Team can have 1-10 members. We recommend the majority of the team members are graduate students. For AI Challenge rulebook downloading, please visit <a href=\"https://www.robomaster.com/en-US/resource/pages/728?type=announcementSub\">https://www.robomaster.com/en-US/resource/pages/728?type=announcementSub</a> .</p>\n<p>The ICRA 2018 DJI RoboMaster AI Challenge is currently open for registration to university students. Interested teams can go to <a href=\"https://www.robomaster.com/en-US/user/login\">https://www.robomaster.com/en-US/user/login</a> to submit their applications. Attachments are slides contain detailed information for AI Challenge such as challenge overview, entry instructions and schedule.</p>\n<p>RoboMaster Website: <a href=\"https://www.robomaster.com/en-US\">https://www.robomaster.com/en-US</a></p>\n<p>RoboMaster Q&amp;A Email: <a href=\"mailto:robomaster&#64;dji.com\">robomaster&#64;dji.com</a></p>\n<p>ICRA2018 Website: <a href=\"http://icra2018.org/\">http://icra2018.org/</a>​​</p>\n<p>ICRA2018 DJI RoboMaster AI Challenge: <a href=\"http://icra2018.org/dji-robomaster-ai-challenge/\">http://icra2018.org/dji-robomaster-ai-challenge/</a><a href=\"http://icra2018.org/dji-robomaster-ai-challenge/\"></a></p>\n<p></p>\n<p><strong>Summer 2018 Engineering Internship Opportunity: San Francisco Bay Area Rapid Transit</strong></p>\n<p>We are very excited to be announcing our Summer 2018 internship opportunity. We will begin accepting applications through our <a href=\"https://www.bart.gov/about/jobs\">website</a> on January 22, 2018. Flyer <a href=\"https://www.bart.gov/sites/default/files/docs/BART_summer_%20internship_2018_flyer.pdf\">here</a>.</p>\n<p> </p>\n<p>This summer internship program is scheduled to run for eight (8) weeks beginning on June 18, 2018 and ending on August 10, 2018. All candidates selected must be able to attend the entire program.</p>\n<p> </p>\n<p>Candidates will be selected from one or more of the following majors:</p>\n<p>•             Civil Engineering</p>\n<p>•             Construction Management</p>\n<p>•             Computer Engineering</p>\n<p>•             Computer Science</p>\n<p>•             Electronic Engineering</p>\n<p>•             Mechanical Engineering</p>\n<p>•             Mechatronic Engineering</p>\n<p>•             Structural Engineering</p>\n<p>•             Systems &amp; Control Engineering</p>\n<p> </p>\n<p>Summer Interns that have completed our internship program have stated:</p>\n<ul><li>        <em>“I’ve learned a lot about the actual application and safety that engineers are entitled to abide by. BART’s friendly environment has definitely made me more of an extrovert and improved my communication skills within a working environment and my personal life. I have realized that without clear and concise communication, many small tasks may potentially lead into a bigger problem down the line.”</em></li><li>        <em>“The BART internship gave me exactly the opportunity to apply the knowledge I had to real life application that can affect 450,000 people a day. I am proud that my project can improve overall safety for the BART power system as well as the BART passengers. Aside from that, the teamwork and time management skills I learned from the summer internship can also be beneficial in my future career.”</em></li></ul>\n<p><em> </em></p>\n<p><strong>SIEPR / Econ Predoctoral Research Fellows Program, 2018-19</strong></p>\n<p>The Stanford Institute for Economic Policy Research (SIEPR) and Stanford Economics are pleased to open applications for our <strong>Predoctoral Research Fellowship Program</strong>. Applications are being accepted for positions starting Summer 2018.</p>\n<p> </p>\n<p>Full program and application information is available on our website at: <a href=\"https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship\">https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship</a>. Applications received on or before <strong>March 31, 2018</strong> will be reviewed on a rolling basis.</p>\n<p> </p>\n<p>The SIEPR/Economics Predoctoral Research Fellowship program is a full-time, post baccalaureate program designed to prepare individuals wishing to gain valuable training and experience toward a career in academic research in economics or public policy. Fellows will be expected to fully engage in the intellectual life at Stanford University. They dedicate a significant portion of their time to an empirical research project and can take graduate-level courses at Stanford University for credit (up to one course per quarter). The fellowship offers tuition, health insurance, and a living stipend. We seek individuals to join our program for a period of at least one year. International applicants are welcome to apply.</p>\n<p> </p>\n<p>Ideal candidates will have:</p>\n<ul><li>Completed a 4-year undergraduate degree (bachelors or foreign equivalent) in economics, statistics, applied mathematics, or a related field;</li><li>A strong quantitative background and interest in learning cutting-edge research methods;</li><li>Creative and independent problem-solving skills;</li><li>Experience programming in Stata and R, and may have experience with GIS, Matlab, and other statistical packages; and</li><li>An interest in pursuing a PhD in Economics or a related field.</li></ul>\n<p> </p>\n<p>For position descriptions, application information, and FAQs, please visit our website: <a href=\"https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship\">https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship</a><a href=\"https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship\"></a></p>\n<p></p>\n<p><strong>Advanced Computational Research Experience for Undergraduates (ACRES)</strong></p>\n<p>Michigan State University will host a 10-week NSF Summer Research Experience for Undergraduates (REU) in computational and data science beginning May 21-July 27, 2018. </p>\n<p>Projects provided through iCER ACRES: Advanced Computational Research Experience for Students (ACRES) focus on the development and enhancement of algorithms, models, and software for applications in multiple research areas that require high-performance computing resources.  </p>\n<p> </p>\n<p><strong>Research areas include:</strong> computational chemistry, biology, biomechanics, physics, astrophysics, mathematics, machine learning, materials science, earth science (seismology) and neuroscience.</p>\n<p><strong>Who should apply:</strong> Undergraduate US citizens or permanent residents from a wide variety of fields, including STEM disciplines are invited to apply. Women and other underrepresented minorities are encouraged to apply.</p>\n<p> </p>\n<p><strong>We are now accepting applications! </strong>For more information and to apply visit: <a href=\"http://icer-acres.msu.edu/\">http://icer-acres.msu.edu</a>. </p>\n<p> Applications received by<strong> </strong>February 16, 2018 will be given first preference.</p>\n<p></p>\n<p>#pin</p>", "created": "2018-01-13T00:44:09Z", "subject": "1.12.2018 Undergraduate Announcements", "uid": "hkyddknu435n5"}, {"anon": "no", "content": "<p><strong>Help the EECS Department &amp; Win Amazon Gift Cards!</strong></p>\n<p>Hi everyone!</p>\n<p>Want to have your voice heard by EECS faculty, staff, and the Chairs?</p>\n<p>HKN and other EECS student organizations have composed the 2017-18 EECS Undergraduate Survey so you can provide input and feedback to our very own EECS Department. This is a great opportunity for you to make a real impact in your classes, student life, and campus culture. Your thoughts <em>will </em>reach faculty and will be used to help improve the department and the community!</p>\n<p>In addition, once you complete the survey, you can choose to enter a prize drawing to win one of fifteen (15) $10 Amazon gift cards!</p>\n<p>Your response is completely anonymous. We encourage you to respond openly and honestly!</p>\n<p>The survey is available here:</p>\n<p><a href=\"https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5\">https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5</a></p>\n<p> </p>\n<p><strong>CTSP Data for Good Competition</strong></p>\n<p>The Center for Technology, Society &amp; Policy (CTSP) seeks proposals for a <strong><a href=\"https://ctsp.berkeley.edu/data-for-good-competition/\">Data for Good Competition</a></strong>. The competition will be hosted and promoted by CTSP and made possible through funds provided by Facebook.<br /><br />Team proposals will apply data science skills to address a social good problem with public open data. The objective of the Data for Good Competition is to incentivize students from across the UC Berkeley campus to apply their data science skills towards a compelling public policy or social justice issue.<br /><br />The competition is intended to encourage the creation of data tools or analyses of open data. Issues that may be relevant and addressed via this competition include environmental issues, civic engagement (e.g., voting), government accountability, land use (e.g., housing challenges, agriculture), criminal justice, access to health care, etc. CTSP suggests that teams should consider using local or California state data since there may be additional opportunities for access and collaboration with agencies who produce and maintain these datasets.<br /><br />The competition will consist of three phases:<br />-Initial proposal phase when teams work on developing proposals (<strong>Due January 28, 2018</strong>)<br />-Seed grant execution phase when selected teams execute on their proposals (<strong>Comes with $800 per team</strong>)<br />-Final competition and presentation of completed projects at an event in April 2018 (<strong>$5000 grand prize; $2000 runner-up</strong>)<br /><br />More information may be found on CTSP&#39;s website (<a href=\"https://ctsp.berkeley.edu/data-for-good-competition/\">https://ctsp.berkeley.edu/data-for-good-competition/</a>) and questions may be directed to <a href=\"mailto:CTSP&#64;berkeley.edu\">CTSP&#64;berkeley.edu</a></p>\n<p></p>\n<p><strong>Tokyo Tech CAMPUS Asia SUMMER SCHOOL 2018 [Applications due January 31]</strong></p>\n<p>Under the CAMPUS Asia Initiative of the governments of Japan, China and South Korea, Tokyo Tech is an active participant in and contributor to the TKT CAMPUS Asia Consortium, a joint education and research program with Tsinghua University and KAIST. In our Summer School 2018, as part of the Consortium&#39;s activities, we offer two types of Summer Program: a Course-Oriented Program for undergraduate students, and a Research-Oriented Program for undergraduate and graduate students. In the Summer School, students from countries outside Asia will also participate. </p>\n<p> </p>\n<p>For program details, please visit their website:</p>\n<p><a href=\"http://www.ipo.titech.ac.jp/campusasia/intl_students/\">http://www.ipo.titech.ac.jp/campusasia/intl_students/</a>.</p>\n<p> </p>\n<p><strong>The Fung Fellowship for Wellness and Technology Innovation Program:</strong></p>\n<p>The <a href=\"https://fungfellows.berkeley.edu/\">Fung Fellowship</a> is a unique opportunity for rising juniors to participate in an interdisciplinary fellowship experience at the intersection of public health, design, and digital technology. Students from ALL majors work in teams to create innovative health and wellness solutions to address real-world challenges alongside our community and industry partners. Fung Fellows utilize the iterative human-centered design process, public health principles, and emerging technology, such as VR, AI, machine learning, and blockchain. <br /><br /></p>\n<p>As a Fung Fellow you will:</p>\n<ul><li>  Explore the Health &#43; Tech space</li><li>  Experience the design process from prototype to product</li><li>  Embed in communities to co-create with them</li><li>  Establish yourself as a young leader in an emerging field</li></ul>\n<p> </p>\n<p>Selected Fung Fellows attend a 3-unit course each semester, are supported in a summer internship, and have the opportunity to apply to a second year honors program. <br /><br /></p>\n<p><strong>Required Qualifications:</strong></p>\n<ul><li>  Registered student at UC Berkeley</li><li>  Rising Junior with a passion for health, wellness, social impact, design, and/or technology<br /><br /></li></ul>\n<p><strong>Find out more at our Info Sessions:</strong></p>\n<ul><li>  Tuesday, January 23rd at 4:00pm</li><li>  Friday, January 26th at 12:00pm</li><li>  Sign up and learn more about the <a href=\"https://goo.gl/forms/CoxoMUn3jStcLQsW2\">FF Info Session here</a></li></ul>\n<p> </p>\n<p><strong>How to Apply:</strong></p>\n<ol><li>    Learn more about the program at: <a href=\"https://fungfellows.berkeley.edu/\">https://fungfellows.berkeley.edu/</a></li><li>    Sign up for an<a href=\"https://goo.gl/forms/CoxoMUn3jStcLQsW2\"> info session</a> to find out more about our program</li><li>    Please apply by completing this <a href=\"https://goo.gl/forms/cUTFixKxVoRun1px2\">online application form</a>.</li><li>    Deadline to apply: <strong>February 1st, 2018 5:00pm PST</strong>. We will begin interviewing candidates on a rolling basis.</li></ol>\n<p></p>\n<p><strong>Spring Courses on Entrepreneurship Alternative Meat/ BlockChain/</strong></p>\n<p>The <a href=\"http://scet.berkeley.edu/\">Center for Entrepreneurship &amp; Technology</a> has a few spring 2018 Challenge Lab courses with open seats. Although our courses and center are in the College of Engineering, our classes are open to<em> all</em> majors.  This semester our courses range from alternative meat solutions, to Blockchain, and disaster and recovery.</p>\n<p> </p>\n<p>INDENG 185-001: The Challenge Lab; Blockchain</p>\n<p>Th 4PM-7PM; Instructor(s) P.C. Wu; 4 units</p>\n<p><em>Blockchain is among the most exciting recent developments in computer science. While it has served the basis of the Bitcoin currency, it has significantly more potential because its crypto-locked distributed database has the potential to offer trust, security, and smart contracts to a new generation of internet applications.</em></p>\n<p>INDENG 185-002: The Challenge Lab; Disaster and Recovery in Puerto Rico</p>\n<p>Th 4-7PM; Instructor(s) R. Powers; 4 units</p>\n<p><em>In this course, you will learn how to apply the Berkeley Method of Entrepreneurship (BMoE) to build novel solutions and social enterprises that will help deliver the next generation of solutions to aide and recovery of natural disasters. Given the shifting global climate, disaster and recovery is an emerging need and growth area worldwide. The climate crisis is no longer an abstract issue and needs to be addressed in our lifetime.</em></p>\n<p> </p>\n<p>INDENG 185-003: The Challenge Lab; Data &amp; Internet Privacy</p>\n<p>W 5-8PM; Instructor(s) L Edwards; 4 units</p>\n<p><em>Today, online data trails provide large volumes of personal, real-time consumer information to companies doing business on the Internet. Data tracking and mining provide tremendous opportunity for businesses to personalize content and make decisions about which customers to pursue and what to offer them. At the same time, purchase and use histories, GPS locations, browsing behaviors or social media postings allow companies to connect and mine data streams to gain insights and details that consumers may consider private and may incorrectly assume is undiscoverable.</em></p>\n<p>INDENG 185-004: The Challenge Lab; Cybersecurity</p>\n<p>W 3PM-6PM; Instructor(s) R. Rasmussen; 4 units</p>\n<p><em>Information breaches clearly aren’t being solved by cybersecurity technology alone. Since the information you’re protecting, who you’re protecting it from and why are drastically different for corporations, nation states and critical infrastructure providers, an integrated holistic approach to thwarting bad actors is required. This Challenge Lab explores the next generation of Cybersecurity paradigms as they relate to attacker motivation and actions.</em></p>\n<p><br />INDENG 185-005: The Challenge Lab; Alternative Meat</p>\n<p>W 4-7PM; Instructor(s) R. San Martin; 4 units</p>\n<p><em>This course is for students interested in <strong>creating the next generation</strong> of healthy, delicious, affordable and <strong>sustainable plant-based protein</strong> foods. Embark on a unique, team-based challenge to <strong>build novel enterprises</strong> to address the most pressing <strong>environmental and ethical issues</strong> of our times.</em></p>\n<p></p>\n<p><strong>DUE 12N, Tues 2/20/17 - Prytanean Prize - $1250</strong></p>\n<p>The Prytanean Alumnae, Inc. (<a href=\"http://www.prytanean.org/\">www.prytanean.org</a>) is currently accepting applications for the <strong>Prytanean Prize </strong>for female UCB student with junior standing.  The prize is given in recognition of campus and community service, as well as, academic excellence (GPA of 3.2 or better is required).  The recipient will receive a $1,250 cash prize at the Prytanean Alumni Brunch on Sat, April 14, 2017, 9 a.m. - noon at the Bancroft Hotel.  Applicants: Save the date!</p>\n<p> </p>\n<p>The Prytanean Women&#39;s Honor Society was founded at Berkeley in 1900 to recognize Cal women students who demonstrate faith, service and loyalty to the University of California, Berkeley.</p>\n<p> </p>\n<p>The instructions and nomination forms can be accessed <a href=\"https://alumnichapters.berkeley.edu/prytanean/2018awardapplications0\">here</a>.  Prize application packets are due 12n on Tuesday, February 20, 2018 via email to <a href=\"mailto:PRYTPRIZE&#64;GMAIL.COM\">PRYTPRIZE&#64;GMAIL.COM</a></p>\n<p> </p>\n<p>PACKET CHECKLIST (to be attached to with submission):</p>\n<p>Completed nominations should include:</p>\n<p>• nomination form</p>\n<p>• current résumé  </p>\n<p>• unofficial UCB transcript (for GPA verification purposes),</p>\n<p>• leadership and service essay, and </p>\n<p>• at least one letter of recommendation* (three maximum faculty, staff, students, or community members)</p>\n<p>• brief bio &amp; statement </p>\n<p> </p>\n<p>If you have questions, please contact our Prytanean Student Awards Chair, Aviva Shiff Boedecker at <a href=\"mailto:Boedecker.a&#64;gmail.com\">Boedecker.a&#64;gmail.com</a>.</p>\n<p> </p>\n<p><strong><em>APPLICATIONS MUST BE RECEIVED BY 12NOON, TUESDAY, FEBRUARY 20, 2018</em></strong></p>\n<p><strong><em> </em></strong></p>\n<p><strong>SLC Mastering the Social Sciences Workshop Series (First two weeks of the Spring 2018 semester)</strong></p>\n<p>The  Student Learning Center (SLC) Social Science Program is happy to announce the <a href=\"http://slc.berkeley.edu/special-events-and-workshops\">Mastering the Social Sciences Workshop Series at the SLC</a>.  We designed these workshops for incoming first-year students, new transfer students, and continuing students taking social science courses who are seeking to develop useful learning processes. </p>\n<p> </p>\n<p>Students can <a href=\"https://docs.google.com/a/berkeley.edu/forms/d/e/1FAIpQLSdAkOU38CoGMUuwjTQEzZg7Yo0zd00n5d5HE6dntBzJ56_ALQ/viewform\">RSVP</a> for any or all of these free workshops occurring the first two weeks of classes. The workshop topics, days/times, &amp; attached flyer can be found below.</p>\n<p></p>\n<p>Getting Your &#34;Mindset&#34; for a Successful Semester</p>\n<p><strong>Tuesday, January 16 </strong></p>\n<p><strong>12:30-2:00 p.m.(151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (113 Chavez Center)</strong></p>\n<p>Get off to a great start by learning about Carol S. Dweck’s Mindsets.  Her groundbreaking research has been used by students transitioning to the university, professional athletes, and successful people at the top of their fields.  This workshop will introduce you to the mindsets so that you might apply them in developing powerful learning processes for success.  The workshop will connect the mindsets to the other workshops in the workshop series.</p>\n<p> </p>\n<p>Calendaring &amp; Organizing for Success</p>\n<p><strong>Wednesday, January 17</strong></p>\n<p><strong>12:00-1:30 p.m. (151 Chavez Center)</strong></p>\n<p><strong>2:00-3:30 p.m. (151 Chavez Center)</strong></p>\n<p>The first step to mastering social science courses at Cal is to develop a process for getting organized for the semester.  This workshop will support students to: 1) Read, understand, and analyze the course syllabus to understand the expectations and keys to success in the particular social science courses, 2) Utilize the 17-week SLC Calendar to plan and manage time in the long-term and short term, 3) Anticipate and avoid pitfalls that may occur during the long semester.</p>\n<p> </p>\n<p>Predicting Questions and Preparing in Advance for Exams &amp; Papers</p>\n<p><strong>Thursday, January 18 </strong></p>\n<p><strong>12:30-2:00 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (151 Chavez Center)</strong></p>\n<p>The secret to engagement and success is to predict paper prompts and examination questions well in advance.  Can a student actually predict examination questions and paper prompts weeks before a paper or exam format is actually introduced?  The answer is yes!  This workshop will unveil the secrets and allow you to practice this skill beginning on your first day of class. The secret might also be the source that motivates, engages, and leads students to ultimate success. </p>\n<p> </p>\n<p>The Secrets to Reading: Addressing Volume &amp; Density</p>\n<p><strong>Monday, January 22 </strong></p>\n<p><strong>12:00-1:30 p.m. (151 Chavez Center)</strong></p>\n<p><strong>2:00-3:30 p.m. (151 Chavez Center)</strong></p>\n<p>Does the dense and large volumes of reading in social sciences concern you?  This workshop will support students by: 1) Informing students of the different types of reading assigned and how to prioritize, 2) Providing students with basic reading strategies that will allow them to synthesize, connect, and review assigned texts, 3) Developing a reading process that will allow students to understand concepts deeply in order to prepare for papers, quizzes, and midterm exams.</p>\n<p> </p>\n<p>The Art of Note-taking: Triangulating Reading, Lecture/Discussion, &amp; Office Hours</p>\n<p><strong>Tuesday, January 23</strong></p>\n<p><strong>12:30-2:00 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (113 Chavez Center)</strong></p>\n<p>The large, undergraduate lecture can be a difficult educational format to navigate given the fact that lecturers are given in various styles and at various speeds.  Moreover, note-taking is complicated because students can take-notes in lecture, discussion, and for office hours.  This workshop will: 1) identify various lectures styles and course situations, 2) discuss different note-taking processes that might optimize different types of learning styles, and 3) examining tangible strategies for students to develop note-taking to meet course assessment expectations. </p>\n<p> </p>\n<p>Forming Powerful Study Groups</p>\n<p><strong>Wednesday, January 24</strong></p>\n<p><strong>12:00-1:30 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:00-4:30 p.m. (151 Chavez Center)</strong></p>\n<p>Powerful study groups can facilitate efficient studying and deeper understanding of course concepts.  This workshop will: 1)Take inventory of facets that students should consider when establishing study partnerships, 2)Provide practical tools students can use when collaborating, and 3) Suggest tips to ensure focused and welcoming spaces that foster academic integrity. Powerful study groups can cultivate lifelong friendships.  This workshop can foster community building while making the social sciences more social and fun!</p>\n<p> </p>\n<p>The Art of the Office Hour </p>\n<p><strong>Thursday, January 25</strong></p>\n<p><strong>12:30-2:00 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (151 Chavez Center)</strong></p>\n<p>The art of the office hour is knowing the context of the visit, preparing adequately in advance, &amp; ensuring that one leaves a good impression.  This workshop can help you build rapport with your instructors &amp; increase you course engagement.</p>\n<p> </p>\n<p>Navigating Your Discipline</p>\n<p><strong>Friday, January 26</strong></p>\n<p><strong>12:00-1:30 p.m. (113 Chavez Center)</strong></p>\n<p><strong>3:00-4:30 p.m. (113 Chavez Center)</strong></p>\n<p>This workshop can support your development of a process to make more informed decisions about the discipline you choose and your navigation within it at Cal and beyond.</p>\n<p> </p>\n<p><strong>Student Tech Services Now Hiring!</strong></p>\n<p><a href=\"https://studenttech.berkeley.edu/\">Student Tech Services</a> is now hiring! Jobs for the summer and 2018/19 school year are now open at <a href=\"https://studenttech.berkeley.edu/student-jobs\">studenttech.berkeley.edu/student-jobs</a></p>\n<p> </p>\n<ul><li>  A variety of positions with competitive pay! ($15-22.75/hr)</li><li>  Flexible schedules in a student friendly office</li><li>  On the job training, no experience required for many of our positions</li></ul>\n<p> </p>\n<p>Join us for our Student IT Job Fair on Monday, February 5th for a chance to talk with our current staff and get help with your resume! <a href=\"http://bit.ly/IT_Job_Fair\">http://bit.ly/IT_Job_Fair</a><br /><br /></p>\n<p>Apply by 5pm, Friday February 9th!</p>\n<p> </p>\n<p><a href=\"https://www.youtube.com/watch?v=KxiaweXB2Vo\">Student Tech Services Promo Video</a></p>\n<p></p>\n<p><strong>ICRA2018 DJI RoboMaster AI Challenge</strong></p>\n<p>RoboMaster is a robotics competition brand created by DJI, the world-leading drone manufacturer. The aim of this competition to nurture next generation robotics engineer and educate general public about state-of-art robotics technologies. The annual competition requests teams who to build ground robots that use shooting mechanisms to battle with other robots, and the performance of the robots are monitored by a specially designed Referee System, converting projectile hits into Health Point deduction of robots. The competition balances technology and entertainment. Many game elements in the competition are similar to video games.</p>\n<p>RoboMaster now has two competition tracks targeting different groups of students. </p>\n<p>Track 1, the main track, is RoboMaster FPS competition. Its target participants are mainly undergraduate students who can gain basic system design and implementation experience from making shooter robots, which benefits their future careers as engineers. To compete in this track, a team of 3-35 members should be organized. And estimated cost for attending the competition is $50,000 USD. Students are encouraged to explore sponsors and school support by themselves to cover the cost. Since each year millions of people will watch RoboMaster FPS competition live broadcast and the competition organizing committee will help students to promote their teams, potential sponsors can have global brand exposure. The registration process for RoboMaster FPS competition 2018 is finished by this November. To see the RoboMaster2018 promotional video, go to <a href=\"https://youtu.be/uI2uoV58pzQ\">https://youtu.be/uI2uoV58pzQ</a></p>\n<p>Track 2, RoboMaster Technical Challenge. This track is harder to participate because all robots enter the challenge must be fully autonomous. Correspondingly, the game theme is simplified in order to let autonomous robots maneuver within it. The Challenge in 2018 will be hosted alongside with IEEE International Conference on Robotics &amp; Automation (ICRA) 2018 in Brisbane, Australia. It is called AI Challenge because the goal of this Challenge is to design autonomous shooter robots that can team up, make decisions and fight with opponent shooter robots. To accomplish this task, strong AI should be planted in robots. The Technical Challenge aims to stimulate new robotics systems that better combine AI with multiple robots. And participants are expected to publish research papers about their systems used for the Challenge. Team can have 1-10 members. We recommend the majority of the team members are graduate students. For AI Challenge rulebook downloading, please visit <a href=\"https://www.robomaster.com/en-US/resource/pages/728?type=announcementSub\">https://www.robomaster.com/en-US/resource/pages/728?type=announcementSub</a> .</p>\n<p>The ICRA 2018 DJI RoboMaster AI Challenge is currently open for registration to university students. Interested teams can go to <a href=\"https://www.robomaster.com/en-US/user/login\">https://www.robomaster.com/en-US/user/login</a> to submit their applications. Attachments are slides contain detailed information for AI Challenge such as challenge overview, entry instructions and schedule.</p>\n<p>RoboMaster Website: <a href=\"https://www.robomaster.com/en-US\">https://www.robomaster.com/en-US</a></p>\n<p>RoboMaster Q&amp;A Email: <a href=\"mailto:robomaster&#64;dji.com\">robomaster&#64;dji.com</a></p>\n<p>ICRA2018 Website: <a href=\"http://icra2018.org/\">http://icra2018.org/</a>​​</p>\n<p>ICRA2018 DJI RoboMaster AI Challenge: <a href=\"http://icra2018.org/dji-robomaster-ai-challenge/\">http://icra2018.org/dji-robomaster-ai-challenge/</a><a href=\"http://icra2018.org/dji-robomaster-ai-challenge/\"></a></p>\n<p></p>\n<p><strong>Summer 2018 Engineering Internship Opportunity: San Francisco Bay Area Rapid Transit</strong></p>\n<p>We are very excited to be announcing our Summer 2018 internship opportunity. We will begin accepting applications through our <a href=\"https://www.bart.gov/about/jobs\">website</a> on January 22, 2018. Flyer <a href=\"https://www.bart.gov/sites/default/files/docs/BART_summer_%20internship_2018_flyer.pdf\">here</a>.</p>\n<p> </p>\n<p>This summer internship program is scheduled to run for eight (8) weeks beginning on June 18, 2018 and ending on August 10, 2018. All candidates selected must be able to attend the entire program.</p>\n<p> </p>\n<p>Candidates will be selected from one or more of the following majors:</p>\n<p>•             Civil Engineering</p>\n<p>•             Construction Management</p>\n<p>•             Computer Engineering</p>\n<p>•             Computer Science</p>\n<p>•             Electronic Engineering</p>\n<p>•             Mechanical Engineering</p>\n<p>•             Mechatronic Engineering</p>\n<p>•             Structural Engineering</p>\n<p>•             Systems &amp; Control Engineering</p>\n<p> </p>\n<p>Summer Interns that have completed our internship program have stated:</p>\n<ul><li>        <em>“I’ve learned a lot about the actual application and safety that engineers are entitled to abide by. BART’s friendly environment has definitely made me more of an extrovert and improved my communication skills within a working environment and my personal life. I have realized that without clear and concise communication, many small tasks may potentially lead into a bigger problem down the line.”</em></li><li>        <em>“The BART internship gave me exactly the opportunity to apply the knowledge I had to real life application that can affect 450,000 people a day. I am proud that my project can improve overall safety for the BART power system as well as the BART passengers. Aside from that, the teamwork and time management skills I learned from the summer internship can also be beneficial in my future career.”</em></li></ul>\n<p><em> </em></p>\n<p><strong>SIEPR / Econ Predoctoral Research Fellows Program, 2018-19</strong></p>\n<p>The Stanford Institute for Economic Policy Research (SIEPR) and Stanford Economics are pleased to open applications for our <strong>Predoctoral Research Fellowship Program</strong>. Applications are being accepted for positions starting Summer 2018.</p>\n<p> </p>\n<p>Full program and application information is available on our website at: <a href=\"https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship\">https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship</a>. Applications received on or before <strong>March 31, 2018</strong> will be reviewed on a rolling basis.</p>\n<p> </p>\n<p>The SIEPR/Economics Predoctoral Research Fellowship program is a full-time, post baccalaureate program designed to prepare individuals wishing to gain valuable training and experience toward a career in academic research in economics or public policy. Fellows will be expected to fully engage in the intellectual life at Stanford University. They dedicate a significant portion of their time to an empirical research project and can take graduate-level courses at Stanford University for credit (up to one course per quarter). The fellowship offers tuition, health insurance, and a living stipend. We seek individuals to join our program for a period of at least one year. International applicants are welcome to apply.</p>\n<p> </p>\n<p>Ideal candidates will have:</p>\n<ul><li>Completed a 4-year undergraduate degree (bachelors or foreign equivalent) in economics, statistics, applied mathematics, or a related field;</li><li>A strong quantitative background and interest in learning cutting-edge research methods;</li><li>Creative and independent problem-solving skills;</li><li>Experience programming in Stata and R, and may have experience with GIS, Matlab, and other statistical packages; and</li><li>An interest in pursuing a PhD in Economics or a related field.</li></ul>\n<p> </p>\n<p>For position descriptions, application information, and FAQs, please visit our website: <a href=\"https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship\">https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship</a><a href=\"https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship\"></a></p>\n<p></p>\n<p>#pin</p>", "created": "2018-01-12T23:39:39Z", "subject": "1.12.2018 Undergraduate Announcements", "uid": "hkyddknu435n5"}, {"anon": "no", "content": "<p><strong>Help the EECS Department &amp; Win Amazon Gift Cards!</strong></p>\n<p>Hi everyone!</p>\n<p>Want to have your voice heard by EECS faculty, staff, and the Chairs?</p>\n<p>HKN and other EECS student organizations have composed the 2017-18 EECS Undergraduate Survey so you can provide input and feedback to our very own EECS Department. This is a great opportunity for you to make a real impact in your classes, student life, and campus culture. Your thoughts <em>will </em>reach faculty and will be used to help improve the department and the community!</p>\n<p>In addition, once you complete the survey, you can choose to enter a prize drawing to win one of fifteen (15) $10 Amazon gift cards!</p>\n<p>Your response is completely anonymous. We encourage you to respond openly and honestly!</p>\n<p>The survey is available here:</p>\n<p><a href=\"https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5\">https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5</a></p>\n<p> </p>\n<p><strong>CTSP Data for Good Competition</strong></p>\n<p>The Center for Technology, Society &amp; Policy (CTSP) seeks proposals for a <strong><a href=\"https://ctsp.berkeley.edu/data-for-good-competition/\">Data for Good Competition</a></strong>. The competition will be hosted and promoted by CTSP and made possible through funds provided by Facebook.<br /><br />Team proposals will apply data science skills to address a social good problem with public open data. The objective of the Data for Good Competition is to incentivize students from across the UC Berkeley campus to apply their data science skills towards a compelling public policy or social justice issue.<br /><br />The competition is intended to encourage the creation of data tools or analyses of open data. Issues that may be relevant and addressed via this competition include environmental issues, civic engagement (e.g., voting), government accountability, land use (e.g., housing challenges, agriculture), criminal justice, access to health care, etc. CTSP suggests that teams should consider using local or California state data since there may be additional opportunities for access and collaboration with agencies who produce and maintain these datasets.<br /><br />The competition will consist of three phases:<br />-Initial proposal phase when teams work on developing proposals (<strong>Due January 28, 2018</strong>)<br />-Seed grant execution phase when selected teams execute on their proposals (<strong>Comes with $800 per team</strong>)<br />-Final competition and presentation of completed projects at an event in April 2018 (<strong>$5000 grand prize; $2000 runner-up</strong>)<br /><br />More information may be found on CTSP&#39;s website (<a href=\"https://ctsp.berkeley.edu/data-for-good-competition/\">https://ctsp.berkeley.edu/data-for-good-competition/</a>) and questions may be directed to <a href=\"mailto:CTSP&#64;berkeley.edu\">CTSP&#64;berkeley.edu</a></p>\n<p></p>\n<p><strong>Tokyo Tech CAMPUS Asia SUMMER SCHOOL 2018 [Applications due January 31]</strong></p>\n<p>Under the CAMPUS Asia Initiative of the governments of Japan, China and South Korea, Tokyo Tech is an active participant in and contributor to the TKT CAMPUS Asia Consortium, a joint education and research program with Tsinghua University and KAIST. In our Summer School 2018, as part of the Consortium&#39;s activities, we offer two types of Summer Program: a Course-Oriented Program for undergraduate students, and a Research-Oriented Program for undergraduate and graduate students. In the Summer School, students from countries outside Asia will also participate. </p>\n<p> </p>\n<p>For program details, please visit their website:</p>\n<p><a href=\"http://www.ipo.titech.ac.jp/campusasia/intl_students/\">http://www.ipo.titech.ac.jp/campusasia/intl_students/</a>.</p>\n<p> </p>\n<p><strong>The Fung Fellowship for Wellness and Technology Innovation Program:</strong></p>\n<p>The <a href=\"https://fungfellows.berkeley.edu/\">Fung Fellowship</a> is a unique opportunity for rising juniors to participate in an interdisciplinary fellowship experience at the intersection of public health, design, and digital technology. Students from ALL majors work in teams to create innovative health and wellness solutions to address real-world challenges alongside our community and industry partners. Fung Fellows utilize the iterative human-centered design process, public health principles, and emerging technology, such as VR, AI, machine learning, and blockchain. <br /><br /></p>\n<p>As a Fung Fellow you will:</p>\n<ul><li>  Explore the Health &#43; Tech space</li><li>  Experience the design process from prototype to product</li><li>  Embed in communities to co-create with them</li><li>  Establish yourself as a young leader in an emerging field</li></ul>\n<p> </p>\n<p>Selected Fung Fellows attend a 3-unit course each semester, are supported in a summer internship, and have the opportunity to apply to a second year honors program. <br /><br /></p>\n<p><strong>Required Qualifications:</strong></p>\n<ul><li>  Registered student at UC Berkeley</li><li>  Rising Junior with a passion for health, wellness, social impact, design, and/or technology<br /><br /></li></ul>\n<p><strong>Find out more at our Info Sessions:</strong></p>\n<ul><li>  Tuesday, January 23rd at 4:00pm</li><li>  Friday, January 26th at 12:00pm</li><li>  Sign up and learn more about the <a href=\"https://goo.gl/forms/CoxoMUn3jStcLQsW2\">FF Info Session here</a></li></ul>\n<p> </p>\n<p><strong>How to Apply:</strong></p>\n<ol><li>    Learn more about the program at: <a href=\"https://fungfellows.berkeley.edu/\">https://fungfellows.berkeley.edu/</a></li><li>    Sign up for an<a href=\"https://goo.gl/forms/CoxoMUn3jStcLQsW2\"> info session</a> to find out more about our program</li><li>    Please apply by completing this <a href=\"https://goo.gl/forms/cUTFixKxVoRun1px2\">online application form</a>.</li><li>    Deadline to apply: <strong>February 1st, 2018 5:00pm PST</strong>. We will begin interviewing candidates on a rolling basis.</li></ol>\n<p></p>\n<p><strong>Spring Courses on Entrepreneurship Alternative Meat/ BlockChain/</strong></p>\n<p>The <a href=\"http://scet.berkeley.edu/\">Center for Entrepreneurship &amp; Technology</a> has a few spring 2018 Challenge Lab courses with open seats. Although our courses and center are in the College of Engineering, our classes are open to<em> all</em> majors.  This semester our courses range from alternative meat solutions, to Blockchain, and disaster and recovery.</p>\n<p> </p>\n<p>INDENG 185-001: The Challenge Lab; Blockchain</p>\n<p>Th 4PM-7PM; Instructor(s) P.C. Wu; 4 units</p>\n<p><em>Blockchain is among the most exciting recent developments in computer science. While it has served the basis of the Bitcoin currency, it has significantly more potential because its crypto-locked distributed database has the potential to offer trust, security, and smart contracts to a new generation of internet applications.</em></p>\n<p>INDENG 185-002: The Challenge Lab; Disaster and Recovery in Puerto Rico</p>\n<p>Th 4-7PM; Instructor(s) R. Powers; 4 units</p>\n<p><em>In this course, you will learn how to apply the Berkeley Method of Entrepreneurship (BMoE) to build novel solutions and social enterprises that will help deliver the next generation of solutions to aide and recovery of natural disasters. Given the shifting global climate, disaster and recovery is an emerging need and growth area worldwide. The climate crisis is no longer an abstract issue and needs to be addressed in our lifetime.</em></p>\n<p> </p>\n<p>INDENG 185-003: The Challenge Lab; Data &amp; Internet Privacy</p>\n<p>W 5-8PM; Instructor(s) L Edwards; 4 units</p>\n<p><em>Today, online data trails provide large volumes of personal, real-time consumer information to companies doing business on the Internet. Data tracking and mining provide tremendous opportunity for businesses to personalize content and make decisions about which customers to pursue and what to offer them. At the same time, purchase and use histories, GPS locations, browsing behaviors or social media postings allow companies to connect and mine data streams to gain insights and details that consumers may consider private and may incorrectly assume is undiscoverable.</em></p>\n<p>INDENG 185-004: The Challenge Lab; Cybersecurity</p>\n<p>W 3PM-6PM; Instructor(s) R. Rasmussen; 4 units</p>\n<p><em>Information breaches clearly aren’t being solved by cybersecurity technology alone. Since the information you’re protecting, who you’re protecting it from and why are drastically different for corporations, nation states and critical infrastructure providers, an integrated holistic approach to thwarting bad actors is required. This Challenge Lab explores the next generation of Cybersecurity paradigms as they relate to attacker motivation and actions.</em></p>\n<p><br />INDENG 185-005: The Challenge Lab; Alternative Meat</p>\n<p>W 4-7PM; Instructor(s) R. San Martin; 4 units</p>\n<p><em>This course is for students interested in <strong>creating the next generation</strong> of healthy, delicious, affordable and <strong>sustainable plant-based protein</strong> foods. Embark on a unique, team-based challenge to <strong>build novel enterprises</strong> to address the most pressing <strong>environmental and ethical issues</strong> of our times.</em></p>\n<p></p>\n<p><strong>DUE 12N, Tues 2/20/17 - Prytanean Prize - $1250</strong></p>\n<p>The Prytanean Alumnae, Inc. (<a href=\"http://www.prytanean.org/\">www.prytanean.org</a>) is currently accepting applications for the <strong>Prytanean Prize </strong>for female UCB student with junior standing.  The prize is given in recognition of campus and community service, as well as, academic excellence (GPA of 3.2 or better is required).  The recipient will receive a $1,250 cash prize at the Prytanean Alumni Brunch on Sat, April 14, 2017, 9 a.m. - noon at the Bancroft Hotel.  Applicants: Save the date!</p>\n<p> </p>\n<p>The Prytanean Women&#39;s Honor Society was founded at Berkeley in 1900 to recognize Cal women students who demonstrate faith, service and loyalty to the University of California, Berkeley.</p>\n<p> </p>\n<p>The instructions and nomination forms can be accessed <a href=\"https://alumnichapters.berkeley.edu/prytanean/2018awardapplications0\">here</a>.  Prize application packets are due 12n on Tuesday, February 20, 2018 via email to <a href=\"mailto:PRYTPRIZE&#64;GMAIL.COM\">PRYTPRIZE&#64;GMAIL.COM</a></p>\n<p> </p>\n<p>PACKET CHECKLIST (to be attached to with submission):</p>\n<p>Completed nominations should include:</p>\n<p>• nomination form</p>\n<p>• current résumé  </p>\n<p>• unofficial UCB transcript (for GPA verification purposes),</p>\n<p>• leadership and service essay, and </p>\n<p>• at least one letter of recommendation* (three maximum faculty, staff, students, or community members)</p>\n<p>• brief bio &amp; statement </p>\n<p> </p>\n<p>If you have questions, please contact our Prytanean Student Awards Chair, Aviva Shiff Boedecker at <a href=\"mailto:Boedecker.a&#64;gmail.com\">Boedecker.a&#64;gmail.com</a>.</p>\n<p> </p>\n<p><strong><em>APPLICATIONS MUST BE RECEIVED BY 12NOON, TUESDAY, FEBRUARY 20, 2018</em></strong></p>\n<p><strong><em> </em></strong></p>\n<p><strong>SLC Mastering the Social Sciences Workshop Series (First two weeks of the Spring 2018 semester)</strong></p>\n<p>The  Student Learning Center (SLC) Social Science Program is happy to announce the <a href=\"http://slc.berkeley.edu/special-events-and-workshops\">Mastering the Social Sciences Workshop Series at the SLC</a>.  We designed these workshops for incoming first-year students, new transfer students, and continuing students taking social science courses who are seeking to develop useful learning processes. </p>\n<p> </p>\n<p>Students can <a href=\"https://docs.google.com/a/berkeley.edu/forms/d/e/1FAIpQLSdAkOU38CoGMUuwjTQEzZg7Yo0zd00n5d5HE6dntBzJ56_ALQ/viewform\">RSVP</a> for any or all of these free workshops occurring the first two weeks of classes. The workshop topics, days/times, &amp; attached flyer can be found below.</p>\n<p></p>\n<p>Getting Your &#34;Mindset&#34; for a Successful Semester</p>\n<p><strong>Tuesday, January 16 </strong></p>\n<p><strong>12:30-2:00 p.m.(151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (113 Chavez Center)</strong></p>\n<p>Get off to a great start by learning about Carol S. Dweck’s Mindsets.  Her groundbreaking research has been used by students transitioning to the university, professional athletes, and successful people at the top of their fields.  This workshop will introduce you to the mindsets so that you might apply them in developing powerful learning processes for success.  The workshop will connect the mindsets to the other workshops in the workshop series.</p>\n<p> </p>\n<p>Calendaring &amp; Organizing for Success</p>\n<p><strong>Wednesday, January 17</strong></p>\n<p><strong>12:00-1:30 p.m. (151 Chavez Center)</strong></p>\n<p><strong>2:00-3:30 p.m. (151 Chavez Center)</strong></p>\n<p>The first step to mastering social science courses at Cal is to develop a process for getting organized for the semester.  This workshop will support students to: 1) Read, understand, and analyze the course syllabus to understand the expectations and keys to success in the particular social science courses, 2) Utilize the 17-week SLC Calendar to plan and manage time in the long-term and short term, 3) Anticipate and avoid pitfalls that may occur during the long semester.</p>\n<p> </p>\n<p>Predicting Questions and Preparing in Advance for Exams &amp; Papers</p>\n<p><strong>Thursday, January 18 </strong></p>\n<p><strong>12:30-2:00 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (151 Chavez Center)</strong></p>\n<p>The secret to engagement and success is to predict paper prompts and examination questions well in advance.  Can a student actually predict examination questions and paper prompts weeks before a paper or exam format is actually introduced?  The answer is yes!  This workshop will unveil the secrets and allow you to practice this skill beginning on your first day of class. The secret might also be the source that motivates, engages, and leads students to ultimate success. </p>\n<p> </p>\n<p>The Secrets to Reading: Addressing Volume &amp; Density</p>\n<p><strong>Monday, January 22 </strong></p>\n<p><strong>12:00-1:30 p.m. (151 Chavez Center)</strong></p>\n<p><strong>2:00-3:30 p.m. (151 Chavez Center)</strong></p>\n<p>Does the dense and large volumes of reading in social sciences concern you?  This workshop will support students by: 1) Informing students of the different types of reading assigned and how to prioritize, 2) Providing students with basic reading strategies that will allow them to synthesize, connect, and review assigned texts, 3) Developing a reading process that will allow students to understand concepts deeply in order to prepare for papers, quizzes, and midterm exams.</p>\n<p> </p>\n<p>The Art of Note-taking: Triangulating Reading, Lecture/Discussion, &amp; Office Hours</p>\n<p><strong>Tuesday, January 23</strong></p>\n<p><strong>12:30-2:00 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (113 Chavez Center)</strong></p>\n<p>The large, undergraduate lecture can be a difficult educational format to navigate given the fact that lecturers are given in various styles and at various speeds.  Moreover, note-taking is complicated because students can take-notes in lecture, discussion, and for office hours.  This workshop will: 1) identify various lectures styles and course situations, 2) discuss different note-taking processes that might optimize different types of learning styles, and 3) examining tangible strategies for students to develop note-taking to meet course assessment expectations. </p>\n<p> </p>\n<p>Forming Powerful Study Groups</p>\n<p><strong>Wednesday, January 24</strong></p>\n<p><strong>12:00-1:30 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:00-4:30 p.m. (151 Chavez Center)</strong></p>\n<p>Powerful study groups can facilitate efficient studying and deeper understanding of course concepts.  This workshop will: 1)Take inventory of facets that students should consider when establishing study partnerships, 2)Provide practical tools students can use when collaborating, and 3) Suggest tips to ensure focused and welcoming spaces that foster academic integrity. Powerful study groups can cultivate lifelong friendships.  This workshop can foster community building while making the social sciences more social and fun!</p>\n<p> </p>\n<p>The Art of the Office Hour </p>\n<p><strong>Thursday, January 25</strong></p>\n<p><strong>12:30-2:00 p.m. (151 Chavez Center)</strong></p>\n<p><strong>3:30-5:00 p.m. (151 Chavez Center)</strong></p>\n<p>The art of the office hour is knowing the context of the visit, preparing adequately in advance, &amp; ensuring that one leaves a good impression.  This workshop can help you build rapport with your instructors &amp; increase you course engagement.</p>\n<p> </p>\n<p>Navigating Your Discipline</p>\n<p><strong>Friday, January 26</strong></p>\n<p><strong>12:00-1:30 p.m. (113 Chavez Center)</strong></p>\n<p><strong>3:00-4:30 p.m. (113 Chavez Center)</strong></p>\n<p>This workshop can support your development of a process to make more informed decisions about the discipline you choose and your navigation within it at Cal and beyond.</p>\n<p> </p>\n<p><strong>Student Tech Services Now Hiring!</strong></p>\n<p><a href=\"https://studenttech.berkeley.edu/\">Student Tech Services</a> is now hiring! Jobs for the summer and 2018/19 school year are now open at <a href=\"https://studenttech.berkeley.edu/student-jobs\">studenttech.berkeley.edu/student-jobs</a></p>\n<p> </p>\n<ul><li>  A variety of positions with competitive pay! ($15-22.75/hr)</li><li>  Flexible schedules in a student friendly office</li><li>  On the job training, no experience required for many of our positions</li></ul>\n<p> </p>\n<p>Join us for our Student IT Job Fair on Monday, February 5th for a chance to talk with our current staff and get help with your resume! <a href=\"http://bit.ly/IT_Job_Fair\">http://bit.ly/IT_Job_Fair</a><br /><br /></p>\n<p>Apply by 5pm, Friday February 9th!</p>\n<p> </p>\n<p><a href=\"https://www.youtube.com/watch?v=KxiaweXB2Vo\">Student Tech Services Promo Video</a></p>\n<p></p>\n<p><strong>ICRA2018 DJI RoboMaster AI Challenge</strong></p>\n<p>RoboMaster is a robotics competition brand created by DJI, the world-leading drone manufacturer. The aim of this competition to nurture next generation robotics engineer and educate general public about state-of-art robotics technologies. The annual competition requests teams who to build ground robots that use shooting mechanisms to battle with other robots, and the performance of the robots are monitored by a specially designed Referee System, converting projectile hits into Health Point deduction of robots. The competition balances technology and entertainment. Many game elements in the competition are similar to video games.</p>\n<p>RoboMaster now has two competition tracks targeting different groups of students. </p>\n<p>Track 1, the main track, is RoboMaster FPS competition. Its target participants are mainly undergraduate students who can gain basic system design and implementation experience from making shooter robots, which benefits their future careers as engineers. To compete in this track, a team of 3-35 members should be organized. And estimated cost for attending the competition is $50,000 USD. Students are encouraged to explore sponsors and school support by themselves to cover the cost. Since each year millions of people will watch RoboMaster FPS competition live broadcast and the competition organizing committee will help students to promote their teams, potential sponsors can have global brand exposure. The registration process for RoboMaster FPS competition 2018 is finished by this November. To see the RoboMaster2018 promotional video, go to <a href=\"https://youtu.be/uI2uoV58pzQ\">https://youtu.be/uI2uoV58pzQ</a></p>\n<p>Track 2, RoboMaster Technical Challenge. This track is harder to participate because all robots enter the challenge must be fully autonomous. Correspondingly, the game theme is simplified in order to let autonomous robots maneuver within it. The Challenge in 2018 will be hosted alongside with IEEE International Conference on Robotics &amp; Automation (ICRA) 2018 in Brisbane, Australia. It is called AI Challenge because the goal of this Challenge is to design autonomous shooter robots that can team up, make decisions and fight with opponent shooter robots. To accomplish this task, strong AI should be planted in robots. The Technical Challenge aims to stimulate new robotics systems that better combine AI with multiple robots. And participants are expected to publish research papers about their systems used for the Challenge. Team can have 1-10 members. We recommend the majority of the team members are graduate students. For AI Challenge rulebook downloading, please visit <a href=\"https://www.robomaster.com/en-US/resource/pages/728?type=announcementSub\">https://www.robomaster.com/en-US/resource/pages/728?type=announcementSub</a> .</p>\n<p>The ICRA 2018 DJI RoboMaster AI Challenge is currently open for registration to university students. Interested teams can go to <a href=\"https://www.robomaster.com/en-US/user/login\">https://www.robomaster.com/en-US/user/login</a> to submit their applications. Attachments are slides contain detailed information for AI Challenge such as challenge overview, entry instructions and schedule.</p>\n<p>RoboMaster Website: <a href=\"https://www.robomaster.com/en-US\">https://www.robomaster.com/en-US</a></p>\n<p>RoboMaster Q&amp;A Email: <a href=\"mailto:robomaster&#64;dji.com\">robomaster&#64;dji.com</a></p>\n<p>ICRA2018 Website: <a href=\"http://icra2018.org/\">http://icra2018.org/</a>​​</p>\n<p>ICRA2018 DJI RoboMaster AI Challenge: <a href=\"http://icra2018.org/dji-robomaster-ai-challenge/\">http://icra2018.org/dji-robomaster-ai-challenge/</a><a href=\"http://icra2018.org/dji-robomaster-ai-challenge/\"></a></p>\n<p></p>\n<p><strong>Summer 2018 Engineering Internship Opportunity: San Francisco Bay Area Rapid Transit</strong></p>\n<p>We are very excited to be announcing our Summer 2018 internship opportunity. We will begin accepting applications through our <a href=\"https://www.bart.gov/about/jobs\">website</a> on January 22, 2018. Flyer <a href=\"https://www.bart.gov/sites/default/files/docs/BART_summer_%20internship_2018_flyer.pdf\">here</a>.</p>\n<p> </p>\n<p>This summer internship program is scheduled to run for eight (8) weeks beginning on June 18, 2018 and ending on August 10, 2018. All candidates selected must be able to attend the entire program.</p>\n<p> </p>\n<p>Candidates will be selected from one or more of the following majors:</p>\n<p>•             Civil Engineering</p>\n<p>•             Construction Management</p>\n<p>•             Computer Engineering</p>\n<p>•             Computer Science</p>\n<p>•             Electronic Engineering</p>\n<p>•             Mechanical Engineering</p>\n<p>•             Mechatronic Engineering</p>\n<p>•             Structural Engineering</p>\n<p>•             Systems &amp; Control Engineering</p>\n<p> </p>\n<p>Summer Interns that have completed our internship program have stated:</p>\n<ul><li>        <em>“I’ve learned a lot about the actual application and safety that engineers are entitled to abide by. BART’s friendly environment has definitely made me more of an extrovert and improved my communication skills within a working environment and my personal life. I have realized that without clear and concise communication, many small tasks may potentially lead into a bigger problem down the line.”</em></li><li>        <em>“The BART internship gave me exactly the opportunity to apply the knowledge I had to real life application that can affect 450,000 people a day. I am proud that my project can improve overall safety for the BART power system as well as the BART passengers. Aside from that, the teamwork and time management skills I learned from the summer internship can also be beneficial in my future career.”</em></li></ul>\n<p><em> </em></p>\n<p><strong>SIEPR / Econ Predoctoral Research Fellows Program, 2018-19</strong></p>\n<p>The Stanford Institute for Economic Policy Research (SIEPR) and Stanford Economics are pleased to open applications for our <strong>Predoctoral Research Fellowship Program</strong>. Applications are being accepted for positions starting Summer 2018.</p>\n<p> </p>\n<p>Full program and application information is available on our website at: <a href=\"https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship\">https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship</a>. Applications received on or before <strong>March 31, 2018</strong> will be reviewed on a rolling basis.</p>\n<p> </p>\n<p>The SIEPR/Economics Predoctoral Research Fellowship program is a full-time, post baccalaureate program designed to prepare individuals wishing to gain valuable training and experience toward a career in academic research in economics or public policy. Fellows will be expected to fully engage in the intellectual life at Stanford University. They dedicate a significant portion of their time to an empirical research project and can take graduate-level courses at Stanford University for credit (up to one course per quarter). The fellowship offers tuition, health insurance, and a living stipend. We seek individuals to join our program for a period of at least one year. International applicants are welcome to apply.</p>\n<p> </p>\n<p>Ideal candidates will have:</p>\n<ul><li>Completed a 4-year undergraduate degree (bachelors or foreign equivalent) in economics, statistics, applied mathematics, or a related field;</li><li>A strong quantitative background and interest in learning cutting-edge research methods;</li><li>Creative and independent problem-solving skills;</li><li>Experience programming in Stata and R, and may have experience with GIS, Matlab, and other statistical packages; and</li><li>An interest in pursuing a PhD in Economics or a related field.</li></ul>\n<p> </p>\n<p>For position descriptions, application information, and FAQs, please visit our website: <a href=\"https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship\">https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship</a><a href=\"https://siepr.stanford.edu/about/student-opportunities/predoctoral-fellowship\"></a></p>\n<p></p>\n<p>#pin</p>", "created": "2018-01-12T23:33:20Z", "subject": "1.12.2017 Undergraduate Announcements", "uid": "hkyddknu435n5"}], "i_edits": [], "id": "jcck6lvavfw75z", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 6002, "num_favorites": 1, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654550404915, "tag_good": [], "tag_good_arr": [], "tags": ["announcements", "instructor-note"], "type": "note", "unique_views": 1198}