{"bookmarked": 2, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "jcmaonxh9ys7s", "type": "create", "uid": "hz4ud741s6s1gn", "when": "2018-01-19T19:05:08Z"}, {"anon": "no", "data": "jcmaoup8zzecv", "type": "update", "uid": "hz4ud741s6s1gn", "when": "2018-01-19T19:05:17Z"}, {"anon": "no", "data": "jcwebwykysa3oc", "type": "update", "uid": "hz4ud741s6s1gn", "when": "2018-01-26T20:44:54Z"}], "children": [], "config": {}, "created": "2018-01-19T19:05:08Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements"], "history": [{"anon": "no", "content": "<p></p><div>Dear Students,</div>\n<div></div>\n<div>Welcome back!! Hope your Spring 2018 has gotten off to a great start. It&#39;s going to be a great semester!</div>\n<div></div>\n<div><img src=\"http://astronomyonline.org/Science/Images/MathCartoons1.gif\" alt=\"\" width=\"363\" height=\"361\" /></div>\n<h2>Help the EECS Department &amp; Win Amazon Gift Cards!</h2>\n<p dir=\"ltr\">This is a reminder to please complete the 2017-18 EECS Undergraduate Survey! The deadline to submit responses is Monday, January 22.</p>\n<p> </p>\n<p dir=\"ltr\">This is the only big survey the department does each year, and your thoughts will reach staff and faculty as survey results will be used to help improve the EECS department and community!</p>\n<p> </p>\n<p dir=\"ltr\">Please fill out the survey here, if you haven&#39;t already: <a href=\"https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5\" target=\"_blank\">https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5</a></p>\n<p> </p>\n<p dir=\"ltr\">Your response is completely anonymous, so we encourage you to respond openly and honestly.</p>\n<p> </p>\n<p dir=\"ltr\">You can also opt into a drawing to win one of fifteen (15) $10 Amazon gift cards once you complete the survey!</p>\n<h2>2017 Undergraduate Student CRA Survey </h2>\n<p dir=\"ltr\">The Computing Research Association (CRA) is interested in career development among students in computing fields. They would like to hear about your experiences as a student, as well as your plans for the future. To that end, I encourage you to complete their brief survey, which will take no more than 20 minutes to complete.</p>\n<p dir=\"ltr\">Should you decide to complete the survey, you will be entered into a raffle for a $100 gift card to Amazon! This survey will close January 25, 2018 at 11:59 PM ET.</p>\n<p dir=\"ltr\">If you are interested in completing the survey, please click the link below, or copy and</p>\n<p dir=\"ltr\">paste the URL into your internet browser:</p>\n<p dir=\"ltr\"><a href=\"https://cerp.co1.qualtrics.com/jfe/form/SV_3UH7q6TmdZ8YRPD\" target=\"_blank\">https://cerp.co1.qualtrics.com/jfe/form/SV_3UH7q6TmdZ8YRPD</a></p>\n<p dir=\"ltr\">The survey is being conducted by the CRA’s Center for Evaluating the Research Pipeline</p>\n<p dir=\"ltr\">(CERP). For more information on CERP, please visit their website: <a href=\"http://cra.org/cerp/\" target=\"_blank\">http://cra.org/cerp/</a>.</p>\n<h2>SF STEM Career Day - Request for volunteers</h2>\n<p dir=\"ltr\">SEP is coordinating an the 4th SF STEM Career Day for high school students from San Francisco&#39;s public schools, to be held at Mission Bay on Wednesday, March 7th, 2018.  </p>\n<p dir=\"ltr\">This event will bring approximately 100 students from several SFUSD high schools, primarily in the southeast sector of the city, to Mission Bay for an all-day event focusing on STEM Careers. It will be an opportunity for SFUSD 10th, 11th and 12th graders to attend science tours/explorations at STEM focused worksites that will provide them with first-hand experience of the work of scientists and engineers, and to meet informally with a wide range of STEM professionals at a speed networking lunch. </p>\n<p dir=\"ltr\">As part of this day, we are recruiting STEM Ambassadors to serve as near peer mentors to the high school students, helping the SFUSD students bridge the path to college and ultimately career. STEM Ambassadors will accompany the high school students to the STEM worksite tours and during the speed networking lunch. </p>\n<p> </p>\n<p dir=\"ltr\">We believe the STEM Ambassadors will play a very important role during the day.  While closer in age to the participating high school students, their having already navigated the transition to higher education and decided to pursue a STEM career will help the younger students realize that a similar path is within their reach. Because of their additional experience and maturity, they will also be well suited to help nucleate questions and conversations with at the tour sites and with the STEM mentors.</p>\n<p> </p>\n<p dir=\"ltr\">Volunteers will join the students on an interactive tour at or nearby Mission Bay, engage in informal conversations with the students about their own interests in science, their educational pathway and careers goals, at the tours and in conversations over lunch. Your experiences will be of great interest to high school students who are eager to learn what diverse options in STEM fields are open to them! This kind of informal interaction with students can be of enormous importance to them at this early stage.</p>\n<p> </p>\n<p dir=\"ltr\">We encourage grad students, post-docs, lab researchers, and others to help in this effort and share with the students!</p>\n<p> </p>\n<p dir=\"ltr\">Interested? Below is a link for you to register to participate, for all or part of the day:</p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://tiny.ucsf.edu/Ambassador2018UCSF\" target=\"_blank\">http://tiny.ucsf.edu/Ambassador2018UCSF</a></p>\n<p> </p>\n<p dir=\"ltr\">Please contact <a href=\"mailto:Jennifer.Kaelin&#64;ucsf.edu\" target=\"_blank\">Jennifer.Kaelin&#64;ucsf.edu</a> if you have any questions. We hope to hear from you and look forward to your participation in this exciting day!</p>\n<h2>Research Opportunity </h2>\n<p dir=\"ltr\">Are you interested in machine learning, computer vision, or natural language processing (NLP)? We (Prof. Jitendra Malik and Ke Li) are looking for 2-3 motivated students to get involved in exciting research projects starting this semester. This counts as CS199 course credit. </p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Applicants must have a good GPA in technical courses (3.8 or above) and be willing to commit at least 12 hours per week. Interested students may apply at <a href=\"https://goo.gl/forms/0esiwxG6NmmmLsAY2\" target=\"_blank\">https://goo.gl/forms/0esiwxG6NmmmLsAY2</a>. </p>\n<h2><a href=\"https://berkeley.joinhandshake.com/career_fairs/3601/student_preview\" target=\"_blank\">2018 Spring Career Fair</a></h2>\n<p dir=\"ltr\">Join us at UC Berkeley&#39;s largest career fair of the semester on January 24 &amp; 25!  If you&#39;re hoping to land a full-time job after graduating or an internship this coming summer, don&#39;t miss this event!  </p>\n<p> </p>\n<p dir=\"ltr\">Recruiters from nearly 200 companies across diverse industries are eager to share information about their entry-level career and internship positions.  *NEW* Tech opportunities are represented at both days of this fair.</p>\n<ul><li>\n<p dir=\"ltr\">Wednesday, Jan 24th, 11am to 4pm &#64; RSF — Engineering, Science, &amp; Tech Opportunities</p>\n</li><li><ul><li>\n<p dir=\"ltr\">Amazon/A9/Lab126, Adobe, AppDynamics, Bloomberg R&amp;D, HERE Technologies, Intel, IXL Learning, Marvell Semiconductor, Microsoft, Oracle, Pivotal, Roche, Sandia National Labs, SpaceX, Texas Instruments, US Navy, Yelp, and many more!</p>\n</li></ul>\n</li></ul>\n<ul><li>\n<p dir=\"ltr\">Thursday, Jan 25th, 11am to 4pm &#64; RSF — Business, Public Service, &amp; Tech Opportunities</p>\n</li><li><ul><li>\n<p dir=\"ltr\">Bank of the West, California State Auditor, Chewy, Enterprise, Fisher Investments, FTI Consulting, Galileo Learning, JusticeCorps, Loeb.NYC, Ma Labs, Macy&#39;s, Marvell Semiconductor, Matsui Center, Oracle, Overstock.com, Seneca, Symantec, Teach for America, Uber - Advanced Technologies Group, US Marines, Visa, Western Digital, ZS Associates, &amp; many more!</p>\n</li></ul>\n</li></ul>\n<p dir=\"ltr\">►Preview the entire employer directory in <a href=\"https://berkeley.joinhandshake.com/career_fairs/3601/student_preview\" target=\"_blank\">Handshake</a> (Tip: use the &#34;Career Fair Sessions&#34; search option to see who is coming each day).  </p>\n<p> </p>\n<p dir=\"ltr\">►Add the event to your <a href=\"https://www.facebook.com/events/167081680730654/\" target=\"_blank\">Facebook Calendar</a>!  </p>\n<p> </p>\n<p dir=\"ltr\">Registration is not required.  Currently enrolled Cal students and <a href=\"https://career.berkeley.edu/Alumni/AlumniAdv\" target=\"_blank\">Alumni Advantage</a> members only; recruiting all majors and class-levels! </p>\n<h2>Science of Software (SoS) Research Experience for Undergraduates at NC State University - Summer 2018</h2>\n<p dir=\"ltr\">Application Deadline: February 9th, 2018</p>\n<p> </p>\n<p dir=\"ltr\">The <a href=\"http://reu.csc.ncsu.edu/\" target=\"_blank\">Science of Software REU Site at NC State University</a> immerses a diverse group of undergraduates in a vibrant research community working on data science and software engineering. Research projects include visualization and data manipulation in virtual reality, model-based reasoning, human aspects (e.g., eye tracking data), bug fixing, software analytics which is a cross between software and data mining methods, and software engineering education.  The REU will run from Tuesday, May 29th to Friday, August 3rd, 2018.</p>\n<p dir=\"ltr\">Students will work beside research faculty to gain hands-on experience with data science skills: machine learning, data engineering, statistics, and studying developer behavior through observation, interviews, surveys, biometrics, and data collection. REU students present their work at an undergraduate research competition, develop videos to convey their research to K-12 students, and are encouraged to submit their technical papers as peer-reviewed publications.</p>\n<p> </p>\n<p dir=\"ltr\">Website: <a href=\"http://reu.csc.ncsu.edu/\" target=\"_blank\">http://reu.csc.ncsu.edu/</a></p>\n<p dir=\"ltr\">Application: <a href=\"https://goo.gl/forms/Oho2Ntn9gF71YX943\" target=\"_blank\">https://goo.gl/forms/Oho2Ntn9gF71YX943</a> </p>\n<h2>Center for Human-Compatible AI Internship</h2>\n<p dir=\"ltr\">The Center for Human-Compatible AI (CHAI) has opened applications for paid research internships! This is a great opportunity to get research experience and learn about the growing field of AI safety. It helps to have prior machine learning experience but is not required. For more details see <a href=\"http://humancompatible.ai/jobs#internship\" target=\"_blank\">here</a>.</p>\n<h2>SF Funded Research Experience for Undergraduates (REU) at George Mason University</h2>\n<p dir=\"ltr\">Undergraduate students can participate in a paid data science research program next Summer at George Mason University.</p>\n<p> </p>\n<p dir=\"ltr\">REU Site: Undergraduate Research in Educational Data Mining</p>\n<p dir=\"ltr\">website: <a href=\"http://cs.gmu.edu/~reu\" target=\"_blank\">http://cs.gmu.edu/~reu</a></p>\n<p dir=\"ltr\">application deadline: February 15th, 2018</p>\n<p> </p>\n<p dir=\"ltr\">PI: Dr. Huzefa Rangwala</p>\n<p dir=\"ltr\">Co-PI: Dr. Mark Snyder</p>\n<p> </p>\n<p dir=\"ltr\">Field of research: Computer Science; Sub-Field: Educational Data Mining, Machine Learning,  Visualization, Learning Technologies</p>\n<p> </p>\n<p dir=\"ltr\">Point of contact: Dr. Mark Snyder, <a target=\"_blank\">703-993-5624</a>, <a href=\"mailto:msnyde14&#64;gmu.edu\" target=\"_blank\">msnyde14&#64;gmu.edu</a></p>\n<p> </p>\n<p dir=\"ltr\">Project Description</p>\n<p dir=\"ltr\">The primary goal of this interdisciplinary REU Site program is to expose ten high quality undergraduate students to advanced topics in analytics, data mining, and visualization techniques as applied to data from the education domain. Students will participate in projects with the central theme of improving instructional technology design, enhancing academic curricula and modeling learning experiences. From an analytical methodology standpoint, projects will investigate approaches to model the dynamic knowledge state of a student throughout a sequential academic program. Projects will also model the learning behavior of younger students in informal settings by analyzing the server logs of the Scratch framework or Online Engineering Communities. Projects will also model the learning habits of practitioners while interacting with online programming environments.</p>\n<h2>Student Tech Services Now Hiring!</h2>\n<p dir=\"ltr\">Student Tech Services is now hiring! Jobs for the summer and 2018/19 school year are now open at <a href=\"https://studenttech.berkeley.edu/student-jobs\" target=\"_blank\">studenttech.berkeley.edu/student-jobs</a></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">·  A variety of positions with competitive pay! ($15-22.75/hr)</p>\n<p dir=\"ltr\">·  Flexible schedules in a student friendly office</p>\n<p dir=\"ltr\">·  On the job training, no experience required for many of our positions </p>\n<p> </p>\n<p dir=\"ltr\">Join us for our Student IT Job Fair on Monday, February 5th for a chance to talk with our current staff and get help with your resume! <a href=\"http://bit.ly/IT_Job_Fair\" target=\"_blank\">http://bit.ly/IT_Job_Fair</a></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Apply by 5pm, Friday February 9th!</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\"><a href=\"https://www.youtube.com/watch?v=KxiaweXB2Vo\" target=\"_blank\">Student Tech Services Promo Video</a></p>\n<h2>SUMMER MINOR IN JOURNALISM</h2>\n<p dir=\"ltr\">Hello Undergraduate Students!</p>\n<p> </p>\n<p dir=\"ltr\">Interested in improving your communications skills? Come join our popular  Summer Minor in Journalism. UC Berkeley School of Journalism now offers a minor in digital journalism that is open to students of all majors and can be completed in one summer. Get hands-on instruction in news writing, video, multimedia, photography and social media.  <a href=\"https://journalism.berkeley.edu/special-programs/summer-minor/\" target=\"_blank\">See our site for more information</a>. Registration opens February 1, 2018 and classes fill fast! Students who enroll this summer and complete the minor in one summer or two will receive a $2000 scholarship. </p>\n<p> </p>\n<p dir=\"ltr\">We look forward to seeing you this summer!</p>\n<h2>Berkeley MFE Firm Night</h2>\n<p dir=\"ltr\">On behalf of the Berkeley Master of Financial Engineering (MFE) Program, we invite you to participate in the MFE Firm Night &amp; Career Fair on Thursday, January 25, 2018 from 5 PM - 8 PM in the Spieker Forum of Chou Hall at the Haas School of Business. </p>\n<p> </p>\n<p dir=\"ltr\">This event is for graduating students seeking full-time opportunities.</p>\n<p dir=\"ltr\">Companies coming to the event have had long and successful relationships recruiting from the Master of Financial Engineering program and other programs on campus (statistics, mathematics, engineering, information, computer science, etc.).  All Master&#39;s and PhD students with an interest in quantitative finance, data science, fintech start ups, are encouraged to attend and network. Please bring several copies of your resumes.  Formal business attire is required.  Refreshments will be provided; logistical details to follow after registration. </p>\n<p dir=\"ltr\">REGISTER <a href=\"https://goo.gl/forms/NoW8svGj2zPlXcf92\" target=\"_blank\">HERE</a>.  </p>\n<p dir=\"ltr\">Date: Thursday, January 25, 2018</p>\n<p dir=\"ltr\">Time: 5 - 8 PM PST</p>\n<p dir=\"ltr\">Location: Spieker Forum, Chou Hall, Haas School of Business (<a href=\"https://maps.google.com/?q=2220&#43;Piedmont&#43;Avenue,&#43;Berkeley&amp;entry=gmail&amp;source=g\" target=\"_blank\">2220 Piedmont Avenue, Berkeley</a>)</p>\n<p> </p>\n<p dir=\"ltr\">Please email <a href=\"mailto:jchin&#64;haas.berkeley.edu\" target=\"_blank\">jchin&#64;haas.berkeley.edu</a> directly with any questions.</p>\n<h2>Be A Scientist: Inspire 7th graders to discover their inner scientist!</h2>\n<p dir=\"ltr\"><a href=\"http://www.crscience.org/volunteers/BeAScientist\" target=\"_blank\">www.crscience.org/volunteers/BeAScientist</a></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">We invite UC Berkeley graduate students, post-docs, and motivated 3rd/4th year undergrads to take part in Be A Scientist, an exciting science outreach program in Berkeley middle schools! The upcoming semester is as follows:</p>\n<ul><li>\n<p dir=\"ltr\">Session 3 Spring 2018 will take place at King Middle School, February 1st - March 15th (with a one week gap Feb. 15/16 for President&#39;s Day)</p>\n</li><li>\n<p dir=\"ltr\">Session 4 Spring 2018 will take place at Longfellow Middle School, February 27th - April 17th, with a two week gap (March 27/April 3) for both UCB and BUSD Spring Breaks</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\"> As a volunteer scientist mentor, you will guide 7th graders through the process of designing and conducting their own scientific investigations in class over a 6-week period. This is a wonderful opportunity for you to serve as a STEM role model while developing your communication skills and gaining hands-on experience in important science outreach.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Details:</p>\n<ul><li>\n<p dir=\"ltr\">Mentors must commit to one mandatory 2-hr Training Session: On-campus trainings are offered in the weeks before the start of each session. Training dates/times/locations TBA</p>\n</li><li>\n<p dir=\"ltr\">Commit to attend one school lab period each week for the 6-week program (schedule program dates <a href=\"http://www.crscience.org/volunteers/BeAScientist\" target=\"_blank\">here</a> and attached flyer).</p>\n</li><li>\n<p dir=\"ltr\">Guide 4-6 student mentees through the process of developing a testable question, designing an appropriate experiment, and gathering and analyzing data. Each student in your group will have the opportunity to choose an independent scientific question based on their own interests.</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Please carefully read over the details provided in the attached flyer and on our website. <a href=\"http://www.crscience.org/volunteers/BeAScientistSignup\" target=\"_blank\">Sign up</a> as a mentor to make an impact on future scientists, engineers, and critical thinkers!</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">To learn more, visit: <a href=\"http://www.crscience.org/volunteers/BeAScientist\" target=\"_blank\">www.crscience.org/volunteers/BeAScientist</a></p>\n<p dir=\"ltr\">Questions? Contact Darlene at <a href=\"mailto:BASprogram&#64;crscience.org\" target=\"_blank\">BASprogram&#64;crscience.org</a></p>\n<h2>Social Media Marketing Intern at the School of Information</h2>\n<p dir=\"ltr\">The job can be found via Workstudy, job # <a target=\"_blank\">8732774341</a>; or Handshake job # 1273193. They can also email <a href=\"mailto:cappert&#64;ischool.berkeley.edu\" target=\"_blank\">cappert&#64;ischool.berkeley.edu</a> directly.</p>\n<p> </p>\n<p dir=\"ltr\">Social Media Marketing Intern:</p>\n<p dir=\"ltr\">Responsible for helping to devise and implement a digital marketing and social media strategy across various platforms in order to maximize the visibility and awareness of the School of Information’s collaborations, programs, and research. Works closely with the Digital Communications Strategist.</p>\n<p> </p>\n<p dir=\"ltr\">Objectives:</p>\n<p dir=\"ltr\">Use social media storytelling and digital marketing strategy to increase brand awareness and recognition:</p>\n<p dir=\"ltr\">- Across the information industry</p>\n<p dir=\"ltr\">- Among industry partners  </p>\n<p dir=\"ltr\">Assist with digital media campaigns to:</p>\n<p dir=\"ltr\">- Showcase projects and work by current students, accomplishments of alumni, and faculty research and projects</p>\n<p dir=\"ltr\">-Increase enrollment/applications to recruit top quality students for the different degree programs and courses</p>\n<p dir=\"ltr\">-Engage current students, alumni, and employers to foster an online community atmosphere</p>\n<p> </p>\n<p dir=\"ltr\">Main Responsibilities:</p>\n<ul><li>\n<p dir=\"ltr\">Create/draft content for social media channels</p>\n</li><li>\n<p dir=\"ltr\">Monitor performance and metrics of digital marketing campaigns and website usage</p>\n</li><li>\n<p dir=\"ltr\">Manage an editorial schedule/calendar of digital activity</p>\n</li><li>\n<p dir=\"ltr\">Help develop and execute a digital strategy incorporating digital editorial and marketing plans to ensure the School of Information is at the leading edge of online communication</p>\n</li><li>\n<p dir=\"ltr\">Help build a strong digital network of prospective students, alumni, employers, and partners on campus.</p>\n</li><li>\n<p dir=\"ltr\">Stay current on developments in social media</p>\n</li><li>\n<p dir=\"ltr\">Initiate future projects utilizing technology and social media</p>\n</li><li>\n<p dir=\"ltr\">Assist with I School events, advertisements, and social media related to events</p>\n</li><li>\n<p dir=\"ltr\">Other duties as needed</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Requirements:</p>\n<ul><li>\n<p dir=\"ltr\">Available throughout academic year (Sept-May)</p>\n</li><li>\n<p dir=\"ltr\">Experience with social media, specifically Twitter, Instagram, Facebook, LinkedIn, and YouTube</p>\n</li><li>\n<p dir=\"ltr\">Experience gathering and analyzing metrics from online sources and Excel</p>\n</li><li>\n<p dir=\"ltr\">Organized, detail-oriented with an ability to multi-task and is excited about social media!</p>\n</li><li>\n<p dir=\"ltr\">Driven, self-motivated, and independent. Ability to complete tasks with minimal supervision.</p>\n</li><li>\n<p dir=\"ltr\">Demonstrates a positive, can-do attitude with a passion for making things happen.</p>\n</li><li>\n<p dir=\"ltr\">Excellent task management and problem-solving skills.</p>\n</li><li>\n<p dir=\"ltr\">Up to date on latest social media trends and innovations.</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Preferred Qualifications:</p>\n<ul><li>\n<p dir=\"ltr\">Excellent writer with experience writing news articles and short copy for web</p>\n</li><li>\n<p dir=\"ltr\">Graphic design skills</p>\n</li><li>\n<p dir=\"ltr\">Strong interest in branding and brand development</p>\n</li><li>\n<p dir=\"ltr\">Cursory understanding of and interest in topics studied at the I School</p>\n</li><li>\n<p dir=\"ltr\">Past experience managing social media for a brand, or demonstrated ability use social media to engage or influence</p>\n</li></ul>\n<h2>Research Assistant Position</h2>\n<p dir=\"ltr\">Rich Ivry’s Cognition and Action Lab is looking for an undergraduate research assistant for a data visualization project. This project requires fluency with Python and they are giving special priority to students who are pursuing a major in cognitive and/or computer science. See the <a href=\"https://drive.google.com/open?id=0B-gDXENcUsFoNFB6X1lwV09PUEZ1VXZ0M1E5X20za0JnNmxn\" target=\"_blank\">attached flyer</a> which outlines the project along with a description of student responsibilities. </p>\n<p> </p>\n<p dir=\"ltr\">Special priority will be given to the students with the following characteristics: </p>\n<ul><li>\n<p dir=\"ltr\">Fluency with Python programming</p>\n</li><li>\n<p dir=\"ltr\">Major in cognitive and/or computer science</p>\n</li><li>\n<p dir=\"ltr\">Interest in neuroimaging techniques</p>\n</li><li>\n<p dir=\"ltr\">Ability to devote a minimum of 10 hours per week for at least 6 months to the project</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">If interested, please contact Maedbh King at <a href=\"mailto:maedbhking&#64;berkeley.edu\" target=\"_blank\">maedbhking&#64;berkeley.edu</a> and use the subject line “Interactive Visualization Project”. </p>\n<p></p>", "created": "2018-01-26T20:44:54Z", "subject": "1.19.2018 Undergraduate Announcements", "uid": "hz4ud741s6s1gn"}, {"anon": "no", "content": "<p></p><div>Dear Students,</div>\n<div></div>\n<div>Welcome back!! Hope your Spring 2018 has gotten off to a great start. It&#39;s going to be a great semester!</div>\n<div></div>\n<div><img src=\"http://astronomyonline.org/Science/Images/MathCartoons1.gif\" alt=\"\" width=\"363\" height=\"361\" /></div>\n<h2>Help the EECS Department &amp; Win Amazon Gift Cards!</h2>\n<p dir=\"ltr\">This is a reminder to please complete the 2017-18 EECS Undergraduate Survey! The deadline to submit responses is Monday, January 22.</p>\n<p> </p>\n<p dir=\"ltr\">This is the only big survey the department does each year, and your thoughts will reach staff and faculty as survey results will be used to help improve the EECS department and community!</p>\n<p> </p>\n<p dir=\"ltr\">Please fill out the survey here, if you haven&#39;t already: <a href=\"https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5\" target=\"_blank\">https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5</a></p>\n<p> </p>\n<p dir=\"ltr\">Your response is completely anonymous, so we encourage you to respond openly and honestly.</p>\n<p> </p>\n<p dir=\"ltr\">You can also opt into a drawing to win one of fifteen (15) $10 Amazon gift cards once you complete the survey!</p>\n<h2>2017 Undergraduate Student CRA Survey </h2>\n<p dir=\"ltr\">The Computing Research Association (CRA) is interested in career development among students in computing fields. They would like to hear about your experiences as a student, as well as your plans for the future. To that end, I encourage you to complete their brief survey, which will take no more than 20 minutes to complete.</p>\n<p dir=\"ltr\">Should you decide to complete the survey, you will be entered into a raffle for a $100 gift card to Amazon! This survey will close January 25, 2018 at 11:59 PM ET.</p>\n<p dir=\"ltr\">If you are interested in completing the survey, please click the link below, or copy and</p>\n<p dir=\"ltr\">paste the URL into your internet browser:</p>\n<p dir=\"ltr\"><a href=\"https://cerp.co1.qualtrics.com/jfe/form/SV_3UH7q6TmdZ8YRPD\" target=\"_blank\">https://cerp.co1.qualtrics.com/jfe/form/SV_3UH7q6TmdZ8YRPD</a></p>\n<p dir=\"ltr\">The survey is being conducted by the CRA’s Center for Evaluating the Research Pipeline</p>\n<p dir=\"ltr\">(CERP). For more information on CERP, please visit their website: <a href=\"http://cra.org/cerp/\" target=\"_blank\">http://cra.org/cerp/</a>.</p>\n<h2>SF STEM Career Day - Request for volunteers</h2>\n<p dir=\"ltr\">SEP is coordinating an the 4th SF STEM Career Day for high school students from San Francisco&#39;s public schools, to be held at Mission Bay on Wednesday, March 7th, 2018.  </p>\n<p dir=\"ltr\">This event will bring approximately 100 students from several SFUSD high schools, primarily in the southeast sector of the city, to Mission Bay for an all-day event focusing on STEM Careers. It will be an opportunity for SFUSD 10th, 11th and 12th graders to attend science tours/explorations at STEM focused worksites that will provide them with first-hand experience of the work of scientists and engineers, and to meet informally with a wide range of STEM professionals at a speed networking lunch. </p>\n<p dir=\"ltr\">As part of this day, we are recruiting STEM Ambassadors to serve as near peer mentors to the high school students, helping the SFUSD students bridge the path to college and ultimately career. STEM Ambassadors will accompany the high school students to the STEM worksite tours and during the speed networking lunch. </p>\n<p> </p>\n<p dir=\"ltr\">We believe the STEM Ambassadors will play a very important role during the day.  While closer in age to the participating high school students, their having already navigated the transition to higher education and decided to pursue a STEM career will help the younger students realize that a similar path is within their reach. Because of their additional experience and maturity, they will also be well suited to help nucleate questions and conversations with at the tour sites and with the STEM mentors.</p>\n<p> </p>\n<p dir=\"ltr\">Volunteers will join the students on an interactive tour at or nearby Mission Bay, engage in informal conversations with the students about their own interests in science, their educational pathway and careers goals, at the tours and in conversations over lunch. Your experiences will be of great interest to high school students who are eager to learn what diverse options in STEM fields are open to them! This kind of informal interaction with students can be of enormous importance to them at this early stage.</p>\n<p> </p>\n<p dir=\"ltr\">We encourage grad students, post-docs, lab researchers, and others to help in this effort and share with the students!</p>\n<p> </p>\n<p dir=\"ltr\">Interested? Below is a link for you to register to participate, for all or part of the day:</p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://tiny.ucsf.edu/Ambassador2018UCSF\" target=\"_blank\">http://tiny.ucsf.edu/Ambassador2018UCSF</a></p>\n<p> </p>\n<p dir=\"ltr\">Please contact <a href=\"mailto:Jennifer.Kaelin&#64;ucsf.edu\" target=\"_blank\">Jennifer.Kaelin&#64;ucsf.edu</a> if you have any questions. We hope to hear from you and look forward to your participation in this exciting day!</p>\n<h2>Research Opportunity </h2>\n<p dir=\"ltr\">Are you interested in machine learning, computer vision, or natural language processing (NLP)? We (Prof. Jitendra Malik and Ke Li) are looking for 2-3 motivated students to get involved in exciting research projects starting this semester. This counts as CS199 course credit. </p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Applicants must have a good GPA in technical courses (3.8 or above) and be willing to commit at least 12 hours per week. Interested students may apply at <a href=\"https://goo.gl/forms/0esiwxG6NmmmLsAY2\" target=\"_blank\">https://goo.gl/forms/0esiwxG6NmmmLsAY2</a>. </p>\n<h2><a href=\"https://berkeley.joinhandshake.com/career_fairs/3601/student_preview\" target=\"_blank\">2018 Spring Career Fair</a></h2>\n<p dir=\"ltr\">Join us at UC Berkeley&#39;s largest career fair of the semester on January 24 &amp; 25!  If you&#39;re hoping to land a full-time job after graduating or an internship this coming summer, don&#39;t miss this event!  </p>\n<p> </p>\n<p dir=\"ltr\">Recruiters from nearly 200 companies across diverse industries are eager to share information about their entry-level career and internship positions.  *NEW* Tech opportunities are represented at both days of this fair.</p>\n<ul><li>\n<p dir=\"ltr\">Wednesday, Jan 24th, 11am to 4pm &#64; RSF — Engineering, Science, &amp; Tech Opportunities</p>\n</li><li><ul><li>\n<p dir=\"ltr\">Amazon/A9/Lab126, Adobe, AppDynamics, Bloomberg R&amp;D, HERE Technologies, Intel, IXL Learning, Marvell Semiconductor, Microsoft, Oracle, Pivotal, Roche, Sandia National Labs, SpaceX, Texas Instruments, US Navy, Yelp, and many more!</p>\n</li></ul>\n</li></ul>\n<ul><li>\n<p dir=\"ltr\">Thursday, Jan 25th, 11am to 4pm &#64; RSF — Business, Public Service, &amp; Tech Opportunities</p>\n</li><li><ul><li>\n<p dir=\"ltr\">Bank of the West, California State Auditor, Chewy, Enterprise, Fisher Investments, FTI Consulting, Galileo Learning, JusticeCorps, Loeb.NYC, Ma Labs, Macy&#39;s, Marvell Semiconductor, Matsui Center, Oracle, Overstock.com, Seneca, Symantec, Teach for America, Uber - Advanced Technologies Group, US Marines, Visa, Western Digital, ZS Associates, &amp; many more!</p>\n</li></ul>\n</li></ul>\n<p dir=\"ltr\">►Preview the entire employer directory in <a href=\"https://berkeley.joinhandshake.com/career_fairs/3601/student_preview\" target=\"_blank\">Handshake</a> (Tip: use the &#34;Career Fair Sessions&#34; search option to see who is coming each day).  </p>\n<p> </p>\n<p dir=\"ltr\">►Add the event to your <a href=\"https://www.facebook.com/events/167081680730654/\" target=\"_blank\">Facebook Calendar</a>!  </p>\n<p> </p>\n<p dir=\"ltr\">Registration is not required.  Currently enrolled Cal students and <a href=\"https://career.berkeley.edu/Alumni/AlumniAdv\" target=\"_blank\">Alumni Advantage</a> members only; recruiting all majors and class-levels! </p>\n<h2>Science of Software (SoS) Research Experience for Undergraduates at NC State University - Summer 2018</h2>\n<p dir=\"ltr\">Application Deadline: February 9th, 2018</p>\n<p> </p>\n<p dir=\"ltr\">The <a href=\"http://reu.csc.ncsu.edu/\" target=\"_blank\">Science of Software REU Site at NC State University</a> immerses a diverse group of undergraduates in a vibrant research community working on data science and software engineering. Research projects include visualization and data manipulation in virtual reality, model-based reasoning, human aspects (e.g., eye tracking data), bug fixing, software analytics which is a cross between software and data mining methods, and software engineering education.  The REU will run from Tuesday, May 29th to Friday, August 3rd, 2018.</p>\n<p dir=\"ltr\">Students will work beside research faculty to gain hands-on experience with data science skills: machine learning, data engineering, statistics, and studying developer behavior through observation, interviews, surveys, biometrics, and data collection. REU students present their work at an undergraduate research competition, develop videos to convey their research to K-12 students, and are encouraged to submit their technical papers as peer-reviewed publications.</p>\n<p> </p>\n<p dir=\"ltr\">Website: <a href=\"http://reu.csc.ncsu.edu/\" target=\"_blank\">http://reu.csc.ncsu.edu/</a></p>\n<p dir=\"ltr\">Application: <a href=\"https://goo.gl/forms/Oho2Ntn9gF71YX943\" target=\"_blank\">https://goo.gl/forms/Oho2Ntn9gF71YX943</a> </p>\n<h2>Center for Human-Compatible AI Internship</h2>\n<p dir=\"ltr\">The Center for Human-Compatible AI (CHAI) has opened applications for paid research internships! This is a great opportunity to get research experience and learn about the growing field of AI safety. It helps to have prior machine learning experience but is not required. For more details see <a href=\"http://humancompatible.ai/jobs#internship\" target=\"_blank\">here</a>.</p>\n<h2>SF Funded Research Experience for Undergraduates (REU) at George Mason University</h2>\n<p dir=\"ltr\">Undergraduate students can participate in a paid data science research program next Summer at George Mason University.</p>\n<p> </p>\n<p dir=\"ltr\">REU Site: Undergraduate Research in Educational Data Mining</p>\n<p dir=\"ltr\">website: <a href=\"http://cs.gmu.edu/~reu\" target=\"_blank\">http://cs.gmu.edu/~reu</a></p>\n<p dir=\"ltr\">application deadline: February 15th, 2018</p>\n<p> </p>\n<p dir=\"ltr\">PI: Dr. Huzefa Rangwala</p>\n<p dir=\"ltr\">Co-PI: Dr. Mark Snyder</p>\n<p> </p>\n<p dir=\"ltr\">Field of research: Computer Science; Sub-Field: Educational Data Mining, Machine Learning,  Visualization, Learning Technologies</p>\n<p> </p>\n<p dir=\"ltr\">Point of contact: Dr. Mark Snyder, <a target=\"_blank\">703-993-5624</a>, <a href=\"mailto:msnyde14&#64;gmu.edu\" target=\"_blank\">msnyde14&#64;gmu.edu</a></p>\n<p> </p>\n<p dir=\"ltr\">Project Description</p>\n<p dir=\"ltr\">The primary goal of this interdisciplinary REU Site program is to expose ten high quality undergraduate students to advanced topics in analytics, data mining, and visualization techniques as applied to data from the education domain. Students will participate in projects with the central theme of improving instructional technology design, enhancing academic curricula and modeling learning experiences. From an analytical methodology standpoint, projects will investigate approaches to model the dynamic knowledge state of a student throughout a sequential academic program. Projects will also model the learning behavior of younger students in informal settings by analyzing the server logs of the Scratch framework or Online Engineering Communities. Projects will also model the learning habits of practitioners while interacting with online programming environments.</p>\n<h2>Student Tech Services Now Hiring!</h2>\n<p dir=\"ltr\">Student Tech Services is now hiring! Jobs for the summer and 2018/19 school year are now open at <a href=\"https://studenttech.berkeley.edu/student-jobs\" target=\"_blank\">studenttech.berkeley.edu/student-jobs</a></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">·  A variety of positions with competitive pay! ($15-22.75/hr)</p>\n<p dir=\"ltr\">·  Flexible schedules in a student friendly office</p>\n<p dir=\"ltr\">·  On the job training, no experience required for many of our positions </p>\n<p> </p>\n<p dir=\"ltr\">Join us for our Student IT Job Fair on Monday, February 5th for a chance to talk with our current staff and get help with your resume! <a href=\"http://bit.ly/IT_Job_Fair\" target=\"_blank\">http://bit.ly/IT_Job_Fair</a></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Apply by 5pm, Friday February 9th!</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\"><a href=\"https://www.youtube.com/watch?v=KxiaweXB2Vo\" target=\"_blank\">Student Tech Services Promo Video</a></p>\n<h2>SUMMER MINOR IN JOURNALISM</h2>\n<p dir=\"ltr\">Hello Undergraduate Students!</p>\n<p> </p>\n<p dir=\"ltr\">Interested in improving your communications skills? Come join our popular  Summer Minor in Journalism. UC Berkeley School of Journalism now offers a minor in digital journalism that is open to students of all majors and can be completed in one summer. Get hands-on instruction in news writing, video, multimedia, photography and social media.  <a href=\"https://journalism.berkeley.edu/special-programs/summer-minor/\" target=\"_blank\">See our site for more information</a>. Registration opens February 1, 2018 and classes fill fast! Students who enroll this summer and complete the minor in one summer or two will receive a $2000 scholarship. </p>\n<p> </p>\n<p dir=\"ltr\">We look forward to seeing you this summer!</p>\n<h2>Berkeley MFE Firm Night</h2>\n<p dir=\"ltr\">On behalf of the Berkeley Master of Financial Engineering (MFE) Program, we invite you to participate in the MFE Firm Night &amp; Career Fair on Thursday, January 25, 2018 from 5 PM - 8 PM in the Spieker Forum of Chou Hall at the Haas School of Business. </p>\n<p> </p>\n<p dir=\"ltr\">This event is for graduating students seeking full-time opportunities.</p>\n<p dir=\"ltr\">Companies coming to the event have had long and successful relationships recruiting from the Master of Financial Engineering program and other programs on campus (statistics, mathematics, engineering, information, computer science, etc.).  All Master&#39;s and PhD students with an interest in quantitative finance, data science, fintech start ups, are encouraged to attend and network. Please bring several copies of your resumes.  Formal business attire is required.  Refreshments will be provided; logistical details to follow after registration. </p>\n<p dir=\"ltr\">REGISTER <a href=\"https://goo.gl/forms/NoW8svGj2zPlXcf92\" target=\"_blank\">HERE</a>.  </p>\n<p dir=\"ltr\">Date: Thursday, January 25, 2018</p>\n<p dir=\"ltr\">Time: 5 - 8 PM PST</p>\n<p dir=\"ltr\">Location: Spieker Forum, Chou Hall, Haas School of Business (<a href=\"https://maps.google.com/?q=2220&#43;Piedmont&#43;Avenue,&#43;Berkeley&amp;entry=gmail&amp;source=g\" target=\"_blank\">2220 Piedmont Avenue, Berkeley</a>)</p>\n<p> </p>\n<p dir=\"ltr\">Please email <a href=\"mailto:jchin&#64;haas.berkeley.edu\" target=\"_blank\">jchin&#64;haas.berkeley.edu</a> directly with any questions.</p>\n<h2>Be A Scientist: Inspire 7th graders to discover their inner scientist!</h2>\n<p dir=\"ltr\"><a href=\"http://www.crscience.org/volunteers/BeAScientist\" target=\"_blank\">www.crscience.org/volunteers/BeAScientist</a></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">We invite UC Berkeley graduate students, post-docs, and motivated 3rd/4th year undergrads to take part in Be A Scientist, an exciting science outreach program in Berkeley middle schools! The upcoming semester is as follows:</p>\n<ul><li>\n<p dir=\"ltr\">Session 3 Spring 2018 will take place at King Middle School, February 1st - March 15th (with a one week gap Feb. 15/16 for President&#39;s Day)</p>\n</li><li>\n<p dir=\"ltr\">Session 4 Spring 2018 will take place at Longfellow Middle School, February 27th - April 17th, with a two week gap (March 27/April 3) for both UCB and BUSD Spring Breaks</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\"> As a volunteer scientist mentor, you will guide 7th graders through the process of designing and conducting their own scientific investigations in class over a 6-week period. This is a wonderful opportunity for you to serve as a STEM role model while developing your communication skills and gaining hands-on experience in important science outreach.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Details:</p>\n<ul><li>\n<p dir=\"ltr\">Mentors must commit to one mandatory 2-hr Training Session: On-campus trainings are offered in the weeks before the start of each session. Training dates/times/locations TBA</p>\n</li><li>\n<p dir=\"ltr\">Commit to attend one school lab period each week for the 6-week program (schedule program dates <a href=\"http://www.crscience.org/volunteers/BeAScientist\" target=\"_blank\">here</a> and attached flyer).</p>\n</li><li>\n<p dir=\"ltr\">Guide 4-6 student mentees through the process of developing a testable question, designing an appropriate experiment, and gathering and analyzing data. Each student in your group will have the opportunity to choose an independent scientific question based on their own interests.</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Please carefully read over the details provided in the attached flyer and on our website. <a href=\"http://www.crscience.org/volunteers/BeAScientistSignup\" target=\"_blank\">Sign up</a> as a mentor to make an impact on future scientists, engineers, and critical thinkers!</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">To learn more, visit: <a href=\"http://www.crscience.org/volunteers/BeAScientist\" target=\"_blank\">www.crscience.org/volunteers/BeAScientist</a></p>\n<p dir=\"ltr\">Questions? Contact Darlene at <a href=\"mailto:BASprogram&#64;crscience.org\" target=\"_blank\">BASprogram&#64;crscience.org</a></p>\n<h2>Social Media Marketing Intern at the School of Information</h2>\n<p dir=\"ltr\">The job can be found via Workstudy, job # <a target=\"_blank\">8732774341</a>; or Handshake job # 1273193. They can also email <a href=\"mailto:cappert&#64;ischool.berkeley.edu\" target=\"_blank\">cappert&#64;ischool.berkeley.edu</a> directly.</p>\n<p> </p>\n<p dir=\"ltr\">Social Media Marketing Intern:</p>\n<p dir=\"ltr\">Responsible for helping to devise and implement a digital marketing and social media strategy across various platforms in order to maximize the visibility and awareness of the School of Information’s collaborations, programs, and research. Works closely with the Digital Communications Strategist.</p>\n<p> </p>\n<p dir=\"ltr\">Objectives:</p>\n<p dir=\"ltr\">Use social media storytelling and digital marketing strategy to increase brand awareness and recognition:</p>\n<p dir=\"ltr\">- Across the information industry</p>\n<p dir=\"ltr\">- Among industry partners  </p>\n<p dir=\"ltr\">Assist with digital media campaigns to:</p>\n<p dir=\"ltr\">- Showcase projects and work by current students, accomplishments of alumni, and faculty research and projects</p>\n<p dir=\"ltr\">-Increase enrollment/applications to recruit top quality students for the different degree programs and courses</p>\n<p dir=\"ltr\">-Engage current students, alumni, and employers to foster an online community atmosphere</p>\n<p> </p>\n<p dir=\"ltr\">Main Responsibilities:</p>\n<ul><li>\n<p dir=\"ltr\">Create/draft content for social media channels</p>\n</li><li>\n<p dir=\"ltr\">Monitor performance and metrics of digital marketing campaigns and website usage</p>\n</li><li>\n<p dir=\"ltr\">Manage an editorial schedule/calendar of digital activity</p>\n</li><li>\n<p dir=\"ltr\">Help develop and execute a digital strategy incorporating digital editorial and marketing plans to ensure the School of Information is at the leading edge of online communication</p>\n</li><li>\n<p dir=\"ltr\">Help build a strong digital network of prospective students, alumni, employers, and partners on campus.</p>\n</li><li>\n<p dir=\"ltr\">Stay current on developments in social media</p>\n</li><li>\n<p dir=\"ltr\">Initiate future projects utilizing technology and social media</p>\n</li><li>\n<p dir=\"ltr\">Assist with I School events, advertisements, and social media related to events</p>\n</li><li>\n<p dir=\"ltr\">Other duties as needed</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Requirements:</p>\n<ul><li>\n<p dir=\"ltr\">Available throughout academic year (Sept-May)</p>\n</li><li>\n<p dir=\"ltr\">Experience with social media, specifically Twitter, Instagram, Facebook, LinkedIn, and YouTube</p>\n</li><li>\n<p dir=\"ltr\">Experience gathering and analyzing metrics from online sources and Excel</p>\n</li><li>\n<p dir=\"ltr\">Organized, detail-oriented with an ability to multi-task and is excited about social media!</p>\n</li><li>\n<p dir=\"ltr\">Driven, self-motivated, and independent. Ability to complete tasks with minimal supervision.</p>\n</li><li>\n<p dir=\"ltr\">Demonstrates a positive, can-do attitude with a passion for making things happen.</p>\n</li><li>\n<p dir=\"ltr\">Excellent task management and problem-solving skills.</p>\n</li><li>\n<p dir=\"ltr\">Up to date on latest social media trends and innovations.</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Preferred Qualifications:</p>\n<ul><li>\n<p dir=\"ltr\">Excellent writer with experience writing news articles and short copy for web</p>\n</li><li>\n<p dir=\"ltr\">Graphic design skills</p>\n</li><li>\n<p dir=\"ltr\">Strong interest in branding and brand development</p>\n</li><li>\n<p dir=\"ltr\">Cursory understanding of and interest in topics studied at the I School</p>\n</li><li>\n<p dir=\"ltr\">Past experience managing social media for a brand, or demonstrated ability use social media to engage or influence</p>\n</li></ul>\n<h2>Research Assistant Position</h2>\n<p dir=\"ltr\">Rich Ivry’s Cognition and Action Lab is looking for an undergraduate research assistant for a data visualization project. This project requires fluency with Python and they are giving special priority to students who are pursuing a major in cognitive and/or computer science. See the <a href=\"https://drive.google.com/open?id=0B-gDXENcUsFoNFB6X1lwV09PUEZ1VXZ0M1E5X20za0JnNmxn\" target=\"_blank\">attached flyer</a> which outlines the project along with a description of student responsibilities. </p>\n<p> </p>\n<p dir=\"ltr\">Special priority will be given to the students with the following characteristics: </p>\n<ul><li>\n<p dir=\"ltr\">Fluency with Python programming</p>\n</li><li>\n<p dir=\"ltr\">Major in cognitive and/or computer science</p>\n</li><li>\n<p dir=\"ltr\">Interest in neuroimaging techniques</p>\n</li><li>\n<p dir=\"ltr\">Ability to devote a minimum of 10 hours per week for at least 6 months to the project</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">If interested, please contact Maedbh King at <a href=\"mailto:maedbhking&#64;berkeley.edu\" target=\"_blank\">maedbhking&#64;berkeley.edu</a> and use the subject line “Interactive Visualization Project”. </p>\n<p></p>\n#pin", "created": "2018-01-19T19:05:17Z", "subject": "1.19.2018 Undergraduate Announcements", "uid": "hz4ud741s6s1gn"}, {"anon": "no", "content": "<p></p><div>Dear Students,</div>\n<div></div>\n<div>Welcome back!! Hope your Spring 2018 has gotten off to a great start. It&#39;s going to be a great semester!</div>\n<div></div>\n<div><img src=\"http://astronomyonline.org/Science/Images/MathCartoons1.gif\" alt=\"\" width=\"363\" height=\"361\" /></div>\n<h2>Help the EECS Department &amp; Win Amazon Gift Cards!</h2>\n<p dir=\"ltr\">This is a reminder to please complete the 2017-18 EECS Undergraduate Survey! The deadline to submit responses is Monday, January 22.</p>\n<p> </p>\n<p dir=\"ltr\">This is the only big survey the department does each year, and your thoughts will reach staff and faculty as survey results will be used to help improve the EECS department and community!</p>\n<p> </p>\n<p dir=\"ltr\">Please fill out the survey here, if you haven&#39;t already: <a href=\"https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5\" target=\"_blank\">https://berkeley.qualtrics.com/jfe/form/SV_dnyRdgjb0G1lJC5</a></p>\n<p> </p>\n<p dir=\"ltr\">Your response is completely anonymous, so we encourage you to respond openly and honestly.</p>\n<p> </p>\n<p dir=\"ltr\">You can also opt into a drawing to win one of fifteen (15) $10 Amazon gift cards once you complete the survey!</p>\n<h2>2017 Undergraduate Student CRA Survey </h2>\n<p dir=\"ltr\">The Computing Research Association (CRA) is interested in career development among students in computing fields. They would like to hear about your experiences as a student, as well as your plans for the future. To that end, I encourage you to complete their brief survey, which will take no more than 20 minutes to complete.</p>\n<p dir=\"ltr\">Should you decide to complete the survey, you will be entered into a raffle for a $100 gift card to Amazon! This survey will close January 25, 2018 at 11:59 PM ET.</p>\n<p dir=\"ltr\">If you are interested in completing the survey, please click the link below, or copy and</p>\n<p dir=\"ltr\">paste the URL into your internet browser:</p>\n<p dir=\"ltr\"><a href=\"https://cerp.co1.qualtrics.com/jfe/form/SV_3UH7q6TmdZ8YRPD\" target=\"_blank\">https://cerp.co1.qualtrics.com/jfe/form/SV_3UH7q6TmdZ8YRPD</a></p>\n<p dir=\"ltr\">The survey is being conducted by the CRA’s Center for Evaluating the Research Pipeline</p>\n<p dir=\"ltr\">(CERP). For more information on CERP, please visit their website: <a href=\"http://cra.org/cerp/\" target=\"_blank\">http://cra.org/cerp/</a>.</p>\n<h2>SF STEM Career Day - Request for volunteers</h2>\n<p dir=\"ltr\">SEP is coordinating an the 4th SF STEM Career Day for high school students from San Francisco&#39;s public schools, to be held at Mission Bay on Wednesday, March 7th, 2018.  </p>\n<p dir=\"ltr\">This event will bring approximately 100 students from several SFUSD high schools, primarily in the southeast sector of the city, to Mission Bay for an all-day event focusing on STEM Careers. It will be an opportunity for SFUSD 10th, 11th and 12th graders to attend science tours/explorations at STEM focused worksites that will provide them with first-hand experience of the work of scientists and engineers, and to meet informally with a wide range of STEM professionals at a speed networking lunch. </p>\n<p dir=\"ltr\">As part of this day, we are recruiting STEM Ambassadors to serve as near peer mentors to the high school students, helping the SFUSD students bridge the path to college and ultimately career. STEM Ambassadors will accompany the high school students to the STEM worksite tours and during the speed networking lunch. </p>\n<p> </p>\n<p dir=\"ltr\">We believe the STEM Ambassadors will play a very important role during the day.  While closer in age to the participating high school students, their having already navigated the transition to higher education and decided to pursue a STEM career will help the younger students realize that a similar path is within their reach. Because of their additional experience and maturity, they will also be well suited to help nucleate questions and conversations with at the tour sites and with the STEM mentors.</p>\n<p> </p>\n<p dir=\"ltr\">Volunteers will join the students on an interactive tour at or nearby Mission Bay, engage in informal conversations with the students about their own interests in science, their educational pathway and careers goals, at the tours and in conversations over lunch. Your experiences will be of great interest to high school students who are eager to learn what diverse options in STEM fields are open to them! This kind of informal interaction with students can be of enormous importance to them at this early stage.</p>\n<p> </p>\n<p dir=\"ltr\">We encourage grad students, post-docs, lab researchers, and others to help in this effort and share with the students!</p>\n<p> </p>\n<p dir=\"ltr\">Interested? Below is a link for you to register to participate, for all or part of the day:</p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://tiny.ucsf.edu/Ambassador2018UCSF\" target=\"_blank\">http://tiny.ucsf.edu/Ambassador2018UCSF</a></p>\n<p> </p>\n<p dir=\"ltr\">Please contact <a href=\"mailto:Jennifer.Kaelin&#64;ucsf.edu\" target=\"_blank\">Jennifer.Kaelin&#64;ucsf.edu</a> if you have any questions. We hope to hear from you and look forward to your participation in this exciting day!</p>\n<h2>Research Opportunity </h2>\n<p dir=\"ltr\">Are you interested in machine learning, computer vision, or natural language processing (NLP)? We (Prof. Jitendra Malik and Ke Li) are looking for 2-3 motivated students to get involved in exciting research projects starting this semester. This counts as CS199 course credit. </p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Applicants must have a good GPA in technical courses (3.8 or above) and be willing to commit at least 12 hours per week. Interested students may apply at <a href=\"https://goo.gl/forms/0esiwxG6NmmmLsAY2\" target=\"_blank\">https://goo.gl/forms/0esiwxG6NmmmLsAY2</a>. </p>\n<h2><a href=\"https://berkeley.joinhandshake.com/career_fairs/3601/student_preview\" target=\"_blank\">2018 Spring Career Fair</a></h2>\n<p dir=\"ltr\">Join us at UC Berkeley&#39;s largest career fair of the semester on January 24 &amp; 25!  If you&#39;re hoping to land a full-time job after graduating or an internship this coming summer, don&#39;t miss this event!  </p>\n<p> </p>\n<p dir=\"ltr\">Recruiters from nearly 200 companies across diverse industries are eager to share information about their entry-level career and internship positions.  *NEW* Tech opportunities are represented at both days of this fair.</p>\n<ul><li>\n<p dir=\"ltr\">Wednesday, Jan 24th, 11am to 4pm &#64; RSF — Engineering, Science, &amp; Tech Opportunities</p>\n</li><li><ul><li>\n<p dir=\"ltr\">Amazon/A9/Lab126, Adobe, AppDynamics, Bloomberg R&amp;D, HERE Technologies, Intel, IXL Learning, Marvell Semiconductor, Microsoft, Oracle, Pivotal, Roche, Sandia National Labs, SpaceX, Texas Instruments, US Navy, Yelp, and many more!</p>\n</li></ul>\n</li></ul>\n<ul><li>\n<p dir=\"ltr\">Thursday, Jan 25th, 11am to 4pm &#64; RSF — Business, Public Service, &amp; Tech Opportunities</p>\n</li><li><ul><li>\n<p dir=\"ltr\">Bank of the West, California State Auditor, Chewy, Enterprise, Fisher Investments, FTI Consulting, Galileo Learning, JusticeCorps, Loeb.NYC, Ma Labs, Macy&#39;s, Marvell Semiconductor, Matsui Center, Oracle, Overstock.com, Seneca, Symantec, Teach for America, Uber - Advanced Technologies Group, US Marines, Visa, Western Digital, ZS Associates, &amp; many more!</p>\n</li></ul>\n</li></ul>\n<p dir=\"ltr\">►Preview the entire employer directory in <a href=\"https://berkeley.joinhandshake.com/career_fairs/3601/student_preview\" target=\"_blank\">Handshake</a> (Tip: use the &#34;Career Fair Sessions&#34; search option to see who is coming each day).  </p>\n<p> </p>\n<p dir=\"ltr\">►Add the event to your <a href=\"https://www.facebook.com/events/167081680730654/\" target=\"_blank\">Facebook Calendar</a>!  </p>\n<p> </p>\n<p dir=\"ltr\">Registration is not required.  Currently enrolled Cal students and <a href=\"https://career.berkeley.edu/Alumni/AlumniAdv\" target=\"_blank\">Alumni Advantage</a> members only; recruiting all majors and class-levels! </p>\n<h2>Science of Software (SoS) Research Experience for Undergraduates at NC State University - Summer 2018</h2>\n<p dir=\"ltr\">Application Deadline: February 9th, 2018</p>\n<p> </p>\n<p dir=\"ltr\">The <a href=\"http://reu.csc.ncsu.edu/\" target=\"_blank\">Science of Software REU Site at NC State University</a> immerses a diverse group of undergraduates in a vibrant research community working on data science and software engineering. Research projects include visualization and data manipulation in virtual reality, model-based reasoning, human aspects (e.g., eye tracking data), bug fixing, software analytics which is a cross between software and data mining methods, and software engineering education.  The REU will run from Tuesday, May 29th to Friday, August 3rd, 2018.</p>\n<p dir=\"ltr\">Students will work beside research faculty to gain hands-on experience with data science skills: machine learning, data engineering, statistics, and studying developer behavior through observation, interviews, surveys, biometrics, and data collection. REU students present their work at an undergraduate research competition, develop videos to convey their research to K-12 students, and are encouraged to submit their technical papers as peer-reviewed publications.</p>\n<p> </p>\n<p dir=\"ltr\">Website: <a href=\"http://reu.csc.ncsu.edu/\" target=\"_blank\">http://reu.csc.ncsu.edu/</a></p>\n<p dir=\"ltr\">Application: <a href=\"https://goo.gl/forms/Oho2Ntn9gF71YX943\" target=\"_blank\">https://goo.gl/forms/Oho2Ntn9gF71YX943</a> </p>\n<h2>Center for Human-Compatible AI Internship</h2>\n<p dir=\"ltr\">The Center for Human-Compatible AI (CHAI) has opened applications for paid research internships! This is a great opportunity to get research experience and learn about the growing field of AI safety. It helps to have prior machine learning experience but is not required. For more details see <a href=\"http://humancompatible.ai/jobs#internship\" target=\"_blank\">here</a>.</p>\n<h2>SF Funded Research Experience for Undergraduates (REU) at George Mason University</h2>\n<p dir=\"ltr\">Undergraduate students can participate in a paid data science research program next Summer at George Mason University.</p>\n<p> </p>\n<p dir=\"ltr\">REU Site: Undergraduate Research in Educational Data Mining</p>\n<p dir=\"ltr\">website: <a href=\"http://cs.gmu.edu/~reu\" target=\"_blank\">http://cs.gmu.edu/~reu</a></p>\n<p dir=\"ltr\">application deadline: February 15th, 2018</p>\n<p> </p>\n<p dir=\"ltr\">PI: Dr. Huzefa Rangwala</p>\n<p dir=\"ltr\">Co-PI: Dr. Mark Snyder</p>\n<p> </p>\n<p dir=\"ltr\">Field of research: Computer Science; Sub-Field: Educational Data Mining, Machine Learning,  Visualization, Learning Technologies</p>\n<p> </p>\n<p dir=\"ltr\">Point of contact: Dr. Mark Snyder, <a target=\"_blank\">703-993-5624</a>, <a href=\"mailto:msnyde14&#64;gmu.edu\" target=\"_blank\">msnyde14&#64;gmu.edu</a></p>\n<p> </p>\n<p dir=\"ltr\">Project Description</p>\n<p dir=\"ltr\">The primary goal of this interdisciplinary REU Site program is to expose ten high quality undergraduate students to advanced topics in analytics, data mining, and visualization techniques as applied to data from the education domain. Students will participate in projects with the central theme of improving instructional technology design, enhancing academic curricula and modeling learning experiences. From an analytical methodology standpoint, projects will investigate approaches to model the dynamic knowledge state of a student throughout a sequential academic program. Projects will also model the learning behavior of younger students in informal settings by analyzing the server logs of the Scratch framework or Online Engineering Communities. Projects will also model the learning habits of practitioners while interacting with online programming environments.</p>\n<h2>Student Tech Services Now Hiring!</h2>\n<p dir=\"ltr\">Student Tech Services is now hiring! Jobs for the summer and 2018/19 school year are now open at <a href=\"https://studenttech.berkeley.edu/student-jobs\" target=\"_blank\">studenttech.berkeley.edu/student-jobs</a></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">·  A variety of positions with competitive pay! ($15-22.75/hr)</p>\n<p dir=\"ltr\">·  Flexible schedules in a student friendly office</p>\n<p dir=\"ltr\">·  On the job training, no experience required for many of our positions </p>\n<p> </p>\n<p dir=\"ltr\">Join us for our Student IT Job Fair on Monday, February 5th for a chance to talk with our current staff and get help with your resume! <a href=\"http://bit.ly/IT_Job_Fair\" target=\"_blank\">http://bit.ly/IT_Job_Fair</a></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Apply by 5pm, Friday February 9th!</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\"><a href=\"https://www.youtube.com/watch?v=KxiaweXB2Vo\" target=\"_blank\">Student Tech Services Promo Video</a></p>\n<h2>SUMMER MINOR IN JOURNALISM</h2>\n<p dir=\"ltr\">Hello Undergraduate Students!</p>\n<p> </p>\n<p dir=\"ltr\">Interested in improving your communications skills? Come join our popular  Summer Minor in Journalism. UC Berkeley School of Journalism now offers a minor in digital journalism that is open to students of all majors and can be completed in one summer. Get hands-on instruction in news writing, video, multimedia, photography and social media.  <a href=\"https://journalism.berkeley.edu/special-programs/summer-minor/\" target=\"_blank\">See our site for more information</a>. Registration opens February 1, 2018 and classes fill fast! Students who enroll this summer and complete the minor in one summer or two will receive a $2000 scholarship. </p>\n<p> </p>\n<p dir=\"ltr\">We look forward to seeing you this summer!</p>\n<h2>Berkeley MFE Firm Night</h2>\n<p dir=\"ltr\">On behalf of the Berkeley Master of Financial Engineering (MFE) Program, we invite you to participate in the MFE Firm Night &amp; Career Fair on Thursday, January 25, 2018 from 5 PM - 8 PM in the Spieker Forum of Chou Hall at the Haas School of Business. </p>\n<p> </p>\n<p dir=\"ltr\">This event is for graduating students seeking full-time opportunities.</p>\n<p dir=\"ltr\">Companies coming to the event have had long and successful relationships recruiting from the Master of Financial Engineering program and other programs on campus (statistics, mathematics, engineering, information, computer science, etc.).  All Master&#39;s and PhD students with an interest in quantitative finance, data science, fintech start ups, are encouraged to attend and network. Please bring several copies of your resumes.  Formal business attire is required.  Refreshments will be provided; logistical details to follow after registration. </p>\n<p dir=\"ltr\">REGISTER <a href=\"https://goo.gl/forms/NoW8svGj2zPlXcf92\" target=\"_blank\">HERE</a>.  </p>\n<p dir=\"ltr\">Date: Thursday, January 25, 2018</p>\n<p dir=\"ltr\">Time: 5 - 8 PM PST</p>\n<p dir=\"ltr\">Location: Spieker Forum, Chou Hall, Haas School of Business (<a href=\"https://maps.google.com/?q=2220&#43;Piedmont&#43;Avenue,&#43;Berkeley&amp;entry=gmail&amp;source=g\" target=\"_blank\">2220 Piedmont Avenue, Berkeley</a>)</p>\n<p> </p>\n<p dir=\"ltr\">Please email <a href=\"mailto:jchin&#64;haas.berkeley.edu\" target=\"_blank\">jchin&#64;haas.berkeley.edu</a> directly with any questions.</p>\n<h2>Be A Scientist: Inspire 7th graders to discover their inner scientist!</h2>\n<p dir=\"ltr\"><a href=\"http://www.crscience.org/volunteers/BeAScientist\" target=\"_blank\">www.crscience.org/volunteers/BeAScientist</a></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">We invite UC Berkeley graduate students, post-docs, and motivated 3rd/4th year undergrads to take part in Be A Scientist, an exciting science outreach program in Berkeley middle schools! The upcoming semester is as follows:</p>\n<ul><li>\n<p dir=\"ltr\">Session 3 Spring 2018 will take place at King Middle School, February 1st - March 15th (with a one week gap Feb. 15/16 for President&#39;s Day)</p>\n</li><li>\n<p dir=\"ltr\">Session 4 Spring 2018 will take place at Longfellow Middle School, February 27th - April 17th, with a two week gap (March 27/April 3) for both UCB and BUSD Spring Breaks</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\"> As a volunteer scientist mentor, you will guide 7th graders through the process of designing and conducting their own scientific investigations in class over a 6-week period. This is a wonderful opportunity for you to serve as a STEM role model while developing your communication skills and gaining hands-on experience in important science outreach.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Details:</p>\n<ul><li>\n<p dir=\"ltr\">Mentors must commit to one mandatory 2-hr Training Session: On-campus trainings are offered in the weeks before the start of each session. Training dates/times/locations TBA</p>\n</li><li>\n<p dir=\"ltr\">Commit to attend one school lab period each week for the 6-week program (schedule program dates <a href=\"http://www.crscience.org/volunteers/BeAScientist\" target=\"_blank\">here</a> and attached flyer).</p>\n</li><li>\n<p dir=\"ltr\">Guide 4-6 student mentees through the process of developing a testable question, designing an appropriate experiment, and gathering and analyzing data. Each student in your group will have the opportunity to choose an independent scientific question based on their own interests.</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Please carefully read over the details provided in the attached flyer and on our website. <a href=\"http://www.crscience.org/volunteers/BeAScientistSignup\" target=\"_blank\">Sign up</a> as a mentor to make an impact on future scientists, engineers, and critical thinkers!</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">To learn more, visit: <a href=\"http://www.crscience.org/volunteers/BeAScientist\" target=\"_blank\">www.crscience.org/volunteers/BeAScientist</a></p>\n<p dir=\"ltr\">Questions? Contact Darlene at <a href=\"mailto:BASprogram&#64;crscience.org\" target=\"_blank\">BASprogram&#64;crscience.org</a></p>\n<h2>Social Media Marketing Intern at the School of Information</h2>\n<p dir=\"ltr\">The job can be found via Workstudy, job # <a target=\"_blank\">8732774341</a>; or Handshake job # 1273193. They can also email <a href=\"mailto:cappert&#64;ischool.berkeley.edu\" target=\"_blank\">cappert&#64;ischool.berkeley.edu</a> directly.</p>\n<p> </p>\n<p dir=\"ltr\">Social Media Marketing Intern:</p>\n<p dir=\"ltr\">Responsible for helping to devise and implement a digital marketing and social media strategy across various platforms in order to maximize the visibility and awareness of the School of Information’s collaborations, programs, and research. Works closely with the Digital Communications Strategist.</p>\n<p> </p>\n<p dir=\"ltr\">Objectives:</p>\n<p dir=\"ltr\">Use social media storytelling and digital marketing strategy to increase brand awareness and recognition:</p>\n<p dir=\"ltr\">- Across the information industry</p>\n<p dir=\"ltr\">- Among industry partners  </p>\n<p dir=\"ltr\">Assist with digital media campaigns to:</p>\n<p dir=\"ltr\">- Showcase projects and work by current students, accomplishments of alumni, and faculty research and projects</p>\n<p dir=\"ltr\">-Increase enrollment/applications to recruit top quality students for the different degree programs and courses</p>\n<p dir=\"ltr\">-Engage current students, alumni, and employers to foster an online community atmosphere</p>\n<p> </p>\n<p dir=\"ltr\">Main Responsibilities:</p>\n<ul><li>\n<p dir=\"ltr\">Create/draft content for social media channels</p>\n</li><li>\n<p dir=\"ltr\">Monitor performance and metrics of digital marketing campaigns and website usage</p>\n</li><li>\n<p dir=\"ltr\">Manage an editorial schedule/calendar of digital activity</p>\n</li><li>\n<p dir=\"ltr\">Help develop and execute a digital strategy incorporating digital editorial and marketing plans to ensure the School of Information is at the leading edge of online communication</p>\n</li><li>\n<p dir=\"ltr\">Help build a strong digital network of prospective students, alumni, employers, and partners on campus.</p>\n</li><li>\n<p dir=\"ltr\">Stay current on developments in social media</p>\n</li><li>\n<p dir=\"ltr\">Initiate future projects utilizing technology and social media</p>\n</li><li>\n<p dir=\"ltr\">Assist with I School events, advertisements, and social media related to events</p>\n</li><li>\n<p dir=\"ltr\">Other duties as needed</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Requirements:</p>\n<ul><li>\n<p dir=\"ltr\">Available throughout academic year (Sept-May)</p>\n</li><li>\n<p dir=\"ltr\">Experience with social media, specifically Twitter, Instagram, Facebook, LinkedIn, and YouTube</p>\n</li><li>\n<p dir=\"ltr\">Experience gathering and analyzing metrics from online sources and Excel</p>\n</li><li>\n<p dir=\"ltr\">Organized, detail-oriented with an ability to multi-task and is excited about social media!</p>\n</li><li>\n<p dir=\"ltr\">Driven, self-motivated, and independent. Ability to complete tasks with minimal supervision.</p>\n</li><li>\n<p dir=\"ltr\">Demonstrates a positive, can-do attitude with a passion for making things happen.</p>\n</li><li>\n<p dir=\"ltr\">Excellent task management and problem-solving skills.</p>\n</li><li>\n<p dir=\"ltr\">Up to date on latest social media trends and innovations.</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Preferred Qualifications:</p>\n<ul><li>\n<p dir=\"ltr\">Excellent writer with experience writing news articles and short copy for web</p>\n</li><li>\n<p dir=\"ltr\">Graphic design skills</p>\n</li><li>\n<p dir=\"ltr\">Strong interest in branding and brand development</p>\n</li><li>\n<p dir=\"ltr\">Cursory understanding of and interest in topics studied at the I School</p>\n</li><li>\n<p dir=\"ltr\">Past experience managing social media for a brand, or demonstrated ability use social media to engage or influence</p>\n</li></ul>\n<h2>Research Assistant Position</h2>\n<p dir=\"ltr\">Rich Ivry’s Cognition and Action Lab is looking for an undergraduate research assistant for a data visualization project. This project requires fluency with Python and they are giving special priority to students who are pursuing a major in cognitive and/or computer science. See the <a href=\"https://drive.google.com/open?id=0B-gDXENcUsFoNFB6X1lwV09PUEZ1VXZ0M1E5X20za0JnNmxn\" target=\"_blank\">attached flyer</a> which outlines the project along with a description of student responsibilities. </p>\n<p> </p>\n<p dir=\"ltr\">Special priority will be given to the students with the following characteristics: </p>\n<ul><li>\n<p dir=\"ltr\">Fluency with Python programming</p>\n</li><li>\n<p dir=\"ltr\">Major in cognitive and/or computer science</p>\n</li><li>\n<p dir=\"ltr\">Interest in neuroimaging techniques</p>\n</li><li>\n<p dir=\"ltr\">Ability to devote a minimum of 10 hours per week for at least 6 months to the project</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">If interested, please contact Maedbh King at <a href=\"mailto:maedbhking&#64;berkeley.edu\" target=\"_blank\">maedbhking&#64;berkeley.edu</a> and use the subject line “Interactive Visualization Project”. </p>\n<p></p>", "created": "2018-01-19T19:05:08Z", "subject": "1.19.2018 Undergraduate Announcements", "uid": "hz4ud741s6s1gn"}], "i_edits": [], "id": "jcmaonxf9tz7r", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 6095, "num_favorites": 2, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654550312563, "tag_good": [], "tag_good_arr": [], "tags": ["announcements", "instructor-note"], "type": "note", "unique_views": 974}