{"bookmarked": 2, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "jd6alczhn3z4sy", "type": "create", "uid": "hz4ud741s6s1gn", "when": "2018-02-02T18:57:58Z"}, {"anon": "no", "data": "jd6alfhgbom4vn", "type": "update", "uid": "hz4ud741s6s1gn", "when": "2018-02-02T18:58:01Z"}, {"anon": "no", "data": "jdgfymjvcwz61d", "type": "update", "uid": "hz4ud741s6s1gn", "when": "2018-02-09T21:25:56Z"}], "children": [], "config": {}, "created": "2018-02-02T18:57:58Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements"], "history": [{"anon": "no", "content": "<p></p><h2><img src=\"https://mail.google.com/mail/u/0/?ui=2&amp;ik=00e01425ff&amp;view=fimg&amp;th=16157dfa45593faa&amp;attid=0.1&amp;disp=emb&amp;realattid=ii_16157dfa45593faa&amp;attbid=ANGjdJ9JzxVBiHokWk1_IpKQXlqvVI3scRKvQO34kzD2ZJd5dteOhbExz313arb6ZzthKoU_uHB_L4dmbXEss600kbTk346zX5c3C0Wiv9u6vqzONfO3gPWL3viPj5g&amp;sz=s0-l75&amp;ats=1517597730243&amp;rm=16157dfa45593faa&amp;zw\" alt=\"Inline image 1\" width=\"412\" height=\"213\" /></h2>\n<h2>Upcoming ESS Events</h2>\n<p dir=\"ltr\">Networking &amp; Etiquette Dinner</p>\n<p dir=\"ltr\">Tuesday, February 13, 6-8 p.m., Faculty Club. </p>\n<p dir=\"ltr\">Have you ever sat down to a formal meal and wondered, “What are all of these forks for?” Or been networking and thought, “Is this an appropriate topic to raise?” Then our <a href=\"https://engineering.berkeley.edu/student-life/student-leadership/networking-and-professional-etiquette-dinner\">networking and professional etiquette dinner</a> will put you at ease. Presented by a certified professional etiquette trainer, this event is a fun, non-threatening way to learn business etiquette skills while enjoying a three course meal! Cost: $15, <a href=\"https://www.regonline.com/registration/Checkin.aspx?EventID=2158323\">register online</a>.</p>\n<p> </p>\n<p dir=\"ltr\">LinkedIn Workshop</p>\n<p dir=\"ltr\">Thursday, February 8, 1-2 p.m., 240 Bechtel. </p>\n<p dir=\"ltr\">Join the Center for Access to Engineering Excellence as they give tips of how to take advantage of your LinkedIn profile and get the most out of your connections. <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSc2tgs4cYFh712iR-lBpVpMvIeo3E0CpBUHz-iRw7XuUYx3ow/viewform?usp=sf_link\">RSVP online!</a></p>\n<p> </p>\n<p dir=\"ltr\">Cupcakes &amp; Headshots</p>\n<p dir=\"ltr\">Thursday, February 8, 2-4 p.m., 227 Bechtel. </p>\n<p dir=\"ltr\">Free cupcakes and professional headshots for your professional, online profiles. Selfies are not acceptable for sites like LinkedIn, so let us help you spruce up your profile to ensure that you make a great impression! <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdlr7qsz2VyDAtPj5z_BRh4cxzg0_0cX1LEZng1NlECI0Ayjg/viewform\">RSVP online</a>.</p>\n<h2>Key Research Deadlines</h2>\n<p dir=\"ltr\">The undergraduate newsletter for late January is linked <a href=\"http://goo.gl/6pz2Nq\">here</a>.   Right now, late January, is THE time for deadlines for undergraduate research programs.  A few have passed, but most have not, such as Haas Scholars ($13,800 to conduct research in ANY major), SURF ($4,000-$6000 to carry out research), and many others. If you read the newsletter and make a plan soon, you can catch some really great opportunities! </p>\n<p> </p>\n<p dir=\"ltr\">The newsletter actually goes out weekly, but it is sent to advisors (who forwarded it to you) monthly.  If you want to make sure to not miss out on any late-breaking news, consider signing up for the listserv <a href=\"https://docs.google.com/a/berkeley.edu/forms/d/e/1FAIpQLSd-ScH8kJETreNOv3GHUzch3VimUhAQpFDKoIVC1b7Hn_IABg/viewform\">here.</a></p>\n<p> </p>\n<p dir=\"ltr\">Also, make sure to browse through the pages of  the undergraduate research web site, <a href=\"http://research.berkeley.edu/\">http://research.berkeley.edu</a>.  On the web site, we have a database of on and off-campus research programs (most with February-March deadlines), peer advising hours, many documents with advice on how to connect to professors, a calendar of events such as workshops and info sessions, and much more.  </p>\n<p> </p>\n<p dir=\"ltr\">Also, here are quick tables summarizing the remaining spring deadlines <a href=\"https://drive.google.com/open?id=1ph4vbsSJ13FbMPSsNh3Bk4NnCvkHXAeM\">for STEM (Science, Technology, Engineering and Math) students</a>  and for <a href=\"https://drive.google.com/open?id=1g9c0G9uGBzjZxLPG9tS5pg3A_7bEDCXl\">arts, humanities, and social science students.  </a></p>\n<h2>Institute of Governmental Studies Spring Break Program</h2>\n<p dir=\"ltr\">How do you take a desire to serve others, to be a change-maker, to have an impact on the issues you care about, and transform that into a meaningful public service career? <a href=\"https://igs.berkeley.edu/student-learning/democracy-camp\">Democracy Camp</a> is a new program designed for Cal students interested in enhancing our democracy through public service.</p>\n<p> </p>\n<p dir=\"ltr\">Over Cal Spring Break (March 26–29, 2018), students will gain exposure to different facets of a public service career: legislative paths, community organizations, local, state and federal  government,  and philanthropy.  Participants will learn from presenters about the opportunities available in these fields and will network to create a cohort on campus—and beyond—to support their career goals. Additionally, there will be a trip to Sacramento and skill-building modules that focus on practical and tangible takeaways. All meals and course materials are included.</p>\n<p> </p>\n<p dir=\"ltr\">Democracy Camp will take place over Cal Spring Break, from Monday, March 26–Thursday, March 29, 2018. Participants are expected to attend ALL program sessions during this time. Please do not apply if you cannot attend the full program.</p>\n<p> </p>\n<p dir=\"ltr\">All students currently enrolled at UC Berkeley are encouraged to apply!</p>\n<p> </p>\n<p dir=\"ltr\">Applications for the 2018 Democracy Camp are now being accepted! The application form can be accessed at this link: <a href=\"https://docs.google.com/forms/d/13Om998z6sS40yQl34Pn6e_B8PnbU0-lri2GzSagP8rY/edit?usp=sharing\">Democracy Camp 2018 Application</a>.</p>\n<p> </p>\n<p dir=\"ltr\">The deadline for applications is Friday February 9, 2018 (by midnight).</p>\n<p> </p>\n<p dir=\"ltr\">If you have any questions about the program, please contact: Charlotte Cowden <a href=\"mailto:ccowden&#64;berkeley.edu\">ccowden&#64;berkeley.edu</a> with Democracy Camp in the subject line.</p>\n<h2>Physiologic Informatics Research Opportunity at UCSF: Students and Recent Grads</h2>\n<p dir=\"ltr\">Join a team of physicians and engineers developing clinical decision support tools to reduce preventable deaths caused by sepsis and patient discharge errors. This NIH funded project involves predictive analysis of EHR (electronic health record) data through machine learning. Students interested in a long-term, self-directed research opportunity in preparation for medical or graduate school, or for an undergraduate thesis, are encouraged to apply for Spring 2018. We also have full-time opportunities, effective immediately, for recent graduates, such as those taking a gap year prior to graduate or medical school.</p>\n<p> </p>\n<p dir=\"ltr\">We have clinical, regulatory, statistical algorithm development, programming, and peer-review manuscript writing opportunities available. Students must be able to make a substantial commitment to this position during the spring semester and work full-time on this project throughout the summer. Recent graduates must be able to work full time for a minimum of 6 months.</p>\n<p> </p>\n<p dir=\"ltr\">If this sounds interesting, apply here (this takes less than 10 minutes!):<a href=\"https://phys-inf.typeform.com/to/zh9Yd9\"> https://phys-inf.typeform.com/to/zh9Yd9</a>. We will be accepting applications until the positions are filled, so apply early!</p>\n<p> </p>\n<p dir=\"ltr\">For further information, please email Prof. Chris Barton (<a href=\"mailto:chris.barton&#64;emergency.ucsf.edu\">chris.barton&#64;emergency.ucsf.edu</a>).</p>\n<h2>Spring Poster Session</h2>\n<p dir=\"ltr\">Engineering Student Services is pleased to present the Spring Undergraduate Research Symposium Poster Session, Monday, April 30, Noon-2 p.m., HMMB Lobby. Undergraduate students (ranging from freshmen to seniors) will be presenting their research on a wide range of projects across the College of Engineering. </p>\n<p dir=\"ltr\">How to Participate: The poster session is open to all College of Engineering undergraduates working with Engineering Faculty! <a href=\"https://berkeley.us16.list-manage.com/track/click?u=e87fa971126ebb54207b9e016&amp;id=bb84679003&amp;e=2abc3f37e2\">Submission deadline</a> April 15. Winning posters will receive cash prizes! </p>\n<h2>Ben Carlson Memorial Scholarship</h2>\n<p dir=\"ltr\">2018 Ben Carlson Memorial Scholarship is available for a current high school senior or an undergraduate student. The award amount of the scholarship is $10,000. Scholarship deadline: March 1. Applicants can get more information here: <a href=\"https://berkeley.us16.list-manage.com/track/click?u=e87fa971126ebb54207b9e016&amp;id=c36effa9e4&amp;e=2abc3f37e2\">Ben Carlson Memorial Scholarship</a></p>\n<h2>REU Opportunity</h2>\n<p dir=\"ltr\">The NSF&#39;s <a href=\"http://strobe.colorado.edu/\">STROBE </a>Center has Research Opportunities for Undergraduate Students available at UC Berkeley!</p>\n<p> </p>\n<p dir=\"ltr\">STROBE is a collaborative research project between UC Berkeley, CU Boulder, UCLA, and other schools focused on the development of imaging science.  There are research positions available at Berkeley in 3-5 labs in different fields focused on different aspects of imaging science research.  </p>\n<p> </p>\n<p dir=\"ltr\">STROBES summer opportunities include research experience, mentorship opportunities with graduate students and professors, professional development events, and extra scientific learning seminars and experiences.  The summer concludes with a voluntary symposium where students are encouraged to present their research and summer experience with other STROBE students. </p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://strobe.colorado.edu/\">STROBE </a>PIs and labs at Berkeley are working on Imaging science problems, ideas, and theories.     </p>\n<p> </p>\n<p dir=\"ltr\">Research opportunities are for middle to upper level experience undergraduates and those who are able to dedicate 8-10 weeks of their summer to the program. Competitive compensation and a housing stipend is provided.  Application deadline is February 16th, 2018.</p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://strobe.colorado.edu/education/research-experience-undergraduates\">Link to the Research Opportunity webpage. </a></p>\n<p> </p>\n<p dir=\"ltr\">Questions and comments can be email to jwoodcock&#64;berkeley.edu</p>\n<h2>BGESS and BESSA Anniversary Symposoium</h2>\n<p dir=\"ltr\">On behalf of the Celebration of Diversity in Engineering: BESSA &amp; BGESS 50th and 30th Year Anniversaries, invites you to the <a href=\"https://www.eventbrite.com/e/bgess30bessa50-afternoon-symposium-tickets-42258037929\">Afternoon Symposium</a> on Saturday, February 10th, 2018.  We are bringing in distinguished alumni to speak on the Engineering Career Panel, which will take place in Sibley Auditorium, Bechtel Engineering Center from 3 to 5PM. The audience will be composed of UC Berkeley alumni and current students as well as and prospective students. </p>\n<p> </p>\n<p dir=\"ltr\">Please sign up here: <a href=\"https://bgess-bessa-symposium.eventbrite.com/\">https://bgess-bessa-symposium.eventbrite.com</a></p>\n<h2>Register, Present, Attend! Midwest Regional SACNAS Research Conference at UChicago April 28th!</h2>\n<p dir=\"ltr\">The SACNAS Chapter at the University of Chicago is looking for STEM students to attend and present their research at the Midwest Regional SACNAS Conference on Saturday, April 28th, 2018. <a href=\"http://mx.technolutions.net/mpss/c/2QA/jM0HAA/t.2ek/ayd1914lQgWy19d5PBNU-Q/h8/drR8Bu9HbCqdmvutB3a5MtbEnEnUVin62BMUMXVWKAM-3D\">SACNAS</a> is a national organization dedicated to fostering diversity in STEM fields. The theme for the regional conference is Progress on All Fronts: Personal, Professional, and Social Advancement, which will showcase cutting edge science and technology research, as well as new efforts in STEM diversification and inclusion. </p>\n<p> </p>\n<p dir=\"ltr\">Presenting your research, either orally or through a poster, is an excellent way to hone your public speaking and communication skills, strengthen your CV, and initiate conversations with professionals and potential employers. Even if you choose not to present your research, everyone is welcome to attend numerous professional development panels and workshops. However, this is an opportunity to advance your academic career so we strongly encourage you to submit a proposal to present at the conference. </p>\n<p> </p>\n<p dir=\"ltr\">To be considered for a presentation, please <a href=\"http://mx.technolutions.net/mpss/c/2QA/jM0HAA/t.2ek/ayd1914lQgWy19d5PBNU-Q/h9/TQq8raW4D-2FfUJzgtPOAKaSS4vIHaZJtXQhzWOCarPzO-2FoJh6G7x-2B3eqIU052UvsFjAxGVjwgzIQYOpmF1mhUAB0PNoOy27kbYG61wN9e3ZGYMueC22ZIqhwPUOUPEF-2FNPXbGb-2FiyG1Z1aN5Q9GRqxQ-3D-3D\">register here</a> and submit a 200 word abstract online by March 30th, 2018. Presenters must be current undergraduate, graduate, or post-baccalaureate students in any STEM field. If you wish to attend but not present, or, if you are ineligible to present, please <a href=\"http://mx.technolutions.net/mpss/c/2QA/jM0HAA/t.2ek/ayd1914lQgWy19d5PBNU-Q/h10/TQq8raW4D-2FfUJzgtPOAKaSS4vIHaZJtXQhzWOCarPzO-2FoJh6G7x-2B3eqIU052UvsFjAxGVjwgzIQYOpmF1mhUAB0PNoOy27kbYG61wN9e3ZGYMueC22ZIqhwPUOUPEF-2FNPXbGb-2FiyG1Z1aN5Q9GRqxQ-3D-3D\">register here.</a> </p>\n<p> </p>\n<p dir=\"ltr\">The conference is free to attend and will provide a valuable professional development opportunity for everyone. If you have questions about the conference, you should contact the UChicago SACNAS Chapter at <a href=\"http://mx.technolutions.net/mpss/c/2QA/jM0HAA/t.2ek/ayd1914lQgWy19d5PBNU-Q/h11/lwouGpt-2BjMVUfMd8VK76DhalYVJfdUAWQBMXK6us3jU-3D\">ucsacnas&#64;gmail.com</a>. Additionally, make sure to check the event on <a href=\"http://mx.technolutions.net/mpss/c/2QA/jM0HAA/t.2ek/ayd1914lQgWy19d5PBNU-Q/h12/HE2UYZIDTZxfLuJ8qHDFiKcv9QeqMGLDJ3IrF8dj2B2xwWmztjrCMwulW-2BY46bUO\">Facebook</a> for the latest updates.</p>\n<h2>AWE x WICSE Research Event</h2>\n<p dir=\"ltr\">Feb. 8, 5-7pm in 540 Cory</p>\n<p dir=\"ltr\">WICSE &#43; AWE presents: How to Break into Research. It will be a panel on how to get started in research, focusing specifically on lower classmen. There will be about 5 panelists from different areas of research willing to offer advice and share stories about their research experience.</p>\n<h2>Summer Earth Science Research Opportunity - NASA DEVELOP</h2>\n<p dir=\"ltr\">This is a great opportunity for individuals who are interested in practical applications of remote sensing and GIS, specifically in the field of Earth Science. Our projects focus on addressing local and international community concerns while utilizing NASA&#39;s Earth observations. Participants work in teams to complete rapid research projects in 10 weeks with guidance from NASA and partner science advisors. These projects demonstrate to partner organizations how NASA remote sensing imagery can be used in water resource management, disaster response, ecological forecasting, and other applications.  </p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Applicants must have excellent communication and writing skills, and be able to work in a fast-paced environment. Responsibilities include: literature review, data processing and analysis, composing of deliverables including a technical paper, presentation, and project video. DEVELOP’s projects are interdisciplinary in nature, thus applications are welcome ALL academic backgrounds.</p>\n<p dir=\"ltr\">Applicants should be able to commit up at least 20 hours and up to 29 hours per week.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Details about the internship and how to apply can be found at<a href=\"http://develop.larc.nasa.gov/\"> http://develop.larc.nasa.gov/</a>. The summer online application deadline is February 16th 2018, and the internship dates are June 4th – August 10th, 2018.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">International Students:</p>\n<p dir=\"ltr\">International students interested in working with the DEVELOP Program are eligible to apply to our Regional Locations. Acceptances for international students are conditional upon proof of a visa or approved OPT that will allow them to legally work within the U.S. Students who do not meet these requirements are not eligible to participate in the DEVELOP Program. Please see the DEVELOP website and the <a href=\"https://drive.google.com/open?id=0B-gDXENcUsFobnl3X0lGS1hwVXhXMmpjU0JmRDU5MEs1ZXNj\">attached</a> flyer for details.</p>\n<h2>Apple is coming to UC Berkeley!</h2>\n<p dir=\"ltr\">I am excited to inform you that Apple is coming to UC Berkeley for a Networking Event on Tuesday, February 6 and we’ll have ~30 engineers from the business that are looking forward to meeting interested students! Please come by the Garbarini Lounge in Bechtel Engineering Center between 10:00am-3:00pm and register via the link in the attached flyer, we hope to see you there! Details are <a href=\"https://drive.google.com/open?id=0B-gDXENcUsFoc2ctNldBSVRQU0xTbnZRTHNaZzhzcUNrVDU0\">attached</a>!</p>\n<h2>Berkeley Global Internships and Summer Abroad Applications Open!</h2>\n<p dir=\"ltr\">Berkeley Global Internships offers students the opportunity to partake in a professional internship and gain academic experience in locations around the world. New locations this year include:</p>\n<ul><li>\n<p dir=\"ltr\">Boston: internships in research and entrepreneurship</p>\n</li><li></li><li>\n<p dir=\"ltr\">Japan: internships in business and computer science</p>\n</li></ul>\n<p dir=\"ltr\">For a list of all of our locations, please go to<a href=\"http://globalinternships.berkeley.edu/\"> globalinternships.berkeley.edu</a>. Applications will close on March 2, 2018 and are accepted on a first-come, first-served basis.</p>\n<p> </p>\n<p dir=\"ltr\">Summer Abroad allows students to study abroad with Berkeley faculty. New locations this year include: </p>\n<ul><li>\n<p dir=\"ltr\">Bosnia, Croatia &amp; Serbia - Balkan Bridges: Contested Histories &amp; Shared Commitments</p>\n</li><li>\n<p dir=\"ltr\">Dublin &amp; Galway, Ireland - Irish Theater</p>\n</li><li>\n<p dir=\"ltr\">Berlin, Germany - Mathematics in Berlin</p>\n</li><li>\n<p dir=\"ltr\">Portugal - Entrepreneurship &amp; Innovation in Europe</p>\n</li><li>\n<p dir=\"ltr\">London, England - Paganism: Classical and Modern</p>\n</li></ul>\n<p dir=\"ltr\">For a list of all of our locations, please go to <a href=\"http://summerabroad.berkeley.edu/\">summerabroad.berkeley.edu</a>. Applications will close on March 9, 2018 and are accepted on a first-come, first-served basis.</p>\n<p> </p>\n<p dir=\"ltr\">Please note: you may see an uptake in students requesting to change their graduation term from Spring 2018 to Summer 2018. In order to be eligible for UC tuition rates and financial aid for these programs, applicants must be students. Graduating seniors will not be able to proceed with their application as a Berkeley student until the change is reflected in CalCentral.</p>\n<h2>Student Mentoring and Research Teams (SMART) Summer 2018 Program for UCB Undergraduate Students</h2>\n<p dir=\"ltr\">May 25 - August 3, 2018</p>\n<p dir=\"ltr\">Application Deadline: Friday, February 23, 2018, 11:59 p.m. (PST).</p>\n<p dir=\"ltr\">SMART Website and Application Materials: <a href=\"http://smart.berkeley.edu/undergraduate/\">http://smart.berkeley.edu/undergraduate/</a></p>\n<p> </p>\n<p dir=\"ltr\">2018 SMART Program Undergraduate Application Informational Meetings:</p>\n<p dir=\"ltr\">Thursday, February 8, 2018 from 1:00 to 2:00 p.m., 309 Sproul Hall; and</p>\n<p dir=\"ltr\">Wednesday, February 14, 2018 from 11:00 a.m. to 12:00 p.m., 309 Sproul Hall.</p>\n<p> </p>\n<p dir=\"ltr\">2018 SMART PROGRAM DESCRIPTION</p>\n<p dir=\"ltr\">Student Mentoring and Research Teams (SMART) is a summer program designed to encourage graduate student professional development and foster undergraduate research through mentoring. Each graduate student participant will receive a summer stipend ranging from $1,000 to $5,000; each undergraduate participant will receive a summer stipend in the amount of $3,500 for approximately 200 hours of work. (Undergraduate students should note that this stipend may affect the amount of financial aid they are eligible to receive in summer 2018.)</p>\n<p> </p>\n<p dir=\"ltr\">UNDERGRADUATE ELIGIBILITY REQUIREMENTS</p>\n<p dir=\"ltr\">To be eligible to apply for this program, you must meet the following criteria:</p>\n<p dir=\"ltr\">1) You must be a UC Berkeley undergraduate student who is currently pursuing a UC Berkeley undergraduate degree. (Please note that visiting students are not eligible to apply.)</p>\n<p dir=\"ltr\">2) You must be in good academic standing at the time of application.</p>\n<p dir=\"ltr\">3) Undergraduate students from any UC Berkeley academic department or program are eligible to apply; students who have not yet declared their majors are also eligible to apply. Students who graduated in December 2017 or will graduate in May 2018 are not eligible to apply.</p>\n<p dir=\"ltr\">4) If you applied in the past and were not selected to be a SMART mentee, you are welcome to apply again. Former SMART mentees are not eligible to apply.</p>\n<p> </p>\n<p dir=\"ltr\">SMART UNDERGRADUATE PROGRAM REQUIREMENTS</p>\n<p dir=\"ltr\">In addition to conducting research for approximately 200 hours, undergraduate student mentees will be required to attend all of the following SMART 2018 meetings:</p>\n<ul><li>\n<p dir=\"ltr\">Friday, May 25, 2018, 1-4 p.m.: SMART Program Kickoff</p>\n</li><li>\n<p dir=\"ltr\">Friday, June 1, 2018, 1-3 p.m.: Applying to Graduate School</p>\n</li><li>\n<p dir=\"ltr\">Friday, June 15, 2018, 1-3 p.m.: Meeting of the Mentees</p>\n</li><li>\n<p dir=\"ltr\">Friday, June 22, 2018, 1-3 p.m.: SMART Lunch</p>\n</li><li>\n<p dir=\"ltr\">Friday, July 6, 2018, 1-3 p.m.: Applying for Grants/Fellowships</p>\n</li><li>\n<p dir=\"ltr\">Friday, July 13, 2018, 1-3 p.m.: Workshop on Presenting Your Research at the Closing Reception</p>\n</li><li>\n<p dir=\"ltr\">Friday, July 20, 2018, 1-3 p.m.: Academic and Professional Writing</p>\n</li><li>\n<p dir=\"ltr\">Friday, August 3, 2018, 3-5 p.m.: SMART Closing Reception and Research Presentations</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">UNDERGRADUATE APPLICATION REQUIREMENTS</p>\n<p dir=\"ltr\">To complete the application, students will be asked to submit the following items: (1) an application essay, and (2) a current resume or curriculum vitae.</p>\n<p dir=\"ltr\">More detailed information about the application essay is included in the application form.</p>\n<p> </p>\n<p dir=\"ltr\">APPLICATION FORM</p>\n<p dir=\"ltr\">Information about the SMART Program and a link to the undergraduate application form are located on the SMART website at <a href=\"http://smart.berkeley.edu/undergraduate/\">http://smart.berkeley.edu/undergraduate/</a>.</p>\n<p> </p>\n<p dir=\"ltr\">Application Deadline: Friday, February 23, 2018, 11:59 p.m. (PST).</p>\n<p dir=\"ltr\">For more information about the 2018 SMART Program, visit the SMART website at <a href=\"http://smart.berkeley.edu/\">http://smart.berkeley.edu/</a> or contact Sarah Macdonald, NSF-SMART Postdoctoral Fellow, at smartmentoring&#64;berkeley.edu.</p>\n<h2>UROC (Under-represented Researchers of Color) DeCal</h2>\n<p dir=\"ltr\">Course Title: Ethnic Studies 98/198: Underrepresented Researchers of Color (UROC)  – Demystifying the Research Process: Decolonizing Methods in Academic Research</p>\n<p> </p>\n<p dir=\"ltr\">Class Time: Mondays, 6pm-8pm, 1/22/18 - 4/30/18</p>\n<p dir=\"ltr\">Location: 174 Barrows</p>\n<p> </p>\n<p dir=\"ltr\">Course Control Number (CCN): 24251</p>\n<p dir=\"ltr\">Units: 1-3 units</p>\n<p dir=\"ltr\">Student Instructor: Istifaa Ahmed</p>\n<p> </p>\n<p dir=\"ltr\">Welcome to our student-led organization and DeCal, Underrepresented Researchers of Color (UROC) – Demystifying the Research Process: Decolonizing Methods in Academic Research! We seek to build a community of researchers of color. As research is an extremely isolating and exclusive process at this institution, we seek to dismantle this. Furthermore, students of color perform low rates of research at this research institution, alongside research programs on campus having low representation and acceptance rates of students of color. We exist to bridge this gap.</p>\n<p> </p>\n<p dir=\"ltr\">UROC events/workshops are open to the public (on or off campus) and held regularly, in order to be as accessible to a wider range of an audience as possible. Part of how we’re cultivating this community is to provide students with necessary tools and resources – such as mentorship, panels/mixers, research methodology and decolonizing research workshops – for students to envision research that is relevant to their identities and communities with which they engage.</p>\n<p dir=\"ltr\">Please contact Istifaa (Co-Director) for syllabus and more details: iamistifa&#64;berkeley.edu</p>\n<h2>EdSurge and Blockchain in Education</h2>\n<p dir=\"ltr\">Link: <a href=\"https://www.meetup.com/Berkeley-Bitcoin-Meetup/events/247357310/\">https://www.meetup.com/Berkeley-Bitcoin-Meetup/events/247357310/</a></p>\n<p dir=\"ltr\">Title: Speaker Series: EdSurge and Blockchain in Education</p>\n<p dir=\"ltr\">Location: The House</p>\n<p dir=\"ltr\">Timing: Wednesday, February 7 6:30-9</p>\n<p> </p>\n<p dir=\"ltr\">Description: In this meetup, EdSurge will talk with experts about how cryptocurrencies and blockchain technology are beings explored and experimented with in higher education. Join us for a panel discussion, networking and light refreshments as we discuss the risks, the hype, and what else you need to know about blockchain in higher education.</p>\n<p> </p>", "created": "2018-02-09T21:25:56Z", "subject": "2.2.2018 Undergraduate Announcements", "uid": "hz4ud741s6s1gn"}, {"anon": "no", "content": "<p></p><h2><img src=\"https://mail.google.com/mail/u/0/?ui=2&amp;ik=00e01425ff&amp;view=fimg&amp;th=16157dfa45593faa&amp;attid=0.1&amp;disp=emb&amp;realattid=ii_16157dfa45593faa&amp;attbid=ANGjdJ9JzxVBiHokWk1_IpKQXlqvVI3scRKvQO34kzD2ZJd5dteOhbExz313arb6ZzthKoU_uHB_L4dmbXEss600kbTk346zX5c3C0Wiv9u6vqzONfO3gPWL3viPj5g&amp;sz=s0-l75&amp;ats=1517597730243&amp;rm=16157dfa45593faa&amp;zw\" alt=\"Inline image 1\" width=\"412\" height=\"213\" /></h2>\n<h2>Upcoming ESS Events</h2>\n<p dir=\"ltr\">Networking &amp; Etiquette Dinner</p>\n<p dir=\"ltr\">Tuesday, February 13, 6-8 p.m., Faculty Club. </p>\n<p dir=\"ltr\">Have you ever sat down to a formal meal and wondered, “What are all of these forks for?” Or been networking and thought, “Is this an appropriate topic to raise?” Then our <a href=\"https://engineering.berkeley.edu/student-life/student-leadership/networking-and-professional-etiquette-dinner\">networking and professional etiquette dinner</a> will put you at ease. Presented by a certified professional etiquette trainer, this event is a fun, non-threatening way to learn business etiquette skills while enjoying a three course meal! Cost: $15, <a href=\"https://www.regonline.com/registration/Checkin.aspx?EventID=2158323\">register online</a>.</p>\n<p> </p>\n<p dir=\"ltr\">LinkedIn Workshop</p>\n<p dir=\"ltr\">Thursday, February 8, 1-2 p.m., 240 Bechtel. </p>\n<p dir=\"ltr\">Join the Center for Access to Engineering Excellence as they give tips of how to take advantage of your LinkedIn profile and get the most out of your connections. <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSc2tgs4cYFh712iR-lBpVpMvIeo3E0CpBUHz-iRw7XuUYx3ow/viewform?usp=sf_link\">RSVP online!</a></p>\n<p> </p>\n<p dir=\"ltr\">Cupcakes &amp; Headshots</p>\n<p dir=\"ltr\">Thursday, February 8, 2-4 p.m., 227 Bechtel. </p>\n<p dir=\"ltr\">Free cupcakes and professional headshots for your professional, online profiles. Selfies are not acceptable for sites like LinkedIn, so let us help you spruce up your profile to ensure that you make a great impression! <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdlr7qsz2VyDAtPj5z_BRh4cxzg0_0cX1LEZng1NlECI0Ayjg/viewform\">RSVP online</a>.</p>\n<h2>Key Research Deadlines</h2>\n<p dir=\"ltr\">The undergraduate newsletter for late January is linked <a href=\"http://goo.gl/6pz2Nq\">here</a>.   Right now, late January, is THE time for deadlines for undergraduate research programs.  A few have passed, but most have not, such as Haas Scholars ($13,800 to conduct research in ANY major), SURF ($4,000-$6000 to carry out research), and many others. If you read the newsletter and make a plan soon, you can catch some really great opportunities! </p>\n<p> </p>\n<p dir=\"ltr\">The newsletter actually goes out weekly, but it is sent to advisors (who forwarded it to you) monthly.  If you want to make sure to not miss out on any late-breaking news, consider signing up for the listserv <a href=\"https://docs.google.com/a/berkeley.edu/forms/d/e/1FAIpQLSd-ScH8kJETreNOv3GHUzch3VimUhAQpFDKoIVC1b7Hn_IABg/viewform\">here.</a></p>\n<p> </p>\n<p dir=\"ltr\">Also, make sure to browse through the pages of  the undergraduate research web site, <a href=\"http://research.berkeley.edu/\">http://research.berkeley.edu</a>.  On the web site, we have a database of on and off-campus research programs (most with February-March deadlines), peer advising hours, many documents with advice on how to connect to professors, a calendar of events such as workshops and info sessions, and much more.  </p>\n<p> </p>\n<p dir=\"ltr\">Also, here are quick tables summarizing the remaining spring deadlines <a href=\"https://drive.google.com/open?id=1ph4vbsSJ13FbMPSsNh3Bk4NnCvkHXAeM\">for STEM (Science, Technology, Engineering and Math) students</a>  and for <a href=\"https://drive.google.com/open?id=1g9c0G9uGBzjZxLPG9tS5pg3A_7bEDCXl\">arts, humanities, and social science students.  </a></p>\n<h2>Institute of Governmental Studies Spring Break Program</h2>\n<p dir=\"ltr\">How do you take a desire to serve others, to be a change-maker, to have an impact on the issues you care about, and transform that into a meaningful public service career? <a href=\"https://igs.berkeley.edu/student-learning/democracy-camp\">Democracy Camp</a> is a new program designed for Cal students interested in enhancing our democracy through public service.</p>\n<p> </p>\n<p dir=\"ltr\">Over Cal Spring Break (March 26–29, 2018), students will gain exposure to different facets of a public service career: legislative paths, community organizations, local, state and federal  government,  and philanthropy.  Participants will learn from presenters about the opportunities available in these fields and will network to create a cohort on campus—and beyond—to support their career goals. Additionally, there will be a trip to Sacramento and skill-building modules that focus on practical and tangible takeaways. All meals and course materials are included.</p>\n<p> </p>\n<p dir=\"ltr\">Democracy Camp will take place over Cal Spring Break, from Monday, March 26–Thursday, March 29, 2018. Participants are expected to attend ALL program sessions during this time. Please do not apply if you cannot attend the full program.</p>\n<p> </p>\n<p dir=\"ltr\">All students currently enrolled at UC Berkeley are encouraged to apply!</p>\n<p> </p>\n<p dir=\"ltr\">Applications for the 2018 Democracy Camp are now being accepted! The application form can be accessed at this link: <a href=\"https://docs.google.com/forms/d/13Om998z6sS40yQl34Pn6e_B8PnbU0-lri2GzSagP8rY/edit?usp=sharing\">Democracy Camp 2018 Application</a>.</p>\n<p> </p>\n<p dir=\"ltr\">The deadline for applications is Friday February 9, 2018 (by midnight).</p>\n<p> </p>\n<p dir=\"ltr\">If you have any questions about the program, please contact: Charlotte Cowden <a href=\"mailto:ccowden&#64;berkeley.edu\">ccowden&#64;berkeley.edu</a> with Democracy Camp in the subject line.</p>\n<h2>Physiologic Informatics Research Opportunity at UCSF: Students and Recent Grads</h2>\n<p dir=\"ltr\">Join a team of physicians and engineers developing clinical decision support tools to reduce preventable deaths caused by sepsis and patient discharge errors. This NIH funded project involves predictive analysis of EHR (electronic health record) data through machine learning. Students interested in a long-term, self-directed research opportunity in preparation for medical or graduate school, or for an undergraduate thesis, are encouraged to apply for Spring 2018. We also have full-time opportunities, effective immediately, for recent graduates, such as those taking a gap year prior to graduate or medical school.</p>\n<p> </p>\n<p dir=\"ltr\">We have clinical, regulatory, statistical algorithm development, programming, and peer-review manuscript writing opportunities available. Students must be able to make a substantial commitment to this position during the spring semester and work full-time on this project throughout the summer. Recent graduates must be able to work full time for a minimum of 6 months.</p>\n<p> </p>\n<p dir=\"ltr\">If this sounds interesting, apply here (this takes less than 10 minutes!):<a href=\"https://phys-inf.typeform.com/to/zh9Yd9\"> https://phys-inf.typeform.com/to/zh9Yd9</a>. We will be accepting applications until the positions are filled, so apply early!</p>\n<p> </p>\n<p dir=\"ltr\">For further information, please email Prof. Chris Barton (<a href=\"mailto:chris.barton&#64;emergency.ucsf.edu\">chris.barton&#64;emergency.ucsf.edu</a>).</p>\n<h2>Spring Poster Session</h2>\n<p dir=\"ltr\">Engineering Student Services is pleased to present the Spring Undergraduate Research Symposium Poster Session, Monday, April 30, Noon-2 p.m., HMMB Lobby. Undergraduate students (ranging from freshmen to seniors) will be presenting their research on a wide range of projects across the College of Engineering. </p>\n<p dir=\"ltr\">How to Participate: The poster session is open to all College of Engineering undergraduates working with Engineering Faculty! <a href=\"https://berkeley.us16.list-manage.com/track/click?u=e87fa971126ebb54207b9e016&amp;id=bb84679003&amp;e=2abc3f37e2\">Submission deadline</a> April 15. Winning posters will receive cash prizes! </p>\n<h2>Ben Carlson Memorial Scholarship</h2>\n<p dir=\"ltr\">2018 Ben Carlson Memorial Scholarship is available for a current high school senior or an undergraduate student. The award amount of the scholarship is $10,000. Scholarship deadline: March 1. Applicants can get more information here: <a href=\"https://berkeley.us16.list-manage.com/track/click?u=e87fa971126ebb54207b9e016&amp;id=c36effa9e4&amp;e=2abc3f37e2\">Ben Carlson Memorial Scholarship</a></p>\n<h2>REU Opportunity</h2>\n<p dir=\"ltr\">The NSF&#39;s <a href=\"http://strobe.colorado.edu/\">STROBE </a>Center has Research Opportunities for Undergraduate Students available at UC Berkeley!</p>\n<p> </p>\n<p dir=\"ltr\">STROBE is a collaborative research project between UC Berkeley, CU Boulder, UCLA, and other schools focused on the development of imaging science.  There are research positions available at Berkeley in 3-5 labs in different fields focused on different aspects of imaging science research.  </p>\n<p> </p>\n<p dir=\"ltr\">STROBES summer opportunities include research experience, mentorship opportunities with graduate students and professors, professional development events, and extra scientific learning seminars and experiences.  The summer concludes with a voluntary symposium where students are encouraged to present their research and summer experience with other STROBE students. </p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://strobe.colorado.edu/\">STROBE </a>PIs and labs at Berkeley are working on Imaging science problems, ideas, and theories.     </p>\n<p> </p>\n<p dir=\"ltr\">Research opportunities are for middle to upper level experience undergraduates and those who are able to dedicate 8-10 weeks of their summer to the program. Competitive compensation and a housing stipend is provided.  Application deadline is February 16th, 2018.</p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://strobe.colorado.edu/education/research-experience-undergraduates\">Link to the Research Opportunity webpage. </a></p>\n<p> </p>\n<p dir=\"ltr\">Questions and comments can be email to jwoodcock&#64;berkeley.edu</p>\n<h2>BGESS and BESSA Anniversary Symposoium</h2>\n<p dir=\"ltr\">On behalf of the Celebration of Diversity in Engineering: BESSA &amp; BGESS 50th and 30th Year Anniversaries, invites you to the <a href=\"https://www.eventbrite.com/e/bgess30bessa50-afternoon-symposium-tickets-42258037929\">Afternoon Symposium</a> on Saturday, February 10th, 2018.  We are bringing in distinguished alumni to speak on the Engineering Career Panel, which will take place in Sibley Auditorium, Bechtel Engineering Center from 3 to 5PM. The audience will be composed of UC Berkeley alumni and current students as well as and prospective students. </p>\n<p> </p>\n<p dir=\"ltr\">Please sign up here: <a href=\"https://bgess-bessa-symposium.eventbrite.com/\">https://bgess-bessa-symposium.eventbrite.com</a></p>\n<h2>Register, Present, Attend! Midwest Regional SACNAS Research Conference at UChicago April 28th!</h2>\n<p dir=\"ltr\">The SACNAS Chapter at the University of Chicago is looking for STEM students to attend and present their research at the Midwest Regional SACNAS Conference on Saturday, April 28th, 2018. <a href=\"http://mx.technolutions.net/mpss/c/2QA/jM0HAA/t.2ek/ayd1914lQgWy19d5PBNU-Q/h8/drR8Bu9HbCqdmvutB3a5MtbEnEnUVin62BMUMXVWKAM-3D\">SACNAS</a> is a national organization dedicated to fostering diversity in STEM fields. The theme for the regional conference is Progress on All Fronts: Personal, Professional, and Social Advancement, which will showcase cutting edge science and technology research, as well as new efforts in STEM diversification and inclusion. </p>\n<p> </p>\n<p dir=\"ltr\">Presenting your research, either orally or through a poster, is an excellent way to hone your public speaking and communication skills, strengthen your CV, and initiate conversations with professionals and potential employers. Even if you choose not to present your research, everyone is welcome to attend numerous professional development panels and workshops. However, this is an opportunity to advance your academic career so we strongly encourage you to submit a proposal to present at the conference. </p>\n<p> </p>\n<p dir=\"ltr\">To be considered for a presentation, please <a href=\"http://mx.technolutions.net/mpss/c/2QA/jM0HAA/t.2ek/ayd1914lQgWy19d5PBNU-Q/h9/TQq8raW4D-2FfUJzgtPOAKaSS4vIHaZJtXQhzWOCarPzO-2FoJh6G7x-2B3eqIU052UvsFjAxGVjwgzIQYOpmF1mhUAB0PNoOy27kbYG61wN9e3ZGYMueC22ZIqhwPUOUPEF-2FNPXbGb-2FiyG1Z1aN5Q9GRqxQ-3D-3D\">register here</a> and submit a 200 word abstract online by March 30th, 2018. Presenters must be current undergraduate, graduate, or post-baccalaureate students in any STEM field. If you wish to attend but not present, or, if you are ineligible to present, please <a href=\"http://mx.technolutions.net/mpss/c/2QA/jM0HAA/t.2ek/ayd1914lQgWy19d5PBNU-Q/h10/TQq8raW4D-2FfUJzgtPOAKaSS4vIHaZJtXQhzWOCarPzO-2FoJh6G7x-2B3eqIU052UvsFjAxGVjwgzIQYOpmF1mhUAB0PNoOy27kbYG61wN9e3ZGYMueC22ZIqhwPUOUPEF-2FNPXbGb-2FiyG1Z1aN5Q9GRqxQ-3D-3D\">register here.</a> </p>\n<p> </p>\n<p dir=\"ltr\">The conference is free to attend and will provide a valuable professional development opportunity for everyone. If you have questions about the conference, you should contact the UChicago SACNAS Chapter at <a href=\"http://mx.technolutions.net/mpss/c/2QA/jM0HAA/t.2ek/ayd1914lQgWy19d5PBNU-Q/h11/lwouGpt-2BjMVUfMd8VK76DhalYVJfdUAWQBMXK6us3jU-3D\">ucsacnas&#64;gmail.com</a>. Additionally, make sure to check the event on <a href=\"http://mx.technolutions.net/mpss/c/2QA/jM0HAA/t.2ek/ayd1914lQgWy19d5PBNU-Q/h12/HE2UYZIDTZxfLuJ8qHDFiKcv9QeqMGLDJ3IrF8dj2B2xwWmztjrCMwulW-2BY46bUO\">Facebook</a> for the latest updates.</p>\n<h2>AWE x WICSE Research Event</h2>\n<p dir=\"ltr\">Feb. 8, 5-7pm in 540 Cory</p>\n<p dir=\"ltr\">WICSE &#43; AWE presents: How to Break into Research. It will be a panel on how to get started in research, focusing specifically on lower classmen. There will be about 5 panelists from different areas of research willing to offer advice and share stories about their research experience.</p>\n<h2>Summer Earth Science Research Opportunity - NASA DEVELOP</h2>\n<p dir=\"ltr\">This is a great opportunity for individuals who are interested in practical applications of remote sensing and GIS, specifically in the field of Earth Science. Our projects focus on addressing local and international community concerns while utilizing NASA&#39;s Earth observations. Participants work in teams to complete rapid research projects in 10 weeks with guidance from NASA and partner science advisors. These projects demonstrate to partner organizations how NASA remote sensing imagery can be used in water resource management, disaster response, ecological forecasting, and other applications.  </p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Applicants must have excellent communication and writing skills, and be able to work in a fast-paced environment. Responsibilities include: literature review, data processing and analysis, composing of deliverables including a technical paper, presentation, and project video. DEVELOP’s projects are interdisciplinary in nature, thus applications are welcome ALL academic backgrounds.</p>\n<p dir=\"ltr\">Applicants should be able to commit up at least 20 hours and up to 29 hours per week.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Details about the internship and how to apply can be found at<a href=\"http://develop.larc.nasa.gov/\"> http://develop.larc.nasa.gov/</a>. The summer online application deadline is February 16th 2018, and the internship dates are June 4th – August 10th, 2018.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">International Students:</p>\n<p dir=\"ltr\">International students interested in working with the DEVELOP Program are eligible to apply to our Regional Locations. Acceptances for international students are conditional upon proof of a visa or approved OPT that will allow them to legally work within the U.S. Students who do not meet these requirements are not eligible to participate in the DEVELOP Program. Please see the DEVELOP website and the <a href=\"https://drive.google.com/open?id=0B-gDXENcUsFobnl3X0lGS1hwVXhXMmpjU0JmRDU5MEs1ZXNj\">attached</a> flyer for details.</p>\n<h2>Apple is coming to UC Berkeley!</h2>\n<p dir=\"ltr\">I am excited to inform you that Apple is coming to UC Berkeley for a Networking Event on Tuesday, February 6 and we’ll have ~30 engineers from the business that are looking forward to meeting interested students! Please come by the Garbarini Lounge in Bechtel Engineering Center between 10:00am-3:00pm and register via the link in the attached flyer, we hope to see you there! Details are <a href=\"https://drive.google.com/open?id=0B-gDXENcUsFoc2ctNldBSVRQU0xTbnZRTHNaZzhzcUNrVDU0\">attached</a>!</p>\n<h2>Berkeley Global Internships and Summer Abroad Applications Open!</h2>\n<p dir=\"ltr\">Berkeley Global Internships offers students the opportunity to partake in a professional internship and gain academic experience in locations around the world. New locations this year include:</p>\n<ul><li>\n<p dir=\"ltr\">Boston: internships in research and entrepreneurship</p>\n</li><li></li><li>\n<p dir=\"ltr\">Japan: internships in business and computer science</p>\n</li></ul>\n<p dir=\"ltr\">For a list of all of our locations, please go to<a href=\"http://globalinternships.berkeley.edu/\"> globalinternships.berkeley.edu</a>. Applications will close on March 2, 2018 and are accepted on a first-come, first-served basis.</p>\n<p> </p>\n<p dir=\"ltr\">Summer Abroad allows students to study abroad with Berkeley faculty. New locations this year include: </p>\n<ul><li>\n<p dir=\"ltr\">Bosnia, Croatia &amp; Serbia - Balkan Bridges: Contested Histories &amp; Shared Commitments</p>\n</li><li>\n<p dir=\"ltr\">Dublin &amp; Galway, Ireland - Irish Theater</p>\n</li><li>\n<p dir=\"ltr\">Berlin, Germany - Mathematics in Berlin</p>\n</li><li>\n<p dir=\"ltr\">Portugal - Entrepreneurship &amp; Innovation in Europe</p>\n</li><li>\n<p dir=\"ltr\">London, England - Paganism: Classical and Modern</p>\n</li></ul>\n<p dir=\"ltr\">For a list of all of our locations, please go to <a href=\"http://summerabroad.berkeley.edu/\">summerabroad.berkeley.edu</a>. Applications will close on March 9, 2018 and are accepted on a first-come, first-served basis.</p>\n<p> </p>\n<p dir=\"ltr\">Please note: you may see an uptake in students requesting to change their graduation term from Spring 2018 to Summer 2018. In order to be eligible for UC tuition rates and financial aid for these programs, applicants must be students. Graduating seniors will not be able to proceed with their application as a Berkeley student until the change is reflected in CalCentral.</p>\n<h2>Student Mentoring and Research Teams (SMART) Summer 2018 Program for UCB Undergraduate Students</h2>\n<p dir=\"ltr\">May 25 - August 3, 2018</p>\n<p dir=\"ltr\">Application Deadline: Friday, February 23, 2018, 11:59 p.m. (PST).</p>\n<p dir=\"ltr\">SMART Website and Application Materials: <a href=\"http://smart.berkeley.edu/undergraduate/\">http://smart.berkeley.edu/undergraduate/</a></p>\n<p> </p>\n<p dir=\"ltr\">2018 SMART Program Undergraduate Application Informational Meetings:</p>\n<p dir=\"ltr\">Thursday, February 8, 2018 from 1:00 to 2:00 p.m., 309 Sproul Hall; and</p>\n<p dir=\"ltr\">Wednesday, February 14, 2018 from 11:00 a.m. to 12:00 p.m., 309 Sproul Hall.</p>\n<p> </p>\n<p dir=\"ltr\">2018 SMART PROGRAM DESCRIPTION</p>\n<p dir=\"ltr\">Student Mentoring and Research Teams (SMART) is a summer program designed to encourage graduate student professional development and foster undergraduate research through mentoring. Each graduate student participant will receive a summer stipend ranging from $1,000 to $5,000; each undergraduate participant will receive a summer stipend in the amount of $3,500 for approximately 200 hours of work. (Undergraduate students should note that this stipend may affect the amount of financial aid they are eligible to receive in summer 2018.)</p>\n<p> </p>\n<p dir=\"ltr\">UNDERGRADUATE ELIGIBILITY REQUIREMENTS</p>\n<p dir=\"ltr\">To be eligible to apply for this program, you must meet the following criteria:</p>\n<p dir=\"ltr\">1) You must be a UC Berkeley undergraduate student who is currently pursuing a UC Berkeley undergraduate degree. (Please note that visiting students are not eligible to apply.)</p>\n<p dir=\"ltr\">2) You must be in good academic standing at the time of application.</p>\n<p dir=\"ltr\">3) Undergraduate students from any UC Berkeley academic department or program are eligible to apply; students who have not yet declared their majors are also eligible to apply. Students who graduated in December 2017 or will graduate in May 2018 are not eligible to apply.</p>\n<p dir=\"ltr\">4) If you applied in the past and were not selected to be a SMART mentee, you are welcome to apply again. Former SMART mentees are not eligible to apply.</p>\n<p> </p>\n<p dir=\"ltr\">SMART UNDERGRADUATE PROGRAM REQUIREMENTS</p>\n<p dir=\"ltr\">In addition to conducting research for approximately 200 hours, undergraduate student mentees will be required to attend all of the following SMART 2018 meetings:</p>\n<ul><li>\n<p dir=\"ltr\">Friday, May 25, 2018, 1-4 p.m.: SMART Program Kickoff</p>\n</li><li>\n<p dir=\"ltr\">Friday, June 1, 2018, 1-3 p.m.: Applying to Graduate School</p>\n</li><li>\n<p dir=\"ltr\">Friday, June 15, 2018, 1-3 p.m.: Meeting of the Mentees</p>\n</li><li>\n<p dir=\"ltr\">Friday, June 22, 2018, 1-3 p.m.: SMART Lunch</p>\n</li><li>\n<p dir=\"ltr\">Friday, July 6, 2018, 1-3 p.m.: Applying for Grants/Fellowships</p>\n</li><li>\n<p dir=\"ltr\">Friday, July 13, 2018, 1-3 p.m.: Workshop on Presenting Your Research at the Closing Reception</p>\n</li><li>\n<p dir=\"ltr\">Friday, July 20, 2018, 1-3 p.m.: Academic and Professional Writing</p>\n</li><li>\n<p dir=\"ltr\">Friday, August 3, 2018, 3-5 p.m.: SMART Closing Reception and Research Presentations</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">UNDERGRADUATE APPLICATION REQUIREMENTS</p>\n<p dir=\"ltr\">To complete the application, students will be asked to submit the following items: (1) an application essay, and (2) a current resume or curriculum vitae.</p>\n<p dir=\"ltr\">More detailed information about the application essay is included in the application form.</p>\n<p> </p>\n<p dir=\"ltr\">APPLICATION FORM</p>\n<p dir=\"ltr\">Information about the SMART Program and a link to the undergraduate application form are located on the SMART website at <a href=\"http://smart.berkeley.edu/undergraduate/\">http://smart.berkeley.edu/undergraduate/</a>.</p>\n<p> </p>\n<p dir=\"ltr\">Application Deadline: Friday, February 23, 2018, 11:59 p.m. (PST).</p>\n<p dir=\"ltr\">For more information about the 2018 SMART Program, visit the SMART website at <a href=\"http://smart.berkeley.edu/\">http://smart.berkeley.edu/</a> or contact Sarah Macdonald, NSF-SMART Postdoctoral Fellow, at smartmentoring&#64;berkeley.edu.</p>\n<h2>UROC (Under-represented Researchers of Color) DeCal</h2>\n<p dir=\"ltr\">Course Title: Ethnic Studies 98/198: Underrepresented Researchers of Color (UROC)  – Demystifying the Research Process: Decolonizing Methods in Academic Research</p>\n<p> </p>\n<p dir=\"ltr\">Class Time: Mondays, 6pm-8pm, 1/22/18 - 4/30/18</p>\n<p dir=\"ltr\">Location: 174 Barrows</p>\n<p> </p>\n<p dir=\"ltr\">Course Control Number (CCN): 24251</p>\n<p dir=\"ltr\">Units: 1-3 units</p>\n<p dir=\"ltr\">Student Instructor: Istifaa Ahmed</p>\n<p> </p>\n<p dir=\"ltr\">Welcome to our student-led organization and DeCal, Underrepresented Researchers of Color (UROC) – Demystifying the Research Process: Decolonizing Methods in Academic Research! We seek to build a community of researchers of color. As research is an extremely isolating and exclusive process at this institution, we seek to dismantle this. Furthermore, students of color perform low rates of research at this research institution, alongside research programs on campus having low representation and acceptance rates of students of color. We exist to bridge this gap.</p>\n<p> </p>\n<p dir=\"ltr\">UROC events/workshops are open to the public (on or off campus) and held regularly, in order to be as accessible to a wider range of an audience as possible. Part of how we’re cultivating this community is to provide students with necessary tools and resources – such as mentorship, panels/mixers, research methodology and decolonizing research workshops – for students to envision research that is relevant to their identities and communities with which they engage.</p>\n<p dir=\"ltr\">Please contact Istifaa (Co-Director) for syllabus and more details: iamistifa&#64;berkeley.edu</p>\n<h2>EdSurge and Blockchain in Education</h2>\n<p dir=\"ltr\">Link: <a href=\"https://www.meetup.com/Berkeley-Bitcoin-Meetup/events/247357310/\">https://www.meetup.com/Berkeley-Bitcoin-Meetup/events/247357310/</a></p>\n<p dir=\"ltr\">Title: Speaker Series: EdSurge and Blockchain in Education</p>\n<p dir=\"ltr\">Location: The House</p>\n<p dir=\"ltr\">Timing: Wednesday, February 7 6:30-9</p>\n<p> </p>\n<p dir=\"ltr\">Description: In this meetup, EdSurge will talk with experts about how cryptocurrencies and blockchain technology are beings explored and experimented with in higher education. Join us for a panel discussion, networking and light refreshments as we discuss the risks, the hype, and what else you need to know about blockchain in higher education.</p>\n<p> </p>\n#pin", "created": "2018-02-02T18:58:01Z", "subject": "2.2.2018 Undergraduate Announcements", "uid": "hz4ud741s6s1gn"}, {"anon": "no", "content": "<p></p><h2><img src=\"https://mail.google.com/mail/u/0/?ui=2&amp;ik=00e01425ff&amp;view=fimg&amp;th=16157dfa45593faa&amp;attid=0.1&amp;disp=emb&amp;realattid=ii_16157dfa45593faa&amp;attbid=ANGjdJ9JzxVBiHokWk1_IpKQXlqvVI3scRKvQO34kzD2ZJd5dteOhbExz313arb6ZzthKoU_uHB_L4dmbXEss600kbTk346zX5c3C0Wiv9u6vqzONfO3gPWL3viPj5g&amp;sz=s0-l75&amp;ats=1517597730243&amp;rm=16157dfa45593faa&amp;zw\" alt=\"Inline image 1\" width=\"412\" height=\"213\" /></h2>\n<h2>Upcoming ESS Events</h2>\n<p dir=\"ltr\">Networking &amp; Etiquette Dinner</p>\n<p dir=\"ltr\">Tuesday, February 13, 6-8 p.m., Faculty Club. </p>\n<p dir=\"ltr\">Have you ever sat down to a formal meal and wondered, “What are all of these forks for?” Or been networking and thought, “Is this an appropriate topic to raise?” Then our <a href=\"https://engineering.berkeley.edu/student-life/student-leadership/networking-and-professional-etiquette-dinner\">networking and professional etiquette dinner</a> will put you at ease. Presented by a certified professional etiquette trainer, this event is a fun, non-threatening way to learn business etiquette skills while enjoying a three course meal! Cost: $15, <a href=\"https://www.regonline.com/registration/Checkin.aspx?EventID=2158323\">register online</a>.</p>\n<p> </p>\n<p dir=\"ltr\">LinkedIn Workshop</p>\n<p dir=\"ltr\">Thursday, February 8, 1-2 p.m., 240 Bechtel. </p>\n<p dir=\"ltr\">Join the Center for Access to Engineering Excellence as they give tips of how to take advantage of your LinkedIn profile and get the most out of your connections. <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSc2tgs4cYFh712iR-lBpVpMvIeo3E0CpBUHz-iRw7XuUYx3ow/viewform?usp=sf_link\">RSVP online!</a></p>\n<p> </p>\n<p dir=\"ltr\">Cupcakes &amp; Headshots</p>\n<p dir=\"ltr\">Thursday, February 8, 2-4 p.m., 227 Bechtel. </p>\n<p dir=\"ltr\">Free cupcakes and professional headshots for your professional, online profiles. Selfies are not acceptable for sites like LinkedIn, so let us help you spruce up your profile to ensure that you make a great impression! <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdlr7qsz2VyDAtPj5z_BRh4cxzg0_0cX1LEZng1NlECI0Ayjg/viewform\">RSVP online</a>.</p>\n<h2>Key Research Deadlines</h2>\n<p dir=\"ltr\">The undergraduate newsletter for late January is linked <a href=\"http://goo.gl/6pz2Nq\">here</a>.   Right now, late January, is THE time for deadlines for undergraduate research programs.  A few have passed, but most have not, such as Haas Scholars ($13,800 to conduct research in ANY major), SURF ($4,000-$6000 to carry out research), and many others. If you read the newsletter and make a plan soon, you can catch some really great opportunities! </p>\n<p> </p>\n<p dir=\"ltr\">The newsletter actually goes out weekly, but it is sent to advisors (who forwarded it to you) monthly.  If you want to make sure to not miss out on any late-breaking news, consider signing up for the listserv <a href=\"https://docs.google.com/a/berkeley.edu/forms/d/e/1FAIpQLSd-ScH8kJETreNOv3GHUzch3VimUhAQpFDKoIVC1b7Hn_IABg/viewform\">here.</a></p>\n<p> </p>\n<p dir=\"ltr\">Also, make sure to browse through the pages of  the undergraduate research web site, <a href=\"http://research.berkeley.edu/\">http://research.berkeley.edu</a>.  On the web site, we have a database of on and off-campus research programs (most with February-March deadlines), peer advising hours, many documents with advice on how to connect to professors, a calendar of events such as workshops and info sessions, and much more.  </p>\n<p> </p>\n<p dir=\"ltr\">Also, here are quick tables summarizing the remaining spring deadlines <a href=\"https://drive.google.com/open?id=1ph4vbsSJ13FbMPSsNh3Bk4NnCvkHXAeM\">for STEM (Science, Technology, Engineering and Math) students</a>  and for <a href=\"https://drive.google.com/open?id=1g9c0G9uGBzjZxLPG9tS5pg3A_7bEDCXl\">arts, humanities, and social science students.  </a></p>\n<h2>Institute of Governmental Studies Spring Break Program</h2>\n<p dir=\"ltr\">How do you take a desire to serve others, to be a change-maker, to have an impact on the issues you care about, and transform that into a meaningful public service career? <a href=\"https://igs.berkeley.edu/student-learning/democracy-camp\">Democracy Camp</a> is a new program designed for Cal students interested in enhancing our democracy through public service.</p>\n<p> </p>\n<p dir=\"ltr\">Over Cal Spring Break (March 26–29, 2018), students will gain exposure to different facets of a public service career: legislative paths, community organizations, local, state and federal  government,  and philanthropy.  Participants will learn from presenters about the opportunities available in these fields and will network to create a cohort on campus—and beyond—to support their career goals. Additionally, there will be a trip to Sacramento and skill-building modules that focus on practical and tangible takeaways. All meals and course materials are included.</p>\n<p> </p>\n<p dir=\"ltr\">Democracy Camp will take place over Cal Spring Break, from Monday, March 26–Thursday, March 29, 2018. Participants are expected to attend ALL program sessions during this time. Please do not apply if you cannot attend the full program.</p>\n<p> </p>\n<p dir=\"ltr\">All students currently enrolled at UC Berkeley are encouraged to apply!</p>\n<p> </p>\n<p dir=\"ltr\">Applications for the 2018 Democracy Camp are now being accepted! The application form can be accessed at this link: <a href=\"https://docs.google.com/forms/d/13Om998z6sS40yQl34Pn6e_B8PnbU0-lri2GzSagP8rY/edit?usp=sharing\">Democracy Camp 2018 Application</a>.</p>\n<p> </p>\n<p dir=\"ltr\">The deadline for applications is Friday February 9, 2018 (by midnight).</p>\n<p> </p>\n<p dir=\"ltr\">If you have any questions about the program, please contact: Charlotte Cowden <a href=\"mailto:ccowden&#64;berkeley.edu\">ccowden&#64;berkeley.edu</a> with Democracy Camp in the subject line.</p>\n<h2>Physiologic Informatics Research Opportunity at UCSF: Students and Recent Grads</h2>\n<p dir=\"ltr\">Join a team of physicians and engineers developing clinical decision support tools to reduce preventable deaths caused by sepsis and patient discharge errors. This NIH funded project involves predictive analysis of EHR (electronic health record) data through machine learning. Students interested in a long-term, self-directed research opportunity in preparation for medical or graduate school, or for an undergraduate thesis, are encouraged to apply for Spring 2018. We also have full-time opportunities, effective immediately, for recent graduates, such as those taking a gap year prior to graduate or medical school.</p>\n<p> </p>\n<p dir=\"ltr\">We have clinical, regulatory, statistical algorithm development, programming, and peer-review manuscript writing opportunities available. Students must be able to make a substantial commitment to this position during the spring semester and work full-time on this project throughout the summer. Recent graduates must be able to work full time for a minimum of 6 months.</p>\n<p> </p>\n<p dir=\"ltr\">If this sounds interesting, apply here (this takes less than 10 minutes!):<a href=\"https://phys-inf.typeform.com/to/zh9Yd9\"> https://phys-inf.typeform.com/to/zh9Yd9</a>. We will be accepting applications until the positions are filled, so apply early!</p>\n<p> </p>\n<p dir=\"ltr\">For further information, please email Prof. Chris Barton (<a href=\"mailto:chris.barton&#64;emergency.ucsf.edu\">chris.barton&#64;emergency.ucsf.edu</a>).</p>\n<h2>Spring Poster Session</h2>\n<p dir=\"ltr\">Engineering Student Services is pleased to present the Spring Undergraduate Research Symposium Poster Session, Monday, April 30, Noon-2 p.m., HMMB Lobby. Undergraduate students (ranging from freshmen to seniors) will be presenting their research on a wide range of projects across the College of Engineering. </p>\n<p dir=\"ltr\">How to Participate: The poster session is open to all College of Engineering undergraduates working with Engineering Faculty! <a href=\"https://berkeley.us16.list-manage.com/track/click?u=e87fa971126ebb54207b9e016&amp;id=bb84679003&amp;e=2abc3f37e2\">Submission deadline</a> April 15. Winning posters will receive cash prizes! </p>\n<h2>Ben Carlson Memorial Scholarship</h2>\n<p dir=\"ltr\">2018 Ben Carlson Memorial Scholarship is available for a current high school senior or an undergraduate student. The award amount of the scholarship is $10,000. Scholarship deadline: March 1. Applicants can get more information here: <a href=\"https://berkeley.us16.list-manage.com/track/click?u=e87fa971126ebb54207b9e016&amp;id=c36effa9e4&amp;e=2abc3f37e2\">Ben Carlson Memorial Scholarship</a></p>\n<h2>REU Opportunity</h2>\n<p dir=\"ltr\">The NSF&#39;s <a href=\"http://strobe.colorado.edu/\">STROBE </a>Center has Research Opportunities for Undergraduate Students available at UC Berkeley!</p>\n<p> </p>\n<p dir=\"ltr\">STROBE is a collaborative research project between UC Berkeley, CU Boulder, UCLA, and other schools focused on the development of imaging science.  There are research positions available at Berkeley in 3-5 labs in different fields focused on different aspects of imaging science research.  </p>\n<p> </p>\n<p dir=\"ltr\">STROBES summer opportunities include research experience, mentorship opportunities with graduate students and professors, professional development events, and extra scientific learning seminars and experiences.  The summer concludes with a voluntary symposium where students are encouraged to present their research and summer experience with other STROBE students. </p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://strobe.colorado.edu/\">STROBE </a>PIs and labs at Berkeley are working on Imaging science problems, ideas, and theories.     </p>\n<p> </p>\n<p dir=\"ltr\">Research opportunities are for middle to upper level experience undergraduates and those who are able to dedicate 8-10 weeks of their summer to the program. Competitive compensation and a housing stipend is provided.  Application deadline is February 16th, 2018.</p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://strobe.colorado.edu/education/research-experience-undergraduates\">Link to the Research Opportunity webpage. </a></p>\n<p> </p>\n<p dir=\"ltr\">Questions and comments can be email to jwoodcock&#64;berkeley.edu</p>\n<h2>BGESS and BESSA Anniversary Symposoium</h2>\n<p dir=\"ltr\">On behalf of the Celebration of Diversity in Engineering: BESSA &amp; BGESS 50th and 30th Year Anniversaries, invites you to the <a href=\"https://www.eventbrite.com/e/bgess30bessa50-afternoon-symposium-tickets-42258037929\">Afternoon Symposium</a> on Saturday, February 10th, 2018.  We are bringing in distinguished alumni to speak on the Engineering Career Panel, which will take place in Sibley Auditorium, Bechtel Engineering Center from 3 to 5PM. The audience will be composed of UC Berkeley alumni and current students as well as and prospective students. </p>\n<p> </p>\n<p dir=\"ltr\">Please sign up here: <a href=\"https://bgess-bessa-symposium.eventbrite.com/\">https://bgess-bessa-symposium.eventbrite.com</a></p>\n<h2>Register, Present, Attend! Midwest Regional SACNAS Research Conference at UChicago April 28th!</h2>\n<p dir=\"ltr\">The SACNAS Chapter at the University of Chicago is looking for STEM students to attend and present their research at the Midwest Regional SACNAS Conference on Saturday, April 28th, 2018. <a href=\"http://mx.technolutions.net/mpss/c/2QA/jM0HAA/t.2ek/ayd1914lQgWy19d5PBNU-Q/h8/drR8Bu9HbCqdmvutB3a5MtbEnEnUVin62BMUMXVWKAM-3D\">SACNAS</a> is a national organization dedicated to fostering diversity in STEM fields. The theme for the regional conference is Progress on All Fronts: Personal, Professional, and Social Advancement, which will showcase cutting edge science and technology research, as well as new efforts in STEM diversification and inclusion. </p>\n<p> </p>\n<p dir=\"ltr\">Presenting your research, either orally or through a poster, is an excellent way to hone your public speaking and communication skills, strengthen your CV, and initiate conversations with professionals and potential employers. Even if you choose not to present your research, everyone is welcome to attend numerous professional development panels and workshops. However, this is an opportunity to advance your academic career so we strongly encourage you to submit a proposal to present at the conference. </p>\n<p> </p>\n<p dir=\"ltr\">To be considered for a presentation, please <a href=\"http://mx.technolutions.net/mpss/c/2QA/jM0HAA/t.2ek/ayd1914lQgWy19d5PBNU-Q/h9/TQq8raW4D-2FfUJzgtPOAKaSS4vIHaZJtXQhzWOCarPzO-2FoJh6G7x-2B3eqIU052UvsFjAxGVjwgzIQYOpmF1mhUAB0PNoOy27kbYG61wN9e3ZGYMueC22ZIqhwPUOUPEF-2FNPXbGb-2FiyG1Z1aN5Q9GRqxQ-3D-3D\">register here</a> and submit a 200 word abstract online by March 30th, 2018. Presenters must be current undergraduate, graduate, or post-baccalaureate students in any STEM field. If you wish to attend but not present, or, if you are ineligible to present, please <a href=\"http://mx.technolutions.net/mpss/c/2QA/jM0HAA/t.2ek/ayd1914lQgWy19d5PBNU-Q/h10/TQq8raW4D-2FfUJzgtPOAKaSS4vIHaZJtXQhzWOCarPzO-2FoJh6G7x-2B3eqIU052UvsFjAxGVjwgzIQYOpmF1mhUAB0PNoOy27kbYG61wN9e3ZGYMueC22ZIqhwPUOUPEF-2FNPXbGb-2FiyG1Z1aN5Q9GRqxQ-3D-3D\">register here.</a> </p>\n<p> </p>\n<p dir=\"ltr\">The conference is free to attend and will provide a valuable professional development opportunity for everyone. If you have questions about the conference, you should contact the UChicago SACNAS Chapter at <a href=\"http://mx.technolutions.net/mpss/c/2QA/jM0HAA/t.2ek/ayd1914lQgWy19d5PBNU-Q/h11/lwouGpt-2BjMVUfMd8VK76DhalYVJfdUAWQBMXK6us3jU-3D\">ucsacnas&#64;gmail.com</a>. Additionally, make sure to check the event on <a href=\"http://mx.technolutions.net/mpss/c/2QA/jM0HAA/t.2ek/ayd1914lQgWy19d5PBNU-Q/h12/HE2UYZIDTZxfLuJ8qHDFiKcv9QeqMGLDJ3IrF8dj2B2xwWmztjrCMwulW-2BY46bUO\">Facebook</a> for the latest updates.</p>\n<h2>AWE x WICSE Research Event</h2>\n<p dir=\"ltr\">Feb. 8, 5-7pm in 540 Cory</p>\n<p dir=\"ltr\">WICSE &#43; AWE presents: How to Break into Research. It will be a panel on how to get started in research, focusing specifically on lower classmen. There will be about 5 panelists from different areas of research willing to offer advice and share stories about their research experience.</p>\n<h2>Summer Earth Science Research Opportunity - NASA DEVELOP</h2>\n<p dir=\"ltr\">This is a great opportunity for individuals who are interested in practical applications of remote sensing and GIS, specifically in the field of Earth Science. Our projects focus on addressing local and international community concerns while utilizing NASA&#39;s Earth observations. Participants work in teams to complete rapid research projects in 10 weeks with guidance from NASA and partner science advisors. These projects demonstrate to partner organizations how NASA remote sensing imagery can be used in water resource management, disaster response, ecological forecasting, and other applications.  </p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Applicants must have excellent communication and writing skills, and be able to work in a fast-paced environment. Responsibilities include: literature review, data processing and analysis, composing of deliverables including a technical paper, presentation, and project video. DEVELOP’s projects are interdisciplinary in nature, thus applications are welcome ALL academic backgrounds.</p>\n<p dir=\"ltr\">Applicants should be able to commit up at least 20 hours and up to 29 hours per week.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Details about the internship and how to apply can be found at<a href=\"http://develop.larc.nasa.gov/\"> http://develop.larc.nasa.gov/</a>. The summer online application deadline is February 16th 2018, and the internship dates are June 4th – August 10th, 2018.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">International Students:</p>\n<p dir=\"ltr\">International students interested in working with the DEVELOP Program are eligible to apply to our Regional Locations. Acceptances for international students are conditional upon proof of a visa or approved OPT that will allow them to legally work within the U.S. Students who do not meet these requirements are not eligible to participate in the DEVELOP Program. Please see the DEVELOP website and the <a href=\"https://drive.google.com/open?id=0B-gDXENcUsFobnl3X0lGS1hwVXhXMmpjU0JmRDU5MEs1ZXNj\">attached</a> flyer for details.</p>\n<h2>Apple is coming to UC Berkeley!</h2>\n<p dir=\"ltr\">I am excited to inform you that Apple is coming to UC Berkeley for a Networking Event on Tuesday, February 6 and we’ll have ~30 engineers from the business that are looking forward to meeting interested students! Please come by the Garbarini Lounge in Bechtel Engineering Center between 10:00am-3:00pm and register via the link in the attached flyer, we hope to see you there! Details are <a href=\"https://drive.google.com/open?id=0B-gDXENcUsFoc2ctNldBSVRQU0xTbnZRTHNaZzhzcUNrVDU0\">attached</a>!</p>\n<h2>Berkeley Global Internships and Summer Abroad Applications Open!</h2>\n<p dir=\"ltr\">Berkeley Global Internships offers students the opportunity to partake in a professional internship and gain academic experience in locations around the world. New locations this year include:</p>\n<ul><li>\n<p dir=\"ltr\">Boston: internships in research and entrepreneurship</p>\n</li><li></li><li>\n<p dir=\"ltr\">Japan: internships in business and computer science</p>\n</li></ul>\n<p dir=\"ltr\">For a list of all of our locations, please go to<a href=\"http://globalinternships.berkeley.edu/\"> globalinternships.berkeley.edu</a>. Applications will close on March 2, 2018 and are accepted on a first-come, first-served basis.</p>\n<p> </p>\n<p dir=\"ltr\">Summer Abroad allows students to study abroad with Berkeley faculty. New locations this year include: </p>\n<ul><li>\n<p dir=\"ltr\">Bosnia, Croatia &amp; Serbia - Balkan Bridges: Contested Histories &amp; Shared Commitments</p>\n</li><li>\n<p dir=\"ltr\">Dublin &amp; Galway, Ireland - Irish Theater</p>\n</li><li>\n<p dir=\"ltr\">Berlin, Germany - Mathematics in Berlin</p>\n</li><li>\n<p dir=\"ltr\">Portugal - Entrepreneurship &amp; Innovation in Europe</p>\n</li><li>\n<p dir=\"ltr\">London, England - Paganism: Classical and Modern</p>\n</li></ul>\n<p dir=\"ltr\">For a list of all of our locations, please go to <a href=\"http://summerabroad.berkeley.edu/\">summerabroad.berkeley.edu</a>. Applications will close on March 9, 2018 and are accepted on a first-come, first-served basis.</p>\n<p> </p>\n<p dir=\"ltr\">Please note: you may see an uptake in students requesting to change their graduation term from Spring 2018 to Summer 2018. In order to be eligible for UC tuition rates and financial aid for these programs, applicants must be students. Graduating seniors will not be able to proceed with their application as a Berkeley student until the change is reflected in CalCentral.</p>\n<h2>Student Mentoring and Research Teams (SMART) Summer 2018 Program for UCB Undergraduate Students</h2>\n<p dir=\"ltr\">May 25 - August 3, 2018</p>\n<p dir=\"ltr\">Application Deadline: Friday, February 23, 2018, 11:59 p.m. (PST).</p>\n<p dir=\"ltr\">SMART Website and Application Materials: <a href=\"http://smart.berkeley.edu/undergraduate/\">http://smart.berkeley.edu/undergraduate/</a></p>\n<p> </p>\n<p dir=\"ltr\">2018 SMART Program Undergraduate Application Informational Meetings:</p>\n<p dir=\"ltr\">Thursday, February 8, 2018 from 1:00 to 2:00 p.m., 309 Sproul Hall; and</p>\n<p dir=\"ltr\">Wednesday, February 14, 2018 from 11:00 a.m. to 12:00 p.m., 309 Sproul Hall.</p>\n<p> </p>\n<p dir=\"ltr\">2018 SMART PROGRAM DESCRIPTION</p>\n<p dir=\"ltr\">Student Mentoring and Research Teams (SMART) is a summer program designed to encourage graduate student professional development and foster undergraduate research through mentoring. Each graduate student participant will receive a summer stipend ranging from $1,000 to $5,000; each undergraduate participant will receive a summer stipend in the amount of $3,500 for approximately 200 hours of work. (Undergraduate students should note that this stipend may affect the amount of financial aid they are eligible to receive in summer 2018.)</p>\n<p> </p>\n<p dir=\"ltr\">UNDERGRADUATE ELIGIBILITY REQUIREMENTS</p>\n<p dir=\"ltr\">To be eligible to apply for this program, you must meet the following criteria:</p>\n<p dir=\"ltr\">1) You must be a UC Berkeley undergraduate student who is currently pursuing a UC Berkeley undergraduate degree. (Please note that visiting students are not eligible to apply.)</p>\n<p dir=\"ltr\">2) You must be in good academic standing at the time of application.</p>\n<p dir=\"ltr\">3) Undergraduate students from any UC Berkeley academic department or program are eligible to apply; students who have not yet declared their majors are also eligible to apply. Students who graduated in December 2017 or will graduate in May 2018 are not eligible to apply.</p>\n<p dir=\"ltr\">4) If you applied in the past and were not selected to be a SMART mentee, you are welcome to apply again. Former SMART mentees are not eligible to apply.</p>\n<p> </p>\n<p dir=\"ltr\">SMART UNDERGRADUATE PROGRAM REQUIREMENTS</p>\n<p dir=\"ltr\">In addition to conducting research for approximately 200 hours, undergraduate student mentees will be required to attend all of the following SMART 2018 meetings:</p>\n<ul><li>\n<p dir=\"ltr\">Friday, May 25, 2018, 1-4 p.m.: SMART Program Kickoff</p>\n</li><li>\n<p dir=\"ltr\">Friday, June 1, 2018, 1-3 p.m.: Applying to Graduate School</p>\n</li><li>\n<p dir=\"ltr\">Friday, June 15, 2018, 1-3 p.m.: Meeting of the Mentees</p>\n</li><li>\n<p dir=\"ltr\">Friday, June 22, 2018, 1-3 p.m.: SMART Lunch</p>\n</li><li>\n<p dir=\"ltr\">Friday, July 6, 2018, 1-3 p.m.: Applying for Grants/Fellowships</p>\n</li><li>\n<p dir=\"ltr\">Friday, July 13, 2018, 1-3 p.m.: Workshop on Presenting Your Research at the Closing Reception</p>\n</li><li>\n<p dir=\"ltr\">Friday, July 20, 2018, 1-3 p.m.: Academic and Professional Writing</p>\n</li><li>\n<p dir=\"ltr\">Friday, August 3, 2018, 3-5 p.m.: SMART Closing Reception and Research Presentations</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">UNDERGRADUATE APPLICATION REQUIREMENTS</p>\n<p dir=\"ltr\">To complete the application, students will be asked to submit the following items: (1) an application essay, and (2) a current resume or curriculum vitae.</p>\n<p dir=\"ltr\">More detailed information about the application essay is included in the application form.</p>\n<p> </p>\n<p dir=\"ltr\">APPLICATION FORM</p>\n<p dir=\"ltr\">Information about the SMART Program and a link to the undergraduate application form are located on the SMART website at <a href=\"http://smart.berkeley.edu/undergraduate/\">http://smart.berkeley.edu/undergraduate/</a>.</p>\n<p> </p>\n<p dir=\"ltr\">Application Deadline: Friday, February 23, 2018, 11:59 p.m. (PST).</p>\n<p dir=\"ltr\">For more information about the 2018 SMART Program, visit the SMART website at <a href=\"http://smart.berkeley.edu/\">http://smart.berkeley.edu/</a> or contact Sarah Macdonald, NSF-SMART Postdoctoral Fellow, at smartmentoring&#64;berkeley.edu.</p>\n<h2>UROC (Under-represented Researchers of Color) DeCal</h2>\n<p dir=\"ltr\">Course Title: Ethnic Studies 98/198: Underrepresented Researchers of Color (UROC)  – Demystifying the Research Process: Decolonizing Methods in Academic Research</p>\n<p> </p>\n<p dir=\"ltr\">Class Time: Mondays, 6pm-8pm, 1/22/18 - 4/30/18</p>\n<p dir=\"ltr\">Location: 174 Barrows</p>\n<p> </p>\n<p dir=\"ltr\">Course Control Number (CCN): 24251</p>\n<p dir=\"ltr\">Units: 1-3 units</p>\n<p dir=\"ltr\">Student Instructor: Istifaa Ahmed</p>\n<p> </p>\n<p dir=\"ltr\">Welcome to our student-led organization and DeCal, Underrepresented Researchers of Color (UROC) – Demystifying the Research Process: Decolonizing Methods in Academic Research! We seek to build a community of researchers of color. As research is an extremely isolating and exclusive process at this institution, we seek to dismantle this. Furthermore, students of color perform low rates of research at this research institution, alongside research programs on campus having low representation and acceptance rates of students of color. We exist to bridge this gap.</p>\n<p> </p>\n<p dir=\"ltr\">UROC events/workshops are open to the public (on or off campus) and held regularly, in order to be as accessible to a wider range of an audience as possible. Part of how we’re cultivating this community is to provide students with necessary tools and resources – such as mentorship, panels/mixers, research methodology and decolonizing research workshops – for students to envision research that is relevant to their identities and communities with which they engage.</p>\n<p dir=\"ltr\">Please contact Istifaa (Co-Director) for syllabus and more details: iamistifa&#64;berkeley.edu</p>\n<h2>EdSurge and Blockchain in Education</h2>\n<p dir=\"ltr\">Link: <a href=\"https://www.meetup.com/Berkeley-Bitcoin-Meetup/events/247357310/\">https://www.meetup.com/Berkeley-Bitcoin-Meetup/events/247357310/</a></p>\n<p dir=\"ltr\">Title: Speaker Series: EdSurge and Blockchain in Education</p>\n<p dir=\"ltr\">Location: The House</p>\n<p dir=\"ltr\">Timing: Wednesday, February 7 6:30-9</p>\n<p> </p>\n<p dir=\"ltr\">Description: In this meetup, EdSurge will talk with experts about how cryptocurrencies and blockchain technology are beings explored and experimented with in higher education. Join us for a panel discussion, networking and light refreshments as we discuss the risks, the hype, and what else you need to know about blockchain in higher education.</p>\n<p> </p>", "created": "2018-02-02T18:57:58Z", "subject": "2.2.2018 Undergraduate Announcements", "uid": "hz4ud741s6s1gn"}], "i_edits": [], "id": "jd6alcze7u14sx", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 6172, "num_favorites": 4, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654550174244, "tag_good": [], "tag_good_arr": [], "tags": ["announcements", "instructor-note"], "type": "note", "unique_views": 824}