{"bookmarked": 4, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jevzy0scrhs13j", "type": "create", "uid_a": "a_0", "when": "2018-03-17T23:21:35Z"}, {"anon": "stud", "data": "jew21130rju54v", "to": "jevzy0sa56m13i", "type": "s_answer", "uid_a": "a_1", "when": "2018-03-18T00:19:55Z"}, {"anon": "stud", "data": "jexakj277215cv", "type": "s_answer_update", "uid_a": "a_2", "when": "2018-03-18T21:06:48Z"}, {"anon": "stud", "to": "jevzy0sa56m13i", "type": "followup", "uid_a": "a_3", "when": "2018-03-20T00:17:03Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2018-03-18T00:19:55Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>If you are gonna be here at Berkeley, then I&#39;d strongly suggest you to take the in-class option. The online version has very little support (zero in-person support, obviously) and you are mostly dependent on your own to teach yourself the material, which could turn out to be quite difficult.</p>\n<p></p>\n<p>--</p>\n<p></p>\n<p>Took Math W53 in Summer 2016. I had just finished 1A/1B (note: hadn&#39;t done 54 yet), and I found the class to be manageable. Problem sets are due twice a week, with an online quiz once a week. The quiz is timed at 2 hours, in which you have to complete 5 questions and scan your work. The quiz is meant to take 1 hour; the extra hour is for technical difficulties. As for material/pacing, I thought Professor Hutchings was fantastic. The lectures are available online, and the support on the Piazza is pretty active. Pacing was comfortable, but it relies on you being disciplined enough to watch lecture when it comes out and start homework immediately. No midterm exams, just one in-person final (can be taken anywhere, just needs to be proctored). </p>\n<p></p>\n<p>Overall, I thought it was a great class, and an awesome alternative to taking 53 over the semester. Of course, I don&#39;t know what I missed out on by not taking it during the year. One note I must say is that plenty of community colleges over Multivariable Calculus, so if cost is an issue, do the class locally. I&#39;m sure there are online equivalents to Multivariable Calculus as well, but at the expense of not being taught in a Berkeley-level rigor/difficulty. Good luck!</p>", "created": "2018-03-18T21:06:48Z", "subject": "", "uid_a": "a_2"}, {"anon": "stud", "content": "<p>If you are gonna be here at Berkeley, then I&#39;d strongly suggest you to take the in-class option. The online version has very little support (zero in-person support, obviously) and you are mostly dependent on your own to teach yourself the material, which could turn out to be quite difficult.</p>", "created": "2018-03-18T00:19:55Z", "subject": "", "uid_a": "a_1"}], "id": "jew2112nx9854u", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}, {"anon": "stud", "bucket_name": "Week 3/18 - 3/24", "bucket_order": 112, "children": [], "config": {}, "created": "2018-03-20T00:17:03Z", "data": {"embed_links": null}, "folders": [], "id": "jeywt1qcalf7j3", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Took the in-class version last summer (2017), so here&#39;s some food for thought. </p>\n<p></p>\n<p>The section/lecture I was placed in had a very good professor who lectured clearly, made sure the homework assignments were full of quality problems and not a waste of time to do, and wrote fair exams. The pace was fine so long as you were willing to review lecture material the same day afterwards (not letting conceptual problems build) and spread the problem set out throughout the week. Our professor was nice enough also to hold office hours twice a week on his own time for any conceptual problems with the class.</p>\n<p>Problem sets were once a week at the end of week covering all lecture material for the week, and quizzes were once a week on Fridays. Lectures were 5 days a week and section was 5 days a week immediately afterwards, for a total of 2 hours a day. We had 2 midterms and a final exam.</p>\n<p>At the end, the class was not curved harshly and I believe nobody in the 30 person class did worse than a B-. I myself earned an A- despite not scoring spectacularly above average (I was slightly above the median on all exams--fractions of SD&#39;s). During the semester this would&#39;ve likely meant a B for reference.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_3", "updated": "2018-03-20T00:17:03Z"}], "config": {}, "created": "2018-03-17T23:21:35Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["peer_directed"], "history": [{"anon": "stud", "content": "<p>Hi!</p>\n<p></p>\n<p>I&#39;m planning on taking Math 53 over the summer at UC Berkeley. I know that there is an in-class option and an online version of the class. Does anyone have any suggestions on which one is better or any pros/cons for both? I would really appreciate any feedback!</p>", "created": "2018-03-17T23:21:35Z", "subject": "Taking Math 53 &#64; Berkeley Summer", "uid_a": "a_0"}], "i_edits": [], "id": "jevzy0sa56m13i", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 6365, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654549986373, "tag_good": [], "tag_good_arr": [], "tags": ["peer_directed", "student"], "type": "question", "unique_views": 375}