{"bookmarked": 3, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "jf4dphtfk5p1uh", "type": "create", "uid": "hz4ud741s6s1gn", "when": "2018-03-23T20:09:02Z"}, {"anon": "no", "data": "jf4dpkf3pjd1xg", "type": "update", "uid": "hz4ud741s6s1gn", "when": "2018-03-23T20:09:05Z"}, {"anon": "no", "data": "jfeiauzaasw20d", "type": "update", "uid": "hz4ud741s6s1gn", "when": "2018-03-30T22:15:19Z"}], "children": [], "config": {}, "created": "2018-03-23T20:09:02Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements"], "history": [{"anon": "no", "content": "<p></p><h2>Seeking Photographer for CalDay</h2>\n<p dir=\"ltr\">The department will be hosting 25&#43; events on CalDay (Saturday, April 21st). I am looking for two volunteers who would be available to take pictures on that day. Events will be happening 9am-3pm. You might be available for a half-day, or just a couple of hours. Preferably, you have your own camera. If not, smart phone pictures should be sufficient. Please send me an email (nicolemcintyre&#64;eecs.berkeley.edu) or respond if you&#39;re interested. Lunch provided. </p>\n<h2>Seeking L&amp;S CS Intended or ​Declared Junior Transfer students</h2>\n<p dir=\"ltr\">We are currently seeking L&amp;S Computer Science students that were originally junior transfers to serve on two important panels:</p>\n<ol><li>\n<p dir=\"ltr\">​CalDay: We&#39;ll be having a student perspective panel 2-3pm on CalDay​ (April 21st). We&#39;re looking for some transfer perspectives to ensure that transfers in the crowd also hear about their future experiences. </p>\n</li><li>\n<p dir=\"ltr\">Community College Admit Day: Each year, the EECS Center for Student Affairs hosts an event for admitted junior transfer students. This is an opportunity for these students to learn more about the campus and meet their peers, advisors, and faculty. The panel will be at 10:15 on  Friday, May 4th. Breakfast and lunch will be provided.</p>\n</li></ol>\n<p> </p>\n<p dir=\"ltr\">Please email Nicole Evans McIntyre &lt;nicolemcintyre&#64;eecs.berkeley.edu&gt; if interested in serving on either panel</p>\n<h2>Engineering Commencement Registration - Now Open!</h2>\n<p dir=\"ltr\">The College of Engineering Spring 2018 Commencement ceremonies will be held on Tuesday, May 15 at the Greek Theatre on the UC Berkeley campus at the following times: </p>\n<ul><li>\n<p dir=\"ltr\">Masters &amp; Ph.D. candidates: 9 – 11:30 a.m.</p>\n</li><li>\n<p dir=\"ltr\">Baccalaureate candidates: 2 - 4 p.m. </p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Registration is available online at <a href=\"http://engineering.berkeley.edu/commencement\">http://engineering.berkeley.edu/commencement</a>. The deadline to register and have your name included in the printed program is Friday, April 20, 2018.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">After completing the online registration form, follow the link provided to the Cal Performances website to purchase your guest tickets. Graduates do not need a ticket to participate, but do need a Registration Card.  More details to come on where/when to pick up your Registration Card. Guest tickets are $5 each and all guests (regardless of age) must have a ticket for entry. May 8 is the last day to purchase guest tickets online. All commencement ticket sales are final. No refunds, no exceptions. Tickets should be treated like cash; they cannot be replaced if lost, stolen, damaged, or otherwise rendered unreadable. </p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">More information regarding commencement tickets, caps and gowns, transportation, disabled accommodation requests, diplomas, pictures, etc. is all on the commencement <a href=\"http://engineering.berkeley.edu/commencement\">web page</a>. If you need any further information please do not hesitate to contact us at bears&#64;berkeley.edu.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Congratulations on your graduation!</p>\n<h2>Introducing the Summer Minor in the Digital Humanities</h2>\n<p dir=\"ltr\">The digital and data revolutions have transformed our world. For students of the humanities, these revolutions have made new kinds of study possible. In our Summer Minor in the Digital Humanities, students explore questions about art and culture using digital tools. They learn how to design dynamic projects on digital platforms, using tools like text analysis, visualization, and data mapping. These cutting-edge techniques allow students to investigate subjects in the humanities in new and fascinating ways, and to develop work that is communicable and relevant in today’s digital world. </p>\n<p> </p>\n<p dir=\"ltr\">Take 2 required core courses:</p>\n<ul><li>\n<p dir=\"ltr\">DigHum 100: Theory and Methods in the Digital Humanities</p>\n</li><li>\n<p dir=\"ltr\">DigHum 101: Practicing the Digital Humanities</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Choose 3 electives:</p>\n<ul><li>\n<p dir=\"ltr\">DigHum 150A: Immersive Digital Archives: Cultural Heritage and the Future of Digital Humanities</p>\n</li><li>\n<p dir=\"ltr\">DigHum 150A: Digital Ancient Near East</p>\n</li><li>\n<p dir=\"ltr\">DigHum 150B: Digital Humanities and Visual and Spatial Analysis: Maps, Graphs &amp; Letters</p>\n</li><li>\n<p dir=\"ltr\">DigHum 150C: Digital Humanities and Textual and Language Analysis: Intro to Computational Literary Analysis</p>\n</li><li>\n<p dir=\"ltr\">DigHum 160: Digital Hermeneutics: Close, Distant, Machine Reading</p>\n</li><li>\n<p dir=\"ltr\">DigHum 160: Critical Digital Humanities: The Digital (Counter)Archive</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Topic Modeling is a tool of the Digital Humanities</p>\n<p dir=\"ltr\">Scholarships are available for UC Berkeley students who complete the minor in Summer 2018 or Summer 2019.</p>\n<p> </p>\n<p dir=\"ltr\">For more information, visit https://summerdigitalhumanities.berkeley.edu/ or contact us at <a href=\"mailto:summerdigitalhumanities&#64;berkeley.edu\">summerdigitalhumanities&#64;berkeley.edu</a>.</p>\n<h2>CalTeach Program Outreach</h2>\n<p dir=\"ltr\">CalTeach is a program for undergraduate STEM majors interested in exploring a career in education. Our courses explore effective teaching practices and give students the opportunity to apply those practices in local K-12 classrooms.  Through our course pathway, students can earn a Science and Math Education minor while completing both a bachelor&#39;s degree and earning a California Preliminary Teaching Credential as an undergraduate. </p>\n<p> </p>\n<p dir=\"ltr\">How can students begin pursuing our CalTeach minor and teaching credential? To get started, this coming Summer 2018 and Fall 2018 we will be offering our 2 unit introductory course, UGIS 82. This course allows students to gain hands-on teaching experience, develop lesson planning skills, learn classroom management skills and more. Aside from the aforementioned benefits of the CalTeach Program, we also offer other opportunities such as our Summer Research Institute, Robert Noyce Scholarship, and Summer Internships.</p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://calteach.berkeley.edu/scholarships-and-opportunities/summer-research-institute.php\">Summer Research Institute</a>: a nine-week program in which participants conduct research in campus or nearby labs while also taking a seminar series which focuses on methods to bring research skills into K-12 classrooms </p>\n<p dir=\"ltr\">Application Deadline: March 15</p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://calteach.berkeley.edu/scholarships-and-opportunities/scholarships/noyce-scholarship.php\">Robert Noyce Scholarship</a>: recognizes students that plan on teaching math or science in a high-need school district with up to $5,000 per semester or $10,000 per academic year. </p>\n<p dir=\"ltr\">Application Deadline:  December 1st </p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://calteach.berkeley.edu/scholarships-and-opportunities/undergraduate-internships-and-employment/summer-break-internships.php\">Summer Internships:</a> CalTeach offers paid summer internships. Interns work with K-12 students, and sometimes teachers, in summer activities that focus on math, science and engineering. Past interns have worked at: Lawrence Hall of Science, Bay Area Discovery Museum, Oakland Zoo, and the Exploratorium. </p>\n<p> </p>\n<p dir=\"ltr\">If students would like more information about this program they can make an appointment with the CalTeach Peer Advisors or Jessica Jones, the Student Services Coordinator. </p>\n<p> </p>\n<p dir=\"ltr\">Advising Hours</p>\n<p> </p>\n<p dir=\"ltr\">CalTeach Peer Advisors - 30 Evans </p>\n<p dir=\"ltr\">Monday 1:00 – 2:30 PM</p>\n<p dir=\"ltr\">Tuesday 10:30 – 12:30 PM </p>\n<p dir=\"ltr\">Wednesday 12:00 – 2:00 PM</p>\n<p dir=\"ltr\">Thursday 10:30 – 12:30 PM </p>\n<p dir=\"ltr\">Friday 2:30-4:00 PM </p>\n<h2>Leslie Lipson Essay Prize</h2>\n<p dir=\"ltr\">The Leslie Lipson Program at UC Berkeley is intended to encourage undergraduate students (first year freshmen/continuing second year sophomores) to study humanistic values and their practical application for individuals, societies, and states; the program consists of the Lipson Essay Prize, the Lipson Scholarship, and the Lipson Research Grant.  I am attaching the Lipson flyer for 17-18 and hope you will consider forwarding to your first and second year students, faculty and staff for review.</p>\n<p> </p>\n<p dir=\"ltr\">You can read more about the program at: <a href=\"http://financialaid.berkeley.edu/prizes-and-honors-lipson-program\">http://financialaid.berkeley.edu/prizes-and-honors-lipson-program</a>  </p>\n<h2>Undergraduate Essay Contest</h2>\n<p dir=\"ltr\"><img src=\"https://lh5.googleusercontent.com/0SItNIQQ6bKY5Z8N1IqFa7m5DNYeh7N_l3ohC1AFKnpzxODkn30Rm_fErGdaKWKLbppiPBDer8lcDpxQEPFuKChar9LZru-gm7iB6IKDNamFStvcdQ7onCgFkxZW2ADzaISA0L8p\" width=\"486\" height=\"751\" /></p>\n<h2>Call for SkyDeck Applications</h2>\n<p dir=\"ltr\">Berkeley SkyDeck is now accepting applications for its Fall 2018 cohort through March 30, 2018. Accepted startups will be eligible to receive funding for up to $100,000 from the Berkeley SkyDeck Fund and additional in-kind resources. Go <a href=\"http://skydeck.berkeley.edu/\">here</a> to apply. If you have questions, contact Berkeley SkyDeck <a href=\"http://skydeck.berkeley.edu/contact/\">here</a>.</p>\n<p> </p>\n<p dir=\"ltr\">To be eligible to apply, a startup team member must be affiliated with UC Berkeley, Berkeley Lab, or UC San Francisco. An affiliate can be a current student, alum, faculty, staff, postdoc researcher, or visiting scholar.</p>\n<h2>Berkeley Center for New Media&#39;s Summer 2018 Classes</h2>\n<p dir=\"ltr\">NWMEDIA R1B: What is an &#64;uthor?</p>\n<p dir=\"ltr\">Session D | MTWR | 11 AM — 1:30 PM  | GPB 107</p>\n<p dir=\"ltr\">Justin Berner</p>\n<p dir=\"ltr\">If a robot wrote a poem, could it break your heart? If a text has no beginning and no end, who decides how it should be read? If a blog is written by a fictional persona, who do we define as the author? Using a combination of print and electronic literature, this course will explore the preceding questions as part of a more general investigation on what it means to be an author in the 21st Century. Throughout the seminar, while challenging traditional and preconceived notions regarding what it means to be “an author,” students will use the literary and theoretical works as a means of understanding how to become a more effective writer.</p>\n<p> </p>\n<p dir=\"ltr\">NWMEDIA R1B: Is Technology Evil?</p>\n<p dir=\"ltr\">Session D | MTWR | 11 AM — 2 PM  | Dwinelle 215</p>\n<p dir=\"ltr\">Nicholaus Gutierrez</p>\n<p dir=\"ltr\">Digital Technology has profoundly influenced the ways we live, work and play. From the “disruptive innovations” of the sharing economy to workplace automatization, from social media to streaming entertainment, the standard narrative of new media and technologies tends to be aspirational: digital networks democratize access, increase efficiency and make life more convenient — in short, they change the world, usually for the better. But is the reality of this new technological world purely positive or does with it pose some problems as well?</p>\n<p dir=\"ltr\">In this course, we will practice the skills of college level writing and research by carefully questioning popular narratives of digital technology. Do the mass media make us into zombie consumers? Do social media cause isolation? Do search engine algorithms create filter bubbles that polarize culture? We will think about the role of mass media in the production of consuming subjects, of the representations of race, gender and sexuality in new media, of the nature and role of aesthetics and design in contemporary life.</p>\n<p> </p>\n<p dir=\"ltr\">NWMEDIA 90: Movies and/as Media?</p>\n<p dir=\"ltr\">Session A | MWF | 10 AM — 1 PM  | 340 Moffitt</p>\n<p dir=\"ltr\">Kaitlin Forcier</p>\n<p dir=\"ltr\">At the beginning of the twentieth century the “new media” was film: heralded as the artistic medium for the industrial age, cinema became a nexus for anxieties and aspirations surrounding the cultural and social transformations wrought by modernity. At the beginning of the twenty-first century, as moving images migrate to the digital and the medium of film itself is transformed, film provides a productive site for theorizing media at moments of emergence. Moreover, since the very beginning (from technological pioneers such as Mélèis, to auteurs such as Stanley Kubrick and George Lucas, to the digital innovations of films such as The Matrix, Avatar, and Gravity), cinema has explored, formally and thematically, what new technologies mean for society.</p>\n<h2>Explore the Wonders of Ancient Egypt &amp; Earn College Credit this Summer!</h2>\n<p dir=\"ltr\"><a href=\"http://classes.berkeley.edu/content/2018-summer-nestud-18-001-lec-001\">From Pyramids to Mummies: Explore the Wonders of Ancient Egypt</a></p>\n<p dir=\"ltr\"><a href=\"http://classes.berkeley.edu/content/2018-summer-nestud-18-001-lec-001\"><img src=\"https://lh3.googleusercontent.com/cZLPuJIQTPgYr5I5JY849zA4zb-m3H548W1JC7q1UuzEEu7zDh960nacppw3Jw17pYugxJjtEWk8NAKYNoeLn038Wr-NFWySjbTTHKfEuT5aKEj4Qxz7qdIMFfYhBL1F-XAYYBxp\" width=\"520\" height=\"804\" /></a></p>\n<h2>Apply for a Public Service Scholarship or Internship for next year</h2>\n<p dir=\"ltr\">SERVICE SCHOLARSHIPS</p>\n<p dir=\"ltr\">The Peter E. Haas Public Service Leaders Program gives need-based scholarships of $2,000-$6,000 to undergrads committed to off-campus service. If you&#39;ve been doing community-based service work or want to start, take a look! Deadline to apply: March 31</p>\n<p> </p>\n<p dir=\"ltr\">PUBLIC SERVICE INTERNSHIPS</p>\n<p dir=\"ltr\">Also accepting applications for students to intern with local government and community nonprofit agencies. Deadline to apply: March 31</p>\n<p> </p>\n<p dir=\"ltr\">SUMMER READING MENTOR JOBS</p>\n<p dir=\"ltr\">Help youth keep their literacy skills over the summer as a mentor with Summer BUILD. Pay is $13.75/hour in Work Study or Education units. Priority deadline: April 25</p>\n<p> </p>\n<p dir=\"ltr\">All applications are online at <a href=\"http://publicservice.berkeley.edu/\">http://publicservice.berkeley.edu/</a> If you have any questions, please get in touch at <a href=\"http://publicservice&#64;berkeley.edu/\">publicservice&#64;berkeley.edu</a> or drop in at 218 Eshleman.</p>\n<h2>Become a TEALS volunteer and change a life</h2>\n<p dir=\"ltr\">If you’re looking for a way to harness your computer science (CS) skills and make a difference for students, we invite you to become a Technology Education and Literacy in Schools (TEALS) volunteer. </p>\n<p> </p>\n<p dir=\"ltr\">Computer science is a vital driver in today’s global innovation economy, but most U.S. high schools are unable to offer rigorous CS courses. Without CS in high schools, our students are missing out on essential computational skills that will help them succeed in any career they wish to pursue, and professional skills that could lead to an economically secure future.</p>\n<p> </p>\n<p dir=\"ltr\">The <a href=\"https://www.tealsk12.org/volunteers/\">TEALS program</a> seeks to change that reality.</p>\n<p> </p>\n<p dir=\"ltr\">Our volunteers work directly with classroom teachers to help them build and grow their CS teaching capacity through yearlong support and training to inspire the next generation of computer scientists. If you’re interested in the opportunity to help shape students’ career opportunities – all while having fun – TEALS is the right fit for you.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Learn more and apply at <a href=\"https://www.tealsk12.org/volunteers/\">tealsk12.org/volunteers</a></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">RSVP for one of our Bay Area Info Sessions below. Free food and drinks will be provided!</p>\n<div dir=\"ltr\">\n<table><tbody><tr><td>\n<p dir=\"ltr\">Location</p>\n</td><td>\n<p dir=\"ltr\">Date &amp; Time</p>\n</td></tr><tr><td>\n<p dir=\"ltr\">San Francisco</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018DirtyWaterSF\">Dirty Water (1355 Market St)</a></p>\n</td><td>\n<p dir=\"ltr\">Tuesday, April 3rd</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr><tr><td>\n<p dir=\"ltr\">San Francisco</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018LinkedInSF\">LinkedIn (222 2nd St)</a></p>\n</td><td>\n<p dir=\"ltr\"> Wednesday, April 4th</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr><tr><td>\n<p dir=\"ltr\"> Sunnyvale</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018LinkedInSunnyvale\">LinkedIn (1000 W Maude Ave)</a></p>\n</td><td>\n<p dir=\"ltr\">Wednesday, April 4th</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr><tr><td>\n<p dir=\"ltr\">Sunnyvale</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018MicrosoftSunnyvale\">Microsoft (1020 Enterprise Way)</a></p>\n</td><td>\n<p dir=\"ltr\"> Thursday, April 5th</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr><tr><td>\n<p dir=\"ltr\">Oakland</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018KaporCenterOakland\">Kapor Center (2148 Broadway)</a></p>\n</td><td>\n<p dir=\"ltr\">Tuesday, April 10th</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr><tr><td>\n<p dir=\"ltr\">Hayward</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018AlamedaCOEHayward\">Alameda County Office of Education (313 W Winton Ave)</a></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Unfortunately, no alcoholic beverages will be served at this venue.</p>\n</td><td>\n<p dir=\"ltr\">Thursday, April 12th</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr></tbody></table>\n</div>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Together, we can help build CS programs at high schools across the U.S. to empower the next generation of innovators. If you have more questions, please contact kathlynn&#64;tealsk12.org. We’re eager to have more volunteers and happy to answer any remaining questions you may have!</p>\n<p><br /><br /></p>", "created": "2018-03-30T22:15:19Z", "subject": "Week 10: Undergraduate Announcements", "uid": "hz4ud741s6s1gn"}, {"anon": "no", "content": "<p></p><h2>Seeking Photographer for CalDay</h2>\n<p dir=\"ltr\">The department will be hosting 25&#43; events on CalDay (Saturday, April 21st). I am looking for two volunteers who would be available to take pictures on that day. Events will be happening 9am-3pm. You might be available for a half-day, or just a couple of hours. Preferably, you have your own camera. If not, smart phone pictures should be sufficient. Please send me an email (nicolemcintyre&#64;eecs.berkeley.edu) or respond if you&#39;re interested. Lunch provided. </p>\n<h2>Seeking L&amp;S CS Intended or ​Declared Junior Transfer students</h2>\n<p dir=\"ltr\">We are currently seeking L&amp;S Computer Science students that were originally junior transfers to serve on two important panels:</p>\n<ol><li>\n<p dir=\"ltr\">​CalDay: We&#39;ll be having a student perspective panel 2-3pm on CalDay​ (April 21st). We&#39;re looking for some transfer perspectives to ensure that transfers in the crowd also hear about their future experiences. </p>\n</li><li>\n<p dir=\"ltr\">Community College Admit Day: Each year, the EECS Center for Student Affairs hosts an event for admitted junior transfer students. This is an opportunity for these students to learn more about the campus and meet their peers, advisors, and faculty. The panel will be at 10:15 on  Friday, May 4th. Breakfast and lunch will be provided.</p>\n</li></ol>\n<p> </p>\n<p dir=\"ltr\">Please email Nicole Evans McIntyre &lt;nicolemcintyre&#64;eecs.berkeley.edu&gt; if interested in serving on either panel</p>\n<h2>Engineering Commencement Registration - Now Open!</h2>\n<p dir=\"ltr\">The College of Engineering Spring 2018 Commencement ceremonies will be held on Tuesday, May 15 at the Greek Theatre on the UC Berkeley campus at the following times: </p>\n<ul><li>\n<p dir=\"ltr\">Masters &amp; Ph.D. candidates: 9 – 11:30 a.m.</p>\n</li><li>\n<p dir=\"ltr\">Baccalaureate candidates: 2 - 4 p.m. </p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Registration is available online at <a href=\"http://engineering.berkeley.edu/commencement\">http://engineering.berkeley.edu/commencement</a>. The deadline to register and have your name included in the printed program is Friday, April 20, 2018.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">After completing the online registration form, follow the link provided to the Cal Performances website to purchase your guest tickets. Graduates do not need a ticket to participate, but do need a Registration Card.  More details to come on where/when to pick up your Registration Card. Guest tickets are $5 each and all guests (regardless of age) must have a ticket for entry. May 8 is the last day to purchase guest tickets online. All commencement ticket sales are final. No refunds, no exceptions. Tickets should be treated like cash; they cannot be replaced if lost, stolen, damaged, or otherwise rendered unreadable. </p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">More information regarding commencement tickets, caps and gowns, transportation, disabled accommodation requests, diplomas, pictures, etc. is all on the commencement <a href=\"http://engineering.berkeley.edu/commencement\">web page</a>. If you need any further information please do not hesitate to contact us at bears&#64;berkeley.edu.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Congratulations on your graduation!</p>\n<h2>Introducing the Summer Minor in the Digital Humanities</h2>\n<p dir=\"ltr\">The digital and data revolutions have transformed our world. For students of the humanities, these revolutions have made new kinds of study possible. In our Summer Minor in the Digital Humanities, students explore questions about art and culture using digital tools. They learn how to design dynamic projects on digital platforms, using tools like text analysis, visualization, and data mapping. These cutting-edge techniques allow students to investigate subjects in the humanities in new and fascinating ways, and to develop work that is communicable and relevant in today’s digital world. </p>\n<p> </p>\n<p dir=\"ltr\">Take 2 required core courses:</p>\n<ul><li>\n<p dir=\"ltr\">DigHum 100: Theory and Methods in the Digital Humanities</p>\n</li><li>\n<p dir=\"ltr\">DigHum 101: Practicing the Digital Humanities</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Choose 3 electives:</p>\n<ul><li>\n<p dir=\"ltr\">DigHum 150A: Immersive Digital Archives: Cultural Heritage and the Future of Digital Humanities</p>\n</li><li>\n<p dir=\"ltr\">DigHum 150A: Digital Ancient Near East</p>\n</li><li>\n<p dir=\"ltr\">DigHum 150B: Digital Humanities and Visual and Spatial Analysis: Maps, Graphs &amp; Letters</p>\n</li><li>\n<p dir=\"ltr\">DigHum 150C: Digital Humanities and Textual and Language Analysis: Intro to Computational Literary Analysis</p>\n</li><li>\n<p dir=\"ltr\">DigHum 160: Digital Hermeneutics: Close, Distant, Machine Reading</p>\n</li><li>\n<p dir=\"ltr\">DigHum 160: Critical Digital Humanities: The Digital (Counter)Archive</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Topic Modeling is a tool of the Digital Humanities</p>\n<p dir=\"ltr\">Scholarships are available for UC Berkeley students who complete the minor in Summer 2018 or Summer 2019.</p>\n<p> </p>\n<p dir=\"ltr\">For more information, visit https://summerdigitalhumanities.berkeley.edu/ or contact us at <a href=\"mailto:summerdigitalhumanities&#64;berkeley.edu\">summerdigitalhumanities&#64;berkeley.edu</a>.</p>\n<h2>CalTeach Program Outreach</h2>\n<p dir=\"ltr\">CalTeach is a program for undergraduate STEM majors interested in exploring a career in education. Our courses explore effective teaching practices and give students the opportunity to apply those practices in local K-12 classrooms.  Through our course pathway, students can earn a Science and Math Education minor while completing both a bachelor&#39;s degree and earning a California Preliminary Teaching Credential as an undergraduate. </p>\n<p> </p>\n<p dir=\"ltr\">How can students begin pursuing our CalTeach minor and teaching credential? To get started, this coming Summer 2018 and Fall 2018 we will be offering our 2 unit introductory course, UGIS 82. This course allows students to gain hands-on teaching experience, develop lesson planning skills, learn classroom management skills and more. Aside from the aforementioned benefits of the CalTeach Program, we also offer other opportunities such as our Summer Research Institute, Robert Noyce Scholarship, and Summer Internships.</p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://calteach.berkeley.edu/scholarships-and-opportunities/summer-research-institute.php\">Summer Research Institute</a>: a nine-week program in which participants conduct research in campus or nearby labs while also taking a seminar series which focuses on methods to bring research skills into K-12 classrooms </p>\n<p dir=\"ltr\">Application Deadline: March 15</p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://calteach.berkeley.edu/scholarships-and-opportunities/scholarships/noyce-scholarship.php\">Robert Noyce Scholarship</a>: recognizes students that plan on teaching math or science in a high-need school district with up to $5,000 per semester or $10,000 per academic year. </p>\n<p dir=\"ltr\">Application Deadline:  December 1st </p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://calteach.berkeley.edu/scholarships-and-opportunities/undergraduate-internships-and-employment/summer-break-internships.php\">Summer Internships:</a> CalTeach offers paid summer internships. Interns work with K-12 students, and sometimes teachers, in summer activities that focus on math, science and engineering. Past interns have worked at: Lawrence Hall of Science, Bay Area Discovery Museum, Oakland Zoo, and the Exploratorium. </p>\n<p> </p>\n<p dir=\"ltr\">If students would like more information about this program they can make an appointment with the CalTeach Peer Advisors or Jessica Jones, the Student Services Coordinator. </p>\n<p> </p>\n<p dir=\"ltr\">Advising Hours</p>\n<p> </p>\n<p dir=\"ltr\">CalTeach Peer Advisors - 30 Evans </p>\n<p dir=\"ltr\">Monday 1:00 – 2:30 PM</p>\n<p dir=\"ltr\">Tuesday 10:30 – 12:30 PM </p>\n<p dir=\"ltr\">Wednesday 12:00 – 2:00 PM</p>\n<p dir=\"ltr\">Thursday 10:30 – 12:30 PM </p>\n<p dir=\"ltr\">Friday 2:30-4:00 PM </p>\n<h2>Leslie Lipson Essay Prize</h2>\n<p dir=\"ltr\">The Leslie Lipson Program at UC Berkeley is intended to encourage undergraduate students (first year freshmen/continuing second year sophomores) to study humanistic values and their practical application for individuals, societies, and states; the program consists of the Lipson Essay Prize, the Lipson Scholarship, and the Lipson Research Grant.  I am attaching the Lipson flyer for 17-18 and hope you will consider forwarding to your first and second year students, faculty and staff for review.</p>\n<p> </p>\n<p dir=\"ltr\">You can read more about the program at: <a href=\"http://financialaid.berkeley.edu/prizes-and-honors-lipson-program\">http://financialaid.berkeley.edu/prizes-and-honors-lipson-program</a>  </p>\n<h2>Undergraduate Essay Contest</h2>\n<p dir=\"ltr\"><img src=\"https://lh5.googleusercontent.com/0SItNIQQ6bKY5Z8N1IqFa7m5DNYeh7N_l3ohC1AFKnpzxODkn30Rm_fErGdaKWKLbppiPBDer8lcDpxQEPFuKChar9LZru-gm7iB6IKDNamFStvcdQ7onCgFkxZW2ADzaISA0L8p\" width=\"486\" height=\"751\" /></p>\n<h2>Call for SkyDeck Applications</h2>\n<p dir=\"ltr\">Berkeley SkyDeck is now accepting applications for its Fall 2018 cohort through March 30, 2018. Accepted startups will be eligible to receive funding for up to $100,000 from the Berkeley SkyDeck Fund and additional in-kind resources. Go <a href=\"http://skydeck.berkeley.edu/\">here</a> to apply. If you have questions, contact Berkeley SkyDeck <a href=\"http://skydeck.berkeley.edu/contact/\">here</a>.</p>\n<p> </p>\n<p dir=\"ltr\">To be eligible to apply, a startup team member must be affiliated with UC Berkeley, Berkeley Lab, or UC San Francisco. An affiliate can be a current student, alum, faculty, staff, postdoc researcher, or visiting scholar.</p>\n<h2>Berkeley Center for New Media&#39;s Summer 2018 Classes</h2>\n<p dir=\"ltr\">NWMEDIA R1B: What is an &#64;uthor?</p>\n<p dir=\"ltr\">Session D | MTWR | 11 AM — 1:30 PM  | GPB 107</p>\n<p dir=\"ltr\">Justin Berner</p>\n<p dir=\"ltr\">If a robot wrote a poem, could it break your heart? If a text has no beginning and no end, who decides how it should be read? If a blog is written by a fictional persona, who do we define as the author? Using a combination of print and electronic literature, this course will explore the preceding questions as part of a more general investigation on what it means to be an author in the 21st Century. Throughout the seminar, while challenging traditional and preconceived notions regarding what it means to be “an author,” students will use the literary and theoretical works as a means of understanding how to become a more effective writer.</p>\n<p> </p>\n<p dir=\"ltr\">NWMEDIA R1B: Is Technology Evil?</p>\n<p dir=\"ltr\">Session D | MTWR | 11 AM — 2 PM  | Dwinelle 215</p>\n<p dir=\"ltr\">Nicholaus Gutierrez</p>\n<p dir=\"ltr\">Digital Technology has profoundly influenced the ways we live, work and play. From the “disruptive innovations” of the sharing economy to workplace automatization, from social media to streaming entertainment, the standard narrative of new media and technologies tends to be aspirational: digital networks democratize access, increase efficiency and make life more convenient — in short, they change the world, usually for the better. But is the reality of this new technological world purely positive or does with it pose some problems as well?</p>\n<p dir=\"ltr\">In this course, we will practice the skills of college level writing and research by carefully questioning popular narratives of digital technology. Do the mass media make us into zombie consumers? Do social media cause isolation? Do search engine algorithms create filter bubbles that polarize culture? We will think about the role of mass media in the production of consuming subjects, of the representations of race, gender and sexuality in new media, of the nature and role of aesthetics and design in contemporary life.</p>\n<p> </p>\n<p dir=\"ltr\">NWMEDIA 90: Movies and/as Media?</p>\n<p dir=\"ltr\">Session A | MWF | 10 AM — 1 PM  | 340 Moffitt</p>\n<p dir=\"ltr\">Kaitlin Forcier</p>\n<p dir=\"ltr\">At the beginning of the twentieth century the “new media” was film: heralded as the artistic medium for the industrial age, cinema became a nexus for anxieties and aspirations surrounding the cultural and social transformations wrought by modernity. At the beginning of the twenty-first century, as moving images migrate to the digital and the medium of film itself is transformed, film provides a productive site for theorizing media at moments of emergence. Moreover, since the very beginning (from technological pioneers such as Mélèis, to auteurs such as Stanley Kubrick and George Lucas, to the digital innovations of films such as The Matrix, Avatar, and Gravity), cinema has explored, formally and thematically, what new technologies mean for society.</p>\n<h2>Explore the Wonders of Ancient Egypt &amp; Earn College Credit this Summer!</h2>\n<p dir=\"ltr\"><a href=\"http://classes.berkeley.edu/content/2018-summer-nestud-18-001-lec-001\">From Pyramids to Mummies: Explore the Wonders of Ancient Egypt</a></p>\n<p dir=\"ltr\"><a href=\"http://classes.berkeley.edu/content/2018-summer-nestud-18-001-lec-001\"><img src=\"https://lh3.googleusercontent.com/cZLPuJIQTPgYr5I5JY849zA4zb-m3H548W1JC7q1UuzEEu7zDh960nacppw3Jw17pYugxJjtEWk8NAKYNoeLn038Wr-NFWySjbTTHKfEuT5aKEj4Qxz7qdIMFfYhBL1F-XAYYBxp\" width=\"520\" height=\"804\" /></a></p>\n<h2>Apply for a Public Service Scholarship or Internship for next year</h2>\n<p dir=\"ltr\">SERVICE SCHOLARSHIPS</p>\n<p dir=\"ltr\">The Peter E. Haas Public Service Leaders Program gives need-based scholarships of $2,000-$6,000 to undergrads committed to off-campus service. If you&#39;ve been doing community-based service work or want to start, take a look! Deadline to apply: March 31</p>\n<p> </p>\n<p dir=\"ltr\">PUBLIC SERVICE INTERNSHIPS</p>\n<p dir=\"ltr\">Also accepting applications for students to intern with local government and community nonprofit agencies. Deadline to apply: March 31</p>\n<p> </p>\n<p dir=\"ltr\">SUMMER READING MENTOR JOBS</p>\n<p dir=\"ltr\">Help youth keep their literacy skills over the summer as a mentor with Summer BUILD. Pay is $13.75/hour in Work Study or Education units. Priority deadline: April 25</p>\n<p> </p>\n<p dir=\"ltr\">All applications are online at <a href=\"http://publicservice.berkeley.edu/\">http://publicservice.berkeley.edu/</a> If you have any questions, please get in touch at <a href=\"http://publicservice&#64;berkeley.edu/\">publicservice&#64;berkeley.edu</a> or drop in at 218 Eshleman.</p>\n<h2>Become a TEALS volunteer and change a life</h2>\n<p dir=\"ltr\">If you’re looking for a way to harness your computer science (CS) skills and make a difference for students, we invite you to become a Technology Education and Literacy in Schools (TEALS) volunteer. </p>\n<p> </p>\n<p dir=\"ltr\">Computer science is a vital driver in today’s global innovation economy, but most U.S. high schools are unable to offer rigorous CS courses. Without CS in high schools, our students are missing out on essential computational skills that will help them succeed in any career they wish to pursue, and professional skills that could lead to an economically secure future.</p>\n<p> </p>\n<p dir=\"ltr\">The <a href=\"https://www.tealsk12.org/volunteers/\">TEALS program</a> seeks to change that reality.</p>\n<p> </p>\n<p dir=\"ltr\">Our volunteers work directly with classroom teachers to help them build and grow their CS teaching capacity through yearlong support and training to inspire the next generation of computer scientists. If you’re interested in the opportunity to help shape students’ career opportunities – all while having fun – TEALS is the right fit for you.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Learn more and apply at <a href=\"https://www.tealsk12.org/volunteers/\">tealsk12.org/volunteers</a></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">RSVP for one of our Bay Area Info Sessions below. Free food and drinks will be provided!</p>\n<div dir=\"ltr\">\n<table><tbody><tr><td>\n<p dir=\"ltr\">Location</p>\n</td><td>\n<p dir=\"ltr\">Date &amp; Time</p>\n</td></tr><tr><td>\n<p dir=\"ltr\">San Francisco</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018DirtyWaterSF\">Dirty Water (1355 Market St)</a></p>\n</td><td>\n<p dir=\"ltr\">Tuesday, April 3rd</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr><tr><td>\n<p dir=\"ltr\">San Francisco</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018LinkedInSF\">LinkedIn (222 2nd St)</a></p>\n</td><td>\n<p dir=\"ltr\"> Wednesday, April 4th</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr><tr><td>\n<p dir=\"ltr\"> Sunnyvale</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018LinkedInSunnyvale\">LinkedIn (1000 W Maude Ave)</a></p>\n</td><td>\n<p dir=\"ltr\">Wednesday, April 4th</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr><tr><td>\n<p dir=\"ltr\">Sunnyvale</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018MicrosoftSunnyvale\">Microsoft (1020 Enterprise Way)</a></p>\n</td><td>\n<p dir=\"ltr\"> Thursday, April 5th</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr><tr><td>\n<p dir=\"ltr\">Oakland</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018KaporCenterOakland\">Kapor Center (2148 Broadway)</a></p>\n</td><td>\n<p dir=\"ltr\">Tuesday, April 10th</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr><tr><td>\n<p dir=\"ltr\">Hayward</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018AlamedaCOEHayward\">Alameda County Office of Education (313 W Winton Ave)</a></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Unfortunately, no alcoholic beverages will be served at this venue.</p>\n</td><td>\n<p dir=\"ltr\">Thursday, April 12th</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr></tbody></table>\n</div>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Together, we can help build CS programs at high schools across the U.S. to empower the next generation of innovators. If you have more questions, please contact kathlynn&#64;tealsk12.org. We’re eager to have more volunteers and happy to answer any remaining questions you may have!</p>\n<p><br /><br /></p>\n#pin", "created": "2018-03-23T20:09:05Z", "subject": "Week 10: Undergraduate Announcements", "uid": "hz4ud741s6s1gn"}, {"anon": "no", "content": "<p></p><h2>Seeking Photographer for CalDay</h2>\n<p dir=\"ltr\">The department will be hosting 25&#43; events on CalDay (Saturday, April 21st). I am looking for two volunteers who would be available to take pictures on that day. Events will be happening 9am-3pm. You might be available for a half-day, or just a couple of hours. Preferably, you have your own camera. If not, smart phone pictures should be sufficient. Please send me an email (nicolemcintyre&#64;eecs.berkeley.edu) or respond if you&#39;re interested. Lunch provided. </p>\n<h2>Seeking L&amp;S CS Intended or ​Declared Junior Transfer students</h2>\n<p dir=\"ltr\">We are currently seeking L&amp;S Computer Science students that were originally junior transfers to serve on two important panels:</p>\n<ol><li>\n<p dir=\"ltr\">​CalDay: We&#39;ll be having a student perspective panel 2-3pm on CalDay​ (April 21st). We&#39;re looking for some transfer perspectives to ensure that transfers in the crowd also hear about their future experiences. </p>\n</li><li>\n<p dir=\"ltr\">Community College Admit Day: Each year, the EECS Center for Student Affairs hosts an event for admitted junior transfer students. This is an opportunity for these students to learn more about the campus and meet their peers, advisors, and faculty. The panel will be at 10:15 on  Friday, May 4th. Breakfast and lunch will be provided.</p>\n</li></ol>\n<p> </p>\n<p dir=\"ltr\">Please email Nicole Evans McIntyre &lt;nicolemcintyre&#64;eecs.berkeley.edu&gt; if interested in serving on either panel</p>\n<h2>Engineering Commencement Registration - Now Open!</h2>\n<p dir=\"ltr\">The College of Engineering Spring 2018 Commencement ceremonies will be held on Tuesday, May 15 at the Greek Theatre on the UC Berkeley campus at the following times: </p>\n<ul><li>\n<p dir=\"ltr\">Masters &amp; Ph.D. candidates: 9 – 11:30 a.m.</p>\n</li><li>\n<p dir=\"ltr\">Baccalaureate candidates: 2 - 4 p.m. </p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Registration is available online at <a href=\"http://engineering.berkeley.edu/commencement\">http://engineering.berkeley.edu/commencement</a>. The deadline to register and have your name included in the printed program is Friday, April 20, 2018.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">After completing the online registration form, follow the link provided to the Cal Performances website to purchase your guest tickets. Graduates do not need a ticket to participate, but do need a Registration Card.  More details to come on where/when to pick up your Registration Card. Guest tickets are $5 each and all guests (regardless of age) must have a ticket for entry. May 8 is the last day to purchase guest tickets online. All commencement ticket sales are final. No refunds, no exceptions. Tickets should be treated like cash; they cannot be replaced if lost, stolen, damaged, or otherwise rendered unreadable. </p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">More information regarding commencement tickets, caps and gowns, transportation, disabled accommodation requests, diplomas, pictures, etc. is all on the commencement <a href=\"http://engineering.berkeley.edu/commencement\">web page</a>. If you need any further information please do not hesitate to contact us at bears&#64;berkeley.edu.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Congratulations on your graduation!</p>\n<h2>Introducing the Summer Minor in the Digital Humanities</h2>\n<p dir=\"ltr\">The digital and data revolutions have transformed our world. For students of the humanities, these revolutions have made new kinds of study possible. In our Summer Minor in the Digital Humanities, students explore questions about art and culture using digital tools. They learn how to design dynamic projects on digital platforms, using tools like text analysis, visualization, and data mapping. These cutting-edge techniques allow students to investigate subjects in the humanities in new and fascinating ways, and to develop work that is communicable and relevant in today’s digital world. </p>\n<p> </p>\n<p dir=\"ltr\">Take 2 required core courses:</p>\n<ul><li>\n<p dir=\"ltr\">DigHum 100: Theory and Methods in the Digital Humanities</p>\n</li><li>\n<p dir=\"ltr\">DigHum 101: Practicing the Digital Humanities</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Choose 3 electives:</p>\n<ul><li>\n<p dir=\"ltr\">DigHum 150A: Immersive Digital Archives: Cultural Heritage and the Future of Digital Humanities</p>\n</li><li>\n<p dir=\"ltr\">DigHum 150A: Digital Ancient Near East</p>\n</li><li>\n<p dir=\"ltr\">DigHum 150B: Digital Humanities and Visual and Spatial Analysis: Maps, Graphs &amp; Letters</p>\n</li><li>\n<p dir=\"ltr\">DigHum 150C: Digital Humanities and Textual and Language Analysis: Intro to Computational Literary Analysis</p>\n</li><li>\n<p dir=\"ltr\">DigHum 160: Digital Hermeneutics: Close, Distant, Machine Reading</p>\n</li><li>\n<p dir=\"ltr\">DigHum 160: Critical Digital Humanities: The Digital (Counter)Archive</p>\n</li></ul>\n<p> </p>\n<p dir=\"ltr\">Topic Modeling is a tool of the Digital Humanities</p>\n<p dir=\"ltr\">Scholarships are available for UC Berkeley students who complete the minor in Summer 2018 or Summer 2019.</p>\n<p> </p>\n<p dir=\"ltr\">For more information, visit https://summerdigitalhumanities.berkeley.edu/ or contact us at <a href=\"mailto:summerdigitalhumanities&#64;berkeley.edu\">summerdigitalhumanities&#64;berkeley.edu</a>.</p>\n<h2>CalTeach Program Outreach</h2>\n<p dir=\"ltr\">CalTeach is a program for undergraduate STEM majors interested in exploring a career in education. Our courses explore effective teaching practices and give students the opportunity to apply those practices in local K-12 classrooms.  Through our course pathway, students can earn a Science and Math Education minor while completing both a bachelor&#39;s degree and earning a California Preliminary Teaching Credential as an undergraduate. </p>\n<p> </p>\n<p dir=\"ltr\">How can students begin pursuing our CalTeach minor and teaching credential? To get started, this coming Summer 2018 and Fall 2018 we will be offering our 2 unit introductory course, UGIS 82. This course allows students to gain hands-on teaching experience, develop lesson planning skills, learn classroom management skills and more. Aside from the aforementioned benefits of the CalTeach Program, we also offer other opportunities such as our Summer Research Institute, Robert Noyce Scholarship, and Summer Internships.</p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://calteach.berkeley.edu/scholarships-and-opportunities/summer-research-institute.php\">Summer Research Institute</a>: a nine-week program in which participants conduct research in campus or nearby labs while also taking a seminar series which focuses on methods to bring research skills into K-12 classrooms </p>\n<p dir=\"ltr\">Application Deadline: March 15</p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://calteach.berkeley.edu/scholarships-and-opportunities/scholarships/noyce-scholarship.php\">Robert Noyce Scholarship</a>: recognizes students that plan on teaching math or science in a high-need school district with up to $5,000 per semester or $10,000 per academic year. </p>\n<p dir=\"ltr\">Application Deadline:  December 1st </p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"http://calteach.berkeley.edu/scholarships-and-opportunities/undergraduate-internships-and-employment/summer-break-internships.php\">Summer Internships:</a> CalTeach offers paid summer internships. Interns work with K-12 students, and sometimes teachers, in summer activities that focus on math, science and engineering. Past interns have worked at: Lawrence Hall of Science, Bay Area Discovery Museum, Oakland Zoo, and the Exploratorium. </p>\n<p> </p>\n<p dir=\"ltr\">If students would like more information about this program they can make an appointment with the CalTeach Peer Advisors or Jessica Jones, the Student Services Coordinator. </p>\n<p> </p>\n<p dir=\"ltr\">Advising Hours</p>\n<p> </p>\n<p dir=\"ltr\">CalTeach Peer Advisors - 30 Evans </p>\n<p dir=\"ltr\">Monday 1:00 – 2:30 PM</p>\n<p dir=\"ltr\">Tuesday 10:30 – 12:30 PM </p>\n<p dir=\"ltr\">Wednesday 12:00 – 2:00 PM</p>\n<p dir=\"ltr\">Thursday 10:30 – 12:30 PM </p>\n<p dir=\"ltr\">Friday 2:30-4:00 PM </p>\n<h2>Leslie Lipson Essay Prize</h2>\n<p dir=\"ltr\">The Leslie Lipson Program at UC Berkeley is intended to encourage undergraduate students (first year freshmen/continuing second year sophomores) to study humanistic values and their practical application for individuals, societies, and states; the program consists of the Lipson Essay Prize, the Lipson Scholarship, and the Lipson Research Grant.  I am attaching the Lipson flyer for 17-18 and hope you will consider forwarding to your first and second year students, faculty and staff for review.</p>\n<p> </p>\n<p dir=\"ltr\">You can read more about the program at: <a href=\"http://financialaid.berkeley.edu/prizes-and-honors-lipson-program\">http://financialaid.berkeley.edu/prizes-and-honors-lipson-program</a>  </p>\n<h2>Undergraduate Essay Contest</h2>\n<p dir=\"ltr\"><img src=\"https://lh5.googleusercontent.com/0SItNIQQ6bKY5Z8N1IqFa7m5DNYeh7N_l3ohC1AFKnpzxODkn30Rm_fErGdaKWKLbppiPBDer8lcDpxQEPFuKChar9LZru-gm7iB6IKDNamFStvcdQ7onCgFkxZW2ADzaISA0L8p\" width=\"486\" height=\"751\" /></p>\n<h2>Call for SkyDeck Applications</h2>\n<p dir=\"ltr\">Berkeley SkyDeck is now accepting applications for its Fall 2018 cohort through March 30, 2018. Accepted startups will be eligible to receive funding for up to $100,000 from the Berkeley SkyDeck Fund and additional in-kind resources. Go <a href=\"http://skydeck.berkeley.edu/\">here</a> to apply. If you have questions, contact Berkeley SkyDeck <a href=\"http://skydeck.berkeley.edu/contact/\">here</a>.</p>\n<p> </p>\n<p dir=\"ltr\">To be eligible to apply, a startup team member must be affiliated with UC Berkeley, Berkeley Lab, or UC San Francisco. An affiliate can be a current student, alum, faculty, staff, postdoc researcher, or visiting scholar.</p>\n<h2>Berkeley Center for New Media&#39;s Summer 2018 Classes</h2>\n<p dir=\"ltr\">NWMEDIA R1B: What is an &#64;uthor?</p>\n<p dir=\"ltr\">Session D | MTWR | 11 AM — 1:30 PM  | GPB 107</p>\n<p dir=\"ltr\">Justin Berner</p>\n<p dir=\"ltr\">If a robot wrote a poem, could it break your heart? If a text has no beginning and no end, who decides how it should be read? If a blog is written by a fictional persona, who do we define as the author? Using a combination of print and electronic literature, this course will explore the preceding questions as part of a more general investigation on what it means to be an author in the 21st Century. Throughout the seminar, while challenging traditional and preconceived notions regarding what it means to be “an author,” students will use the literary and theoretical works as a means of understanding how to become a more effective writer.</p>\n<p> </p>\n<p dir=\"ltr\">NWMEDIA R1B: Is Technology Evil?</p>\n<p dir=\"ltr\">Session D | MTWR | 11 AM — 2 PM  | Dwinelle 215</p>\n<p dir=\"ltr\">Nicholaus Gutierrez</p>\n<p dir=\"ltr\">Digital Technology has profoundly influenced the ways we live, work and play. From the “disruptive innovations” of the sharing economy to workplace automatization, from social media to streaming entertainment, the standard narrative of new media and technologies tends to be aspirational: digital networks democratize access, increase efficiency and make life more convenient — in short, they change the world, usually for the better. But is the reality of this new technological world purely positive or does with it pose some problems as well?</p>\n<p dir=\"ltr\">In this course, we will practice the skills of college level writing and research by carefully questioning popular narratives of digital technology. Do the mass media make us into zombie consumers? Do social media cause isolation? Do search engine algorithms create filter bubbles that polarize culture? We will think about the role of mass media in the production of consuming subjects, of the representations of race, gender and sexuality in new media, of the nature and role of aesthetics and design in contemporary life.</p>\n<p> </p>\n<p dir=\"ltr\">NWMEDIA 90: Movies and/as Media?</p>\n<p dir=\"ltr\">Session A | MWF | 10 AM — 1 PM  | 340 Moffitt</p>\n<p dir=\"ltr\">Kaitlin Forcier</p>\n<p dir=\"ltr\">At the beginning of the twentieth century the “new media” was film: heralded as the artistic medium for the industrial age, cinema became a nexus for anxieties and aspirations surrounding the cultural and social transformations wrought by modernity. At the beginning of the twenty-first century, as moving images migrate to the digital and the medium of film itself is transformed, film provides a productive site for theorizing media at moments of emergence. Moreover, since the very beginning (from technological pioneers such as Mélèis, to auteurs such as Stanley Kubrick and George Lucas, to the digital innovations of films such as The Matrix, Avatar, and Gravity), cinema has explored, formally and thematically, what new technologies mean for society.</p>\n<h2>Explore the Wonders of Ancient Egypt &amp; Earn College Credit this Summer!</h2>\n<p dir=\"ltr\"><a href=\"http://classes.berkeley.edu/content/2018-summer-nestud-18-001-lec-001\">From Pyramids to Mummies: Explore the Wonders of Ancient Egypt</a></p>\n<p dir=\"ltr\"><a href=\"http://classes.berkeley.edu/content/2018-summer-nestud-18-001-lec-001\"><img src=\"https://lh3.googleusercontent.com/cZLPuJIQTPgYr5I5JY849zA4zb-m3H548W1JC7q1UuzEEu7zDh960nacppw3Jw17pYugxJjtEWk8NAKYNoeLn038Wr-NFWySjbTTHKfEuT5aKEj4Qxz7qdIMFfYhBL1F-XAYYBxp\" width=\"520\" height=\"804\" /></a></p>\n<h2>Apply for a Public Service Scholarship or Internship for next year</h2>\n<p dir=\"ltr\">SERVICE SCHOLARSHIPS</p>\n<p dir=\"ltr\">The Peter E. Haas Public Service Leaders Program gives need-based scholarships of $2,000-$6,000 to undergrads committed to off-campus service. If you&#39;ve been doing community-based service work or want to start, take a look! Deadline to apply: March 31</p>\n<p> </p>\n<p dir=\"ltr\">PUBLIC SERVICE INTERNSHIPS</p>\n<p dir=\"ltr\">Also accepting applications for students to intern with local government and community nonprofit agencies. Deadline to apply: March 31</p>\n<p> </p>\n<p dir=\"ltr\">SUMMER READING MENTOR JOBS</p>\n<p dir=\"ltr\">Help youth keep their literacy skills over the summer as a mentor with Summer BUILD. Pay is $13.75/hour in Work Study or Education units. Priority deadline: April 25</p>\n<p> </p>\n<p dir=\"ltr\">All applications are online at <a href=\"http://publicservice.berkeley.edu/\">http://publicservice.berkeley.edu/</a> If you have any questions, please get in touch at <a href=\"http://publicservice&#64;berkeley.edu/\">publicservice&#64;berkeley.edu</a> or drop in at 218 Eshleman.</p>\n<h2>Become a TEALS volunteer and change a life</h2>\n<p dir=\"ltr\">If you’re looking for a way to harness your computer science (CS) skills and make a difference for students, we invite you to become a Technology Education and Literacy in Schools (TEALS) volunteer. </p>\n<p> </p>\n<p dir=\"ltr\">Computer science is a vital driver in today’s global innovation economy, but most U.S. high schools are unable to offer rigorous CS courses. Without CS in high schools, our students are missing out on essential computational skills that will help them succeed in any career they wish to pursue, and professional skills that could lead to an economically secure future.</p>\n<p> </p>\n<p dir=\"ltr\">The <a href=\"https://www.tealsk12.org/volunteers/\">TEALS program</a> seeks to change that reality.</p>\n<p> </p>\n<p dir=\"ltr\">Our volunteers work directly with classroom teachers to help them build and grow their CS teaching capacity through yearlong support and training to inspire the next generation of computer scientists. If you’re interested in the opportunity to help shape students’ career opportunities – all while having fun – TEALS is the right fit for you.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Learn more and apply at <a href=\"https://www.tealsk12.org/volunteers/\">tealsk12.org/volunteers</a></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">RSVP for one of our Bay Area Info Sessions below. Free food and drinks will be provided!</p>\n<div dir=\"ltr\">\n<table><tbody><tr><td>\n<p dir=\"ltr\">Location</p>\n</td><td>\n<p dir=\"ltr\">Date &amp; Time</p>\n</td></tr><tr><td>\n<p dir=\"ltr\">San Francisco</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018DirtyWaterSF\">Dirty Water (1355 Market St)</a></p>\n</td><td>\n<p dir=\"ltr\">Tuesday, April 3rd</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr><tr><td>\n<p dir=\"ltr\">San Francisco</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018LinkedInSF\">LinkedIn (222 2nd St)</a></p>\n</td><td>\n<p dir=\"ltr\"> Wednesday, April 4th</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr><tr><td>\n<p dir=\"ltr\"> Sunnyvale</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018LinkedInSunnyvale\">LinkedIn (1000 W Maude Ave)</a></p>\n</td><td>\n<p dir=\"ltr\">Wednesday, April 4th</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr><tr><td>\n<p dir=\"ltr\">Sunnyvale</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018MicrosoftSunnyvale\">Microsoft (1020 Enterprise Way)</a></p>\n</td><td>\n<p dir=\"ltr\"> Thursday, April 5th</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr><tr><td>\n<p dir=\"ltr\">Oakland</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018KaporCenterOakland\">Kapor Center (2148 Broadway)</a></p>\n</td><td>\n<p dir=\"ltr\">Tuesday, April 10th</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr><tr><td>\n<p dir=\"ltr\">Hayward</p>\n<p dir=\"ltr\">RSVP: <a href=\"https://www.surveymonkey.com/r/2018AlamedaCOEHayward\">Alameda County Office of Education (313 W Winton Ave)</a></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Unfortunately, no alcoholic beverages will be served at this venue.</p>\n</td><td>\n<p dir=\"ltr\">Thursday, April 12th</p>\n<p dir=\"ltr\">4-6 PM</p>\n</td></tr></tbody></table>\n</div>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Together, we can help build CS programs at high schools across the U.S. to empower the next generation of innovators. If you have more questions, please contact kathlynn&#64;tealsk12.org. We’re eager to have more volunteers and happy to answer any remaining questions you may have!</p>\n<p><br /><br /></p>", "created": "2018-03-23T20:09:02Z", "subject": "Week 10: Undergraduate Announcements", "uid": "hz4ud741s6s1gn"}], "i_edits": [], "id": "jf4dphtcu6e1ug", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 6397, "num_favorites": 1, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654549951257, "tag_good": [], "tag_good_arr": [], "tags": ["announcements", "instructor-note"], "type": "note", "unique_views": 747}