{"bookmarked": 2, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "jfo771mytet475", "type": "create", "uid": "ibtip4ceues3g0", "when": "2018-04-06T17:02:07Z"}], "children": [], "config": {}, "created": "2018-04-06T17:02:07Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements", "lscs", "eecs", "cs-intended"], "history": [{"anon": "no", "content": "<p>Fall 2018<br />EECS 149/249A:<br />Introduction to Embedded Systems<br />Instructors: Prabal Dutta and Sanjit A. Seshia<br />Format: 4 units, three hours of lecture, three hours of lab per week.<br />Overview: This course introduces students to the basics of models, analysis, and design<br />of software systems for distributed, wireless, and networked embedded systems to<br />support applications in the Internet-of-Things (IoT), Robotics, Smart Manufacturing, and<br />other areas. The course emphasizes a cyber-physical systems (CPS) perspective to<br />embedded systems: students learn how to combine physical processes with<br />computation, and how to coordinate distributed computing elements. The course has a<br />strong laboratory component, with emphasis on a semester-long sequence of projects.<br />If you’re a student who wants to learn how to program an autonomous vehicle, build an<br />Internet-connected sensor system, or develop a smart wearable, then EECS 149 is the<br />foundational design course for you.<br />Topics to be covered include the following:<br />1. Models of computation for cyber-physical systems: finite state machines, threads,<br />differential equations, hybrid systems, actors, discrete-events, data flow<br />2. Interfacing with the physical world: sensor/actuator modeling and calibration,<br />timing, concurrency in dealing with multiple real-time streams, handling numerical<br />imprecision in software<br />3. Embedded platforms: processors and memory architecture, real-time operating<br />systems, execution time analysis, scheduling, concurrency<br />4. Analysis and verification: Formal specification, systematic testing/simulation,<br />reachability analysis, model checking, controller synthesis, computer security.<br />5. Distributed systems and networking: Protocol design, wireless communications,<br />predictable networking, sensor networks.<br />Class web page with content from previous<br />years: http://chess.eecs.berkeley.edu/eecs149</p>", "created": "2018-04-06T17:02:07Z", "subject": "Course announcement: Revised EECS 149 Fall 2018", "uid": "ibtip4ceues3g0"}], "i_edits": [], "id": "jfo771mwzkq474", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 6508, "num_favorites": 3, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654549863430, "tag_good": [], "tag_good_arr": [], "tags": ["announcements", "cs-intended", "eecs", "instructor-note", "lscs"], "type": "note", "unique_views": 410}