{"bookmarked": 5, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "ji41ek7vx1z4qd", "type": "create", "uid_a": "a_0", "when": "2018-06-07T04:23:43Z"}, {"anon": "stud", "data": "ji6dl5eueo37bk", "to": "ji41ek7te9y4qc", "type": "s_answer", "uid_a": "a_1", "when": "2018-06-08T19:40:18Z"}, {"anon": "stud", "to": "ji41ek7te9y4qc", "type": "followup", "uid_a": "a_0", "when": "2018-06-08T22:24:23Z"}, {"anon": "no", "to": "ji41ek7te9y4qc", "type": "followup", "uid": "hzem9zn8zpm2nm", "when": "2018-06-09T13:25:02Z"}, {"anon": "no", "to": "ji41ek7te9y4qc", "type": "feedback", "uid": "i10w5yv8nUg", "when": "2018-06-10T06:13:37Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2018-06-08T19:40:18Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>It&#39;s taught by graduate students, as are most summer classes. Anwar is a good and conscientious instructor. Do you have any specific questions?</p>", "created": "2018-06-08T19:40:18Z", "subject": "", "uid_a": "a_1"}], "id": "ji6dl5ejgmb7bi", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}, {"anon": "stud", "bucket_name": "Week 6/3 - 6/9", "bucket_order": 97, "children": [{"anon": "no", "bucket_name": "Week 6/10 - 6/16", "bucket_order": 96, "children": [], "config": {}, "created": "2018-06-10T06:13:37Z", "data": {"embed_links": null}, "folders": [], "id": "ji8fnga2pu576n", "subject": "<p>It will most likely be comparable to the semester version in terms of difficulty. We cover the same topics and will test in very much the same way, we will be changing some things this summer but it shouldn&#39;t make the course any more/less difficult.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "i10w5yv8nUg", "updated": "2018-06-10T06:13:37Z"}], "config": {}, "created": "2018-06-08T22:24:23Z", "data": {"embed_links": null}, "folders": [], "id": "ji6jg629kbw6p1", "no_answer": 0, "no_upvotes": 0, "subject": "How is the class in terms of difficulty compared  to semester? ", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_0", "updated": "2018-06-08T22:24:23Z"}, {"anon": "no", "bucket_name": "Week 6/3 - 6/9", "bucket_order": 97, "children": [], "config": {}, "created": "2018-06-09T13:25:02Z", "data": {"embed_links": null}, "folders": [], "id": "ji7fmec2ki3p8", "no_answer": 0, "no_upvotes": 0, "subject": "<p>I just took CS 188, where Anwar was the head TA. When asked about the structure and overall course design he had this to say (he specifically talks about this summer&#39;s course too):</p>\n<p></p>\n<p>BEGIN QUOTE</p>\n<p></p>\n<p>Oooo I have many thoughts on this!</p>\n<p> </p>\n<p>tl;dr the material not being as hard is on purpose for accessibility, agree that exams are imperfect but we are working on that, talk fun talk more yaay</p>\n<p> </p>\n<p>OK, so first, for the lack of super difficult concepts, a big tenant of CS188 is that it is a survey course, one which looks on a surface level at a wide scope of topics in AI, so that after taking it you may have some idea where you would want to dive deeper (maybe the ML was super interesting, or the RL, etc.). A big important part of of a survey course is that it is accessible to many without needing a big investment to go into it. I think this is especially important looking at cases like 189:</p>\n<p> </p>\n<p>I took 189 before Sahai came in without any real knowledge in Linear algebra, and with zero multi-variable calculus. I struggled, I spent a ton of time in the class, but I did get through, I got a lot out of it, and even got a good grade. It showed me that I am definitely interested in this stuff, and that was cool. These days though, we are told that you must have EE126, EE127, Math 110 maybe some Math 53 to take this class, and if you don&#39;t have a strong background in math before coming to Berkeley (shout out to the schools back home in Mississippi (; ) then these aren&#39;t classes you can blitz all in one or even two semesters. If you have to take over a year just to take the pre-reqs for 189, and then you take it and decide that you aren&#39;t actually that interested, then that feels like a big waste of that 1.5 years in a time where your time may be very limited.</p>\n<p> </p>\n<p>I think this is a massive problem for accessibility, so for me 188 being a survey course is to help alleviate that. You come in with almost no pre-reqs needed outside of lower divs that are required anyway, and after only one semester with no prior investment, get an idea if this is a path you may want to tread.</p>\n<p> </p>\n<p>Now, as EE16a and 16b become required and more people take them before entering 188, then sure we could make things a bit more interesting, but also remember that CS and EECS aren&#39;t the only students taking this class, we get Cog Sci students, Bioengineering, Applied mathmatics, Civil Engineering, Econ, Political Science, and thats just scrolling down the first 150 names on the roster, I know we have had English students and Linguistics students, and all manner of majors here. AI is a field that affects everyone so I absolutely think we need to be careful to keep this class accessible to them.</p>\n<p> </p>\n<p>Now, as for our tests.....I agree that it&#39;s not the best. I personally chalk that up to the whole problem with education today, the way that we assess people I think is extremely not hollistic, unaccurate, rewards and penalizes the wrong things, and has just in general given up on quality in favor of scalability. For our class specifically, we need to have exams that actually distinguish people somehow so that we can give the university a letter, and our current structure doesn&#39;t have any space to pull grading levers elsewhere. While I acknowledge that this isn&#39;t perfect, we are aware of this, and we are working on ways to improve it, along with other aspects of the course.</p>\n<p> </p>\n<p>Last semester, for example, we decided to address the problem of how steep and inaccessible the jump to ML in this class is. This involved destroying the awful old sixth project, making a whole new one, while taking the old hw, taking the most important bits and merging them into the project as a way to support the project efforts and also not have too much workload, we created a brand new ML note, and made all the TAs prepare so that they could be as helpful as possible for the project and the material. Obviously there is still work to be done there, and we are trying more things like lecture parties and additional calc reviews but I think many more people are understanding much more of the ML stuff then before (I know it all went COMPLETELY over my head when I took the course...).</p>\n<p> </p>\n<p>More towards the topic of exams and grading and not being hollistic, another thing we are doing to try and address the exam problem (along with what I think is another very big problem) for this summer&#39;s offering of the class is to focus on contests. I think a big flaw with 188 is that alot of people go through the whole class without feeling like they reaaally wrote any AI, or had that much of a creative outlet to test the stuff they learned. The contests are supposed to be that, but even when the contest site doesn&#39;t break participation is understandably very low. So for the summer, we are planning to make one of the contests mandatory. Of course, we are doing more shifting around of workload to make it manageable, we are exploring different ways to make the contest less intimidating or more approachable, we are making staff bots that would allow us to actually grade submissions well, and of course rebuilding the website...but if we succeed in this effort then suddenly we have a new grading lever! And not just any grading lever, but one that rewards creativity, effort, exploration, and applications of learned material in a not-as-timeconstrained or tricky way! This also means we can have less weight on the exams, so that could help a lot of these problems alot! (<strong>IF</strong><strong> </strong>it works out heh) </p>\n<p> </p>\n<p>Also, I have to say I was soooo excited to see this post because I loove getting feedback about all this, if y&#39;all have thoughts or responses, or maybe feedback about what we do well or not so well, what you think about the last project or our exams, pleeeaaase do share, it genuinely shapes how we move forward and helps us do a better job of improving the course going forward...and its just a fun conversation!</p>\n<p></p>\n<p>END QUOTE</p>\n<p></p>\n<p>I thought this might be helpful in figuring out how he might structure the class in summer, etc.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "hzem9zn8zpm2nm", "updated": "2018-06-09T13:25:02Z"}], "config": {}, "created": "2018-06-07T04:23:43Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["lscs", "eecs"], "history": [{"anon": "stud", "content": "<p>How is it over the summer?</p>\n<p></p>\n<p></p>\n<p></p>\n<p>Thanks</p>", "created": "2018-06-07T04:23:43Z", "subject": "CS 188", "uid_a": "a_0"}], "i_edits": [], "id": "ji41ek7te9y4qc", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 7133, "num_favorites": 3, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654549127529, "tag_good": [{"admin": false, "endorser": {"hyq0br1u3kx7dg": 1548279114}, "facebook_id": null, "id": "iy0l2muelq84t9", "name": "Sai Mandava", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p6tenz6b5ny", "name": "Zipeng Qin", "photo": "1529141551_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/is6p6tenz6b5ny/1529141551_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p6j9n6u55fp", "name": "Katie Gu", "photo": "1513749563_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/is6p6j9n6u55fp/1513749563_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "idkkv297xks6ot", "name": "Vivian Liu", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6d4undmzeh69g", "name": "Shivin Devgon", "photo": "1553216198_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/j6d4undmzeh69g/1553216198_35.png", "published": true, "role": "student", "us": false}], "tag_good_arr": ["iy0l2muelq84t9", "is6p6tenz6b5ny", "is6p6j9n6u55fp", "idkkv297xks6ot", "j6d4undmzeh69g"], "tags": ["eecs", "lscs", "student"], "type": "question", "unique_views": 629}