{"bookmarked": 7, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jijbtbuhec440u", "type": "create", "uid_a": "a_0", "when": "2018-06-17T21:11:41Z"}, {"anon": "stud", "data": "jije2kc0w863uv", "to": "jijbtbuf3u140t", "type": "s_answer", "uid_a": "a_1", "when": "2018-06-17T22:14:51Z"}, {"anon": "stud", "data": "jije2tdrhot3xo", "type": "s_answer_update", "uid_a": "a_1", "when": "2018-06-17T22:15:03Z"}, {"anon": "stud", "to": "jijbtbuf3u140t", "type": "followup", "uid_a": "a_2", "when": "2018-06-18T18:37:31Z"}, {"anon": "stud", "to": "jijbtbuf3u140t", "type": "followup", "uid_a": "a_3", "when": "2018-06-19T05:04:43Z"}, {"anon": "stud", "to": "jijbtbuf3u140t", "type": "feedback", "uid_a": "a_4", "when": "2018-07-27T14:55:13Z"}, {"anon": "stud", "to": "jijbtbuf3u140t", "type": "feedback", "uid_a": "a_3", "when": "2018-07-27T19:16:22Z"}, {"anon": "stud", "to": "jijbtbuf3u140t", "type": "feedback", "uid_a": "a_4", "when": "2018-07-27T19:38:26Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2018-06-17T22:14:51Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>Well, it won&#39;t be easy. I would at least recommend doing all of the circuit material from EE16a during the summer since it&#39;s fairly different from the circuits you do in Physics C, so you&#39;d be coming in 16B with basically none of the prerequisite circuit knowledge.</p>", "created": "2018-06-17T22:15:03Z", "subject": "", "uid_a": "a_1"}, {"anon": "stud", "content": "<p>Well, it won&#39;t be easy. I would at least recommend doing all of the circuit material from EE16a since it&#39;s fairly different from the circuits you do in Physics C, so you&#39;d be coming in 16B with basically none of the prerequisite circuit knowledge.</p>", "created": "2018-06-17T22:14:51Z", "subject": "", "uid_a": "a_1"}], "id": "jije2kbq4ac3uu", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}, {"anon": "stud", "bucket_name": "Week 6/17 - 6/23", "bucket_order": 94, "children": [], "config": {}, "created": "2018-06-18T18:37:31Z", "data": {"embed_links": null}, "folders": [], "id": "jiklqxlqd0v6r5", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Oh boy, the combination of those 3 sounds pretty nasty. 70 and 16b have pretty heavy problem sets like 10-15 hours a week for each class, and 61c has heavy projects due every other week I think. Might be possible, but definitely won&#39;t be enjoyable.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_2", "updated": "2018-06-18T18:37:31Z"}, {"anon": "stud", "bucket_name": "Week 6/17 - 6/23", "bucket_order": 94, "children": [{"anon": "stud", "bucket_name": "Week 7/22 - 7/28", "bucket_order": 89, "children": [], "config": {}, "created": "2018-07-27T14:55:13Z", "data": {"embed_links": null}, "folders": [], "id": "jk43z9fxl86da", "subject": "<p>I&#39;m an incoming freshman, and as it turns out, 61C, 70 and EE16B will be the only classes left for me to finish Lower Division classes for L&amp;S CS (taking 61A and EE16A in the fall along with Data 8). If I were to pick 2 out of the 3 for Spring, which should they be?  I understand that EE16A/EE16B are good for achieving mathematical maturity for CS70 so I am leaning towards 61C and EE16B.  Does that make sense?  Also, if I also took STAT 140 would that help with CS70 also, or would the combination of CS61C &#43; EE16B &#43; STAT 140 be too much?  Hopefully I&#39;ll get something higher than a B&#43; for CS61A, I have a feeling I&#39;ll need all the buffer I can get for CS70. </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_4", "updated": "2018-07-27T14:55:13Z"}, {"anon": "stud", "bucket_name": "Week 7/22 - 7/28", "bucket_order": 89, "children": [], "config": {}, "created": "2018-07-27T19:16:22Z", "data": {"embed_links": null}, "folders": [], "id": "jk4db3qvqu8212", "subject": "<p>61C and EE16B is a good combo, because EE16B covers transistors and combinational logic in the first few weeks, which 61C picks up on in the middle of the course.  Even if you&#39;re not interested in hardware, I think the classes pair well together.</p>\n<p></p>\n<p>When are you taking/have you taken CS 61B?  If you&#39;re taking 61A and EE16A in the fall, MOST freshmen follow up with 16B, 61B, CS 70 in the spring.  61B and 70 pair well because both teach some graph theory. </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2018-07-27T19:16:22Z"}, {"anon": "stud", "bucket_name": "Week 7/22 - 7/28", "bucket_order": 89, "children": [], "config": {}, "created": "2018-07-27T19:38:26Z", "data": {"embed_links": null}, "folders": [], "id": "jk4e3huyqub4wb", "subject": "<p>thanks for the quick response!  61C &#43; EE16B was what I am leaning towards.  So how about CS61C (instead of CS61B) &#43; EE16B &#43; CS70 in one term then?  Still doable?  Since I haven&#39;t started classes yet, I&#39;m not sure how intense CS61A &#43; EE16A &#43; Data 8 will be, but I&#39;ll find out soon.</p>\n<p></p>\n<p>I took Data Structures and other classes at my local CC while in HS. I&#39;m assuming that the CS61B class will be articulated since that&#39;s what it said on assist.org.  Of course, if I screw up CS61A, I might have to figure out a way how to take CS61B again ha ha.  Not sure if they&#39;ll allow this.</p>\n<p></p>\n<p>My only other thought is that I sort of wanted to get the 3.30 GPA requisite out of the way, so my initial thought was to take CS70 sooner rather than later.  Is there any advantage to declaring earlier rather than later?  Since I have all these CC and AP credits, half of my breadths done, and I tested out of all the R&amp;C and Math 1A/1B classes, I&#39;m thinking of trying to graduate way earlier than 4 years. I was hoping to get to the upper division CS courses by next Fall or next Spring at the latest.  However, I also wanted to be as ready for CS70 as possible, so trying to balance things.  I&#39;m also worried that because I skipped out on Math 1A and 1B, I&#39;m sure there will be stuff that I won&#39;t know that might be applicable to CS70.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_4", "updated": "2018-07-27T19:38:26Z"}], "config": {}, "created": "2018-06-19T05:04:43Z", "data": {"embed_links": null}, "folders": [], "id": "jil85i5fudelo", "no_answer": 0, "no_upvotes": 0, "subject": "<p>I can&#39;t speak to the difficulty of 61C since I&#39;m taking it right now, but I&#39;d say 16B is the class that a lot of people underestimate, especially since CS 70 is maligned and blown a bit out of proportion.</p>\n<p></p>\n<p>If you follow through with the proposed schedule, you will <strong>seriously</strong> need to train your circuits knowledge.  Review solutions to differential equations as well.  I thought I understood 16a circuits pretty well, but got wrecked in 16b because I was slightly rusty on which tricks/techniques to use for circuits, and 16b midterm 1 requires you to be absolutely adept with circuits.  This might not be what you want to hear, but I&#39;d honestly recommend taking ee16a because (at least for my semester) 16b exams required an understanding of op-amps, which are taught in 16a.  As a plus, if you take ee16a after math54, that class should basically be a GPA booster as linalg is very straightforward on the first midterm. If you don&#39;t take 16A: don&#39;t use the 16a 2nd midterm as a way to learn op-amps, because you could do well on that midterm just memorizing some configurations and formulas.  Instead, the op-amp <span style=\"text-decoration:underline\">homeworks</span> in 16a are what actually give you the understanding that you need for 16b, so I recommend at the very least, doing the op-amp homeworks from 16a and asking friends for help.</p>\n<p>My personal take: I did well in math 54, ee16a, and physics 7a/7b but ee16b is just really fast paced with heavy problem sets, and you will be tested on seemingly small details from lecture.  16B breezes through a lot of really algorithmic things very fast (converting to and from phasor domain, Bode plots, PCA, SVD, K-means, etc), and the exams are very nitty gritty and focus on dirty/tricky details within those algorithms (at least, during sp18).  I would say that having the background from the 3 classes is helpful and really allows you to draw cool connections between different fields: 54 for the diffeq, 16a for the circuits, and 7a/7b for understanding the relationships between mechanical and electric oscillators, and understanding overdamping, underdamping, and critical damping. The way that these topics come together in 16b was a redeeming factor for an otherwise arduously difficult class.  The 2nd half of 16b is slightly easier: k-means is very straightforward and was taught in 61a and things like SVD and PCA are definitely tricky at first but can be understood within a few hours of going through the algorithms and really ironing out the details.  DFT is painfully hard but at least nobody else in my class understood it so i guess that&#39;s a plus.</p>\n<p>16B labs are simultaneously painful and cool.</p>\n<p></p>\n<p>As for 70: I know that a lot of people talk about how terrifying it is and how brutal the psets/exams are, but it honestly depends on your comfortability solving really hard questions under time pressure. </p>\n<p>If you have math competition experience, such as being an AIME qualifier, then your problem solving skills and intuition are good enough for CS 70, regardless of how much of the material you know in advance.  If your problem solving skills are strong, then you can focus on learning the material and can reasonably keep up with the class, even on the no-homework option.  However, if you don&#39;t have the intuition and problem solving skills that comes from years of doing math competitions in high school, then even if you do the homework option in CS70 you&#39;ll be hard pressed to build that kind of intuition in just 1 semester.  70 really boils down to knowing how to attack a problem from many different angles while still being efficient with your time: knowing the material is crucial but isn&#39;t everything to guarantee success.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_3", "updated": "2018-06-19T05:04:43Z"}], "config": {}, "created": "2018-06-17T21:11:41Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["lscs"], "history": [{"anon": "stud", "content": "<p>Has anybody done this before? Is it doable? I am aiming for at least a B&#43; in all three. I got A- on 61A/B and took 54 instead of 16A. I’ve done AP Physics C circuits only. </p>", "created": "2018-06-17T21:11:41Z", "subject": "61C &#43; 70 &#43; 16B", "uid_a": "a_0"}], "i_edits": [], "id": "jijbtbuf3u140t", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 7173, "num_favorites": 2, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654549073760, "tag_good": [], "tag_good_arr": [], "tags": ["lscs", "student"], "type": "question", "unique_views": 691}