{"bookmarked": 3, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jk3cqa9reml37m", "type": "create", "uid_a": "a_0", "when": "2018-07-27T02:12:24Z"}, {"anon": "stud", "data": "jk3l3qp22iu5kb", "to": "jk3cqa9nq0w37l", "type": "s_answer", "uid_a": "a_1", "when": "2018-07-27T06:06:49Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2018-07-27T06:06:49Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>CS 9 courses are very entirely self-paced and require that you have the motivation to read on and do the projects and quizzes in a timely manner. This is doable if you have a strong intuition of how a computer program works and how data structures are laid out (i.e. you&#39;ve taken 61A/B). I attempted taking CS 9F while also enrolled in 61A my fall semester and I did not complete the class. It&#39;s too much of a time commitment since, as a beginner, you may end up getting lost in the foundational details. I attempted CS 9F after taking 61A/B/C and it felt much easier. It was apparent that during my first attempt, I lacked the knowledge of fundamentals, which inevitably slows down and hinders the learning process, especially since no one is there to emphasize which concepts should be prioritized.</p>\n<p></p>\n<p>That being said, this is my experience. Everyone learns differently. However, I&#39;d recommend going straight down the Data 8/88/100 path if you&#39;re focused on applying DS to BioE and Chem. These two fields pair very well with a data driven background.</p>", "created": "2018-07-27T06:06:49Z", "subject": "", "uid_a": "a_1"}], "id": "jk3l3qotb2h5ka", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}], "config": {}, "created": "2018-07-27T02:12:24Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["cs-intended", "peer_directed", "faculty_advising"], "history": [{"anon": "stud", "content": "<p>Hi! I am interested in exploring data science and learning Python, C&#43;&#43;, and Java as tools for applications in the fields of chemistry and bioengineering. My only program background is E7 and one computation chemistry course taught in Matlab as well. As I will not have huge time commitments to four-unit courses besides my major requirements, I was thinking about CS 9 series. The 2-unit self-paced courses in different languages might be a good fit. Is there anyone who took the course could describe how was the experience in general, what is the syllabus like, how much time commitment, how much did you learn, how well you apply the knowledge after the course? Would Data 8 or Data 100, or CS 88 be a better fit for the purpose of my interest? Thanks in advance!</p>", "created": "2018-07-27T02:12:24Z", "subject": "F18 &amp; S19: Recommended CS and DS Courses for Chemistry and Bioengineering Applications", "uid_a": "a_0"}], "i_edits": [], "id": "jk3cqa9nq0w37l", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 7288, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654548993180, "tag_good": [], "tag_good_arr": [], "tags": ["cs-intended", "faculty_advising", "peer_directed", "student"], "type": "question", "unique_views": 319}