{"bookmarked": 4, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jkbubq7huhu55r", "type": "create", "uid_a": "a_0", "when": "2018-08-02T00:47:08Z"}, {"anon": "stud", "data": "jkcwkrm1blz264", "to": "jkbubq7f1ym55q", "type": "s_answer", "uid_a": "a_1", "when": "2018-08-02T18:37:55Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2018-08-02T18:37:55Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>Petition for it. Piazza isn&#39;t the place.</p>", "created": "2018-08-02T18:37:55Z", "subject": "", "uid_a": "a_1"}], "id": "jkcwkrlo1dm263", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}], "config": {}, "created": "2018-08-02T00:47:08Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["policy"], "history": [{"anon": "stud", "content": "Would it be possible for ENERES 190C &#34;Statistical Learning for Energy and the Environment&#34; to count as an upper division class for the CS minor? It seems to cover concepts similar to Data 100, which counts (class description below). \n\n\nThis course will teach students to build, estimate and interpret models that describe phenomena in the broad area of energy and environmental decision-making. The effort will be divided between (i) learning a suite of data-driven modeling approaches, (ii) building the programming and computing tools to use those models and (iii) developing the expertise to formulate questions that are appropriate for available data and models. My goal is that students will leave the course as both critical consumers and responsible producers of data driven analysis.\n \nStudents will work in Python in this course, and it is recommended that students have completed COMPSCI Data 8. The course is designed to fit into Berkeley’s emerging “data science” curriculum by providing students with a skill set similar to those developed in Data 100. However, in contrast to Data 100, here we will place a stronger emphasis on how to use prediction methods as decision-making tools in energy and environment contexts and less emphasis on web technologies, working with text, databases and statistical inference.\n \nThis is a four-unit course, with three hours of lecture and two hours of lab section each week. Lectures will focus on theoretical and conceptual material but also introduce the programming structures required to use the material. Labs will be computer working sessions with a GSI and lab helpers available to work through weekly lab exercises.", "created": "2018-08-02T00:47:08Z", "subject": "ENERES 190C", "uid_a": "a_0"}], "i_edits": [], "id": "jkbubq7f1ym55q", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 7338, "num_favorites": 1, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654548929433, "tag_good": [], "tag_good_arr": [], "tags": ["policy", "student"], "type": "question", "unique_views": 177}