{"bookmarked": 3, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jkdj9b4z6124en", "type": "create", "uid_a": "a_0", "when": "2018-08-03T05:12:51Z"}, {"anon": "stud", "data": "jke8b4lpabv3v7", "to": "jkdj9b4xizo4em", "type": "s_answer", "uid_a": "a_1", "when": "2018-08-03T16:54:07Z"}, {"anon": "stud", "data": "jke8eqht4e94pv", "type": "s_answer_update", "uid_a": "a_1", "when": "2018-08-03T16:56:55Z"}, {"anon": "stud", "data": "jke8fnjwzqi4wj", "type": "s_answer_update", "uid_a": "a_1", "when": "2018-08-03T16:57:38Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2018-08-03T16:54:07Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "I did this combo last semester (with 126). I don&#39;t have a frame of reference for what you can handle, but I was able to do it alright. I had similar commitments to yours. 126 lightened up after the first couple weeks when they made labs due every other week instead of every week due to feedback from students. The problem sets are pretty difficult and time consuming though. 162 depends a lot on your group - I picked my group and they were all competent people and we didn&#39;t have too many teamwork issues so the class wasn&#39;t too bad. If you have a bad group, expect workload to be pretty high. Otherwise it&#39;s just bursty but manageable. 161 was fine and relatively light (but project 2 does take a lot of work and people were pretty stressed about it, YMMV). I wouldn&#39;t go into 161 thinking it&#39;ll be a breeze though. I don&#39;t know exactly, but I&#39;d say 162 is like 61C in terms of workload except possibly a bit less work and a bit more info-heavy. 126 is comparable to 170 or 70 for work I think, but the homeworks might be a bit less tricky. I dunno what to compare 161 to, but it&#39;s lighter than the other two for sure. <div><br /></div><div>I think your combo is doable and just stick with it, and if it&#39;s too hard, drop a class or swap one in. You probably don&#39;t want to take on any more though. </div>", "created": "2018-08-03T16:57:38Z", "subject": "", "uid_a": "a_1"}, {"anon": "stud", "content": "I did this combo last semester (with 126). I don&#39;t have a frame of reference for what you can handle, but I was able to do it alright. I had similar commitments to yours. 126 lightened up after the first couple weeks when they made labs due every other week instead of every week due to feedback from students. The problem sets are pretty difficult and time consuming though. 162 depends a lot on your group - I picked my group and they were all competent people and we didn&#39;t have too many teamwork issues so the class wasn&#39;t too bad. If you have a bad group, expect workload to be pretty high. Otherwise it&#39;s just bursty but manageable. 161 was fine and relatively light (but project 2 does take a lot of work and people were pretty stressed about it, YMMV). I wouldn&#39;t go into 161 thinking it&#39;ll be a breeze. I don&#39;t know exactly, but I&#39;d say 162 is like 61C in terms of workload except possibly a bit less work and a bit more info-heavy. 126 is comparable to 170 or 70 for work I think, but the homeworks might be a bit less tricky. I dunno what to compare 161 to, but it&#39;s lighter than the other two for sure. <div><br /></div><div>I think your combo is doable and just stick with it, and if it&#39;s too hard, drop a class or swap one in. You probably don&#39;t want to take on any more though. </div>", "created": "2018-08-03T16:56:55Z", "subject": "", "uid_a": "a_1"}, {"anon": "stud", "content": "I did this combo last semester (with 126). I don&#39;t have a frame of reference for what you can handle, but I was able to do it alright. I had similar commitments to yours. 126 lightened up after the first couple weeks when they made labs due every other week instead of every week due to feedback from students. The problem sets are pretty difficult and time consuming though. 162 depends a lot on your group - I picked my group and they were all competent people and we didn&#39;t have too many teamwork issues so the class wasn&#39;t too bad. If you have a bad group, expect workload to be pretty high. Otherwise it&#39;s just burst but manageable. 161 was fine and relatively light (but project 2 does take a lot of work and people were pretty stressed about it, YMMV). I wouldn&#39;t go into 161 thinking it&#39;ll be a breeze. <div><br /></div><div>I think your combo is doable and just stick with it, and if it&#39;s too hard, drop a class or swap one in. You probably don&#39;t want to take on any more though. </div>", "created": "2018-08-03T16:54:07Z", "subject": "", "uid_a": "a_1"}], "id": "jke8b4lc6sk3v6", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {"jc04z4cze297dy": 1521171965}, "facebook_id": null, "id": "is6p9hezg2wpc", "name": "Daniel Zhu", "photo": "1563511753_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/is6p9hezg2wpc/1563511753_200.jpg", "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["is6p9hezg2wpc"], "type": "s_answer"}], "config": {}, "created": "2018-08-03T05:12:51Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["peer_directed"], "history": [{"anon": "stud", "content": "<p>Hi everyone! I&#39;m a rising junior and I am considering the taking the above course load and I was wondering if anyone had any thoughts on the manageability of it. I do have some other commitments (I&#39;m in a club and accepted a tutor position for a lower div course), but I&#39;m fairly set on taking 3 techs this semester as I&#39;m almost completely done with my breadths and would like to save some for senior year and I&#39;m really interested in all of these courses.</p>\n<p></p>\n<p>I figure 161 shouldn&#39;t be too heavy, but I&#39;m mainly concerned about 162 and 126/164. Which one of 126 and 164 would be more manageable with 162? I know 164 is generally very heavy, but Hilfinger isn&#39;t teaching it this semester so I heard it&#39;s a bit lighter. I have already taken 170 and 186 and completed all lower divs.</p>\n<p></p>\n<p>I&#39;d appreciate any thoughts people have on this. Thanks!</p>", "created": "2018-08-03T05:12:51Z", "subject": "[Course Load] 162, 161, and 126/164", "uid_a": "a_0"}], "i_edits": [], "id": "jkdj9b4xizo4em", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 7351, "num_favorites": 1, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654548943949, "tag_good": [], "tag_good_arr": [], "tags": ["peer_directed", "student"], "type": "question", "unique_views": 380}