{"bookmarked": 3, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jkhrf1uje9435n", "type": "create", "uid_a": "a_0", "when": "2018-08-06T04:12:21Z"}, {"anon": "no", "to": "jkhrf1ug3ev35m", "type": "followup", "uid": "is6p815tz306kj", "when": "2018-08-06T16:41:09Z"}], "children": [{"anon": "no", "bucket_name": "Week 8/5 - 8/11", "bucket_order": 89, "children": [], "config": {}, "created": "2018-08-06T16:41:09Z", "data": {"embed_links": null}, "folders": [], "id": "jkii60fbk2t5yg", "no_answer": 0, "no_upvotes": 0, "subject": "<p>tl;dr lol u thought; 105 is at least as difficult as 61C, not light by any means; also I took it this spring, which was apparently the toughest offering of 105 in a while, though it got tougher because the labs and homework were re-written and I don&#39;t think they would just throw out a basically re-done class to go back to the essentially threadbare state the class used to be in from what I&#39;ve heard...</p>\n<p></p>\n<p>I&#39;m not sure how well prepared you are for 189, but, from what people say on this Piazza, you can probably expect that class to be a large time and effort drain.  And, unfortunately for you, 105 is a class that takes itself pretty seriously as well. 105 is definitely a step up from either of 16AB. I&#39;d say that 16AB provide just <em>barely</em> enough preparation for 105 for someone who was attentive to all the circuits material throughout the two classes, let alone that the most important circuits material for 105 coming from 16AB is actually found in 16A and (at least when I took it) is not taught like it&#39;s super important (superposition, dependent sources, Thevenin&#39;s and Norton&#39;s theorems/ the idea of finding equivalent resistances using test sources, why the golden rules of op-amps even apply &lt;-- this was taught the best of the lot but was still not emphasized enough imo). I haven&#39;t taken 120 yet (taking this semester), but I&#39;ve heard it described as &#34;light&#34;... and that&#39;s definitely not a term I&#39;d use to describe 105.</p>\n<p></p>\n<p>105 typically has a steep learning curve going into its first module (non-ideal op-amps) because people are rusty on circuits from 16AB, before leveling off a bit, since the second module (intro to device physics) is fairly straightforward for most students (although it is not taught as well as in the dedicated device physics class, 130-- which I took with 105). The final module, which is about building amplifier stages with transistor circuits, is usually seen as the most important part of the class by far, so the class ramps up pretty heavily in its last month and a half. Up to this point, the labs (experiments with a small added write-up) and pre-labs (basically extra homework to prepare you for specific labs) are mostly manageable (since they aren&#39;t a weekly occurrence), but, at the end of the last module, there are three labs (with extended pre-labs) in the course of three weeks where students design a multi-stage amplifier, and this period was honestly very tough (probably not helped by the fact that I had a non-contributing lab partner... I imagine it would have been slightly better with some help). Remember, this class takes you from 16AB level circuits (no more than 5 nodes usually, with <em>ideal</em> op-amp(s) and maybe some capacitors) to the cusp of literally designing an op-amp from &#34;scratch&#34; with two not-always-similar transistor technologies (CMOS is what you learn in class, and bipolar is thrown in for the labs), so the class as a whole is one long, steep slope. Add to this rigorous problem sets that aren&#39;t necessarily well-interleaved with the lab assignments, and I&#39;m sure you get the picture that this class is at least as difficult as, say, 61C (which you&#39;ve hopefully taken, if you plan on taking 161). I guess one nice thing is that the exams aren&#39;t the most difficult to prepare for and do well on (or I might just be good at circuits exams)-- at the very least I didn&#39;t feel that I put any more effort into preparing for them than I did for the exams in 16AB, although it kind of sucks that most of the previous exams on HKN/TBP are greater than 10 years old and on mostly different material.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "is6p815tz306kj", "updated": "2018-08-06T16:41:09Z"}], "config": {}, "created": "2018-08-06T04:12:21Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["peer_directed"], "history": [{"anon": "stud", "content": "<p>Hi everyone! I&#39;m considering taking the three techs above as well as a 3 unit breadth and a 2 unit special topics course (both P/NP). How difficult do you think this schedule would be and how difficult is EE105 compared to other EE courses like 120 or the 16 series?</p>\n<p></p>\n<p>Thanks!</p>", "created": "2018-08-06T04:12:21Z", "subject": "Course load: EE105, CS161, CS189", "uid_a": "a_0"}], "i_edits": [], "id": "jkhrf1ug3ev35m", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 1, "no_answer_followup": 0, "nr": 7368, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654548816271, "tag_good": [], "tag_good_arr": [], "tags": ["peer_directed", "student", "unanswered"], "type": "question", "unique_views": 287}