{"bookmarked": 4, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jn6rnqkkcnsq2", "type": "create", "uid_a": "a_0", "when": "2018-10-13T01:32:45Z"}, {"anon": "stud", "to": "jn6rnqkglwoq1", "type": "followup", "uid_a": "a_0", "when": "2018-10-13T01:36:26Z"}, {"anon": "stud", "data": "jn9m5f9xh9452a", "to": "jn6rnqkglwoq1", "type": "s_answer", "uid_a": "a_1", "when": "2018-10-15T01:21:51Z"}], "children": [{"anon": "stud", "bucket_name": "Week 10/7 - 10/13", "bucket_order": 77, "children": [], "config": {}, "created": "2018-10-13T01:36:26Z", "data": {"embed_links": null}, "folders": [], "id": "jn6rsgmi9tw49q", "no_answer": 1, "no_upvotes": 0, "subject": "OP here: i was also considering taking 54 with 170 and then eventually taking 16B but I have no experience with circuits so I am not considering this option very much. ", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_0", "updated": "2018-10-13T01:36:26Z"}, {"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2018-10-15T01:21:51Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>In terms of workload EE16A is not too bad (p-sets are somewhat long, but are not conceptually difficult at least for the lin alg. part, circuits may get a bit harder, but the workload should be 4-5hrs per week if you are keeping up with the notes and lectures). This combination will probably be the lightest out of the 3 you listed.</p>\n<p></p>\n<p>A lot of people have provided good recommendations on taking 170 and 61c: &#64;7030 &#64;6549 &#64;6965 &#64;6920 &#64;6778</p>\n<p>The general consensus seems to be that 170 has heavy p-sets while 61c has heavy projects. Expect to spend a lot of time on both classes. It’s not impossible and if you really want to prioritize classes that require 61c as a prerequisite, this might be your best option.</p>\n<p></p>\n<p>I would search on Piazza for perspectives on 170 and 188 and the other classes you listed.</p>\n<p>Here are a few previous posts &#64;6454 &#64;5660 &#64;5467 &#64;4988</p>", "created": "2018-10-15T01:21:51Z", "subject": "", "uid_a": "a_1"}], "id": "jn9m5f9lfi5529", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}], "config": {}, "created": "2018-10-13T01:32:45Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["enrollments", "lscs"], "history": [{"anon": "stud", "content": "Hey guys,<div><br /></div><div>I am currently taking CS 70 and hopefully will declare after this semester. In each of my first 3 semesters I essentially only took 1 technical per semester and just took breadths with the 61A/B/70 series (other than taking math 1B with 61B but I wouldn’t really count that as a technical). I am also not one of the people who intuitively gets lots of concepts, on the contrary I usually spend tons of time on classes just to kind of get on a level playing field. Next semester I am considering taking a few potential classes in combination with 170. I really feel I should take 170 in Spring 2019 to help with recruiting for internships in fall 2020. These are my potential schedules:</div><div><br /></div><div> 170 with EE16A (if 170 ends up allowing alternative final exams) </div><div><br /></div><div>Or </div><div><br /></div><div>170 with 61C (I am potentially worried this might be too difficult for me because it will be my first time taking 2 technicals and these are supposed to be a very difficult combo. However, I definitely don’t procrastinate (I try to start homework/projects the day I get them or soon after). I also am very tempted by, and am sort of leaning towards, this schedule because many upper divs require or at least suggest 61C as a pre-requisite so I think taking 61C in Spring 2019 would give me a lot more flexibility in terms of what classes I can take in upcoming semesters.</div><div><br /></div><div>Or</div><div><br /></div><div>170 with one of the “lowest” workload upper div CS classes. I was considering taking 188 with 170 but their finals are separated by 1 hour and since both of these classes are supposed to have difficult exams , in combination with the fact that I usually feel brain dead after just 1 final, I am kind of scared of this option. Some of the other “low” workload upper divs like 161 and 168 say you should take 61C before them, and other upper divs like 160 that don’t require 61C seem to still be pretty high workload, which might be difficult with 170. I was also looking into 194 classes but the only one that seems to be offered next semester is cryrography which seems like it will probably be pretty difficult and the professor recommends taking 170 before it.</div><div><br /></div><div>If anyone could offer me some advice, personal perspectives on taking some of these combinations (especially 170 with 61C), or any suggestions, I would really appreciate it!!</div>", "created": "2018-10-13T01:32:45Z", "subject": "Questions about potential schedules for next semester", "uid_a": "a_0"}], "i_edits": [], "id": "jn6rnqkglwoq1", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 1, "nr": 7802, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654548482742, "tag_good": [], "tag_good_arr": [], "tags": ["enrollments", "lscs", "student"], "type": "question", "unique_views": 490}