{"bookmarked": 18, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jnt4kfn64a215h", "type": "create", "uid_a": "a_0", "when": "2018-10-28T17:05:02Z"}, {"anon": "stud", "data": "jntasfsy4g91v1", "to": "jnt4kfn2o4x15g", "type": "s_answer", "uid_a": "a_1", "when": "2018-10-28T19:59:13Z"}, {"anon": "stud", "to": "jnt4kfn2o4x15g", "type": "followup", "uid_a": "a_2", "when": "2018-10-28T21:14:08Z"}, {"anon": "stud", "to": "jnt4kfn2o4x15g", "type": "feedback", "uid_a": "a_2", "when": "2018-10-28T21:19:26Z"}, {"anon": "stud", "to": "jnt4kfn2o4x15g", "type": "feedback", "uid_a": "a_3", "when": "2018-10-28T21:49:06Z"}, {"anon": "no", "to": "jnt4kfn2o4x15g", "type": "feedback", "uid": "is6p6unggda5ox", "when": "2018-10-28T22:20:14Z"}, {"anon": "no", "to": "jnt4kfn2o4x15g", "type": "followup", "uid": "is6p6unggda5ox", "when": "2018-10-28T22:23:01Z"}, {"anon": "stud", "to": "jnt4kfn2o4x15g", "type": "followup", "uid_a": "a_4", "when": "2018-11-01T18:53:51Z"}, {"anon": "stud", "to": "jnt4kfn2o4x15g", "type": "feedback", "uid_a": "a_5", "when": "2018-11-03T00:59:44Z"}, {"anon": "stud", "to": "jnt4kfn2o4x15g", "type": "feedback", "uid_a": "a_6", "when": "2018-11-03T02:37:14Z"}, {"anon": "stud", "to": "jnt4kfn2o4x15g", "type": "feedback", "uid_a": "a_4", "when": "2018-11-03T23:38:57Z"}, {"anon": "stud", "to": "jnt4kfn2o4x15g", "type": "feedback", "uid_a": "a_2", "when": "2018-11-07T04:56:10Z"}, {"anon": "no", "to": "jnt4kfn2o4x15g", "type": "feedback", "uid": "is6p6unggda5ox", "when": "2018-12-08T11:11:03Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2018-10-28T19:59:13Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>This is a really personal question, so I think the answers will have a fair amount of variance.</p>\n<p></p>\n<p>I usually take 4-5 technicals. I have a dating life, but I sacrifice the ability to sleep, drink/socialize on the weekends, and I have acquired a pretty steep caffeine addiction. It can be extremely stressful to take on a lot of time commitment, but if you are interested in the things you&#39;re studying, it&#39;s worth it imo.</p>\n<p></p>\n<p>I suggest pushing your limits and finding what works for you. I have found that, in pushing my limits, I look back on my semesters with a lot of pride in what I have learned and accomplished. Does it suck during the semester? Yes, but for the person I am, it&#39;s worth it to expose myself to as much material as I can while I&#39;m at Berkeley.</p>\n<p></p>\n<p>I wish you the best, and good on you for looking for challenges!</p>", "created": "2018-10-28T19:59:13Z", "subject": "", "uid_a": "a_1"}], "id": "jntasfsjfur1v0", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p6unggda5ox", "name": "Farid Waziri", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "iscem14kbsu5vi", "name": "Keerthi Bhattaram", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6levcg63q20t", "name": "Henry Leou", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"jhw82c92o5p1dh": 1532404312}, "facebook_id": null, "id": "hzd1lb5fiuc2sq", "name": "Nimalen Sivapalan", "photo": "1456610056_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/hzd1lb5fiuc2sq/1456610056_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j3xjtuhov607fr", "name": "Kate McDowall", "photo": "1497849585_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/j3xjtuhov607fr/1497849585_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"jpslgn3m4lsk6": 1555223627}, "facebook_id": null, "id": "jhobhold1yokb", "name": "Kaushik Sankar", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "idt70iw29cx3", "name": "Lucie Choi", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvhopc26l6a8", "name": "Laiming Huang", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["is6p6unggda5ox", "iscem14kbsu5vi", "j6levcg63q20t", "hzd1lb5fiuc2sq", "j3xjtuhov607fr", "jhobhold1yokb", "idt70iw29cx3", "jktvhopc26l6a8"], "type": "s_answer"}, {"anon": "stud", "bucket_name": "Week 10/28 - 11/3", "bucket_order": 86, "children": [{"anon": "stud", "bucket_name": "Week 10/28 - 11/3", "bucket_order": 86, "children": [], "config": {}, "created": "2018-10-28T21:19:26Z", "data": {"embed_links": null}, "folders": [], "id": "jntdnlqkiq176c", "subject": "<p>Whoops not everything copied over. The rest:</p>\n<p></p>\n<p>you find your own time and your own way to relax. For me, its the hour at the beginning of the day to get ready and prepare myself for a lot of work ahead, and the hour in the evening of either going on my phone (which I’ve been doing a bit less lately bc I think its impacting my sleep) or reading a book. I also reserve Friday nights for myself - after I finish class Friday afternoon I don’t study and either hangout with friends or watch a movie or whatever I want to do that isn’t studying. </p>\n<p></p>\n<p>Biggest tips:</p>\n<ol><li>Time management is key - every possible hour must be used in order to accomplish everything on your to do list</li><li>If you have any free time between class - use it to work on assignments/study. Even if you only have an hour, you won’t be able to work on any major assignments but you can do lighter stuff like checking piazza, responding to emails, reading for a course, etc</li><li>Bring your own lunch to school. Do you know how much time is wasted walking to the lunch place, waiting in line to order, waiting for the food, eating it, walking back to class? If you bring your own food, you can eat it whenever - even in the middle of class. A few weeks ago I forgot my lunch so I walked to Yali’s and waited 20 minutes for my freaking bagel - I could have eaten my own lunch in that time. </li><li><ol><li>Easy and health lunch: whole wheat tortilla wrap, rice, beans, peppers, olives, sauerkraut. Meal prep the ingredients on Sunday, store in separate containers in the fridge, assemble the morning or or night before.</li></ol></li></ol>\n<p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_2", "updated": "2018-10-28T21:19:26Z"}, {"anon": "stud", "bucket_name": "Week 10/28 - 11/3", "bucket_order": 86, "children": [], "config": {}, "created": "2018-10-28T21:49:06Z", "data": {"embed_links": null}, "folders": [], "id": "jntepqodzi43pq", "subject": "<p> </p>\n<p>(Note: some of the details here may identify me to some of my friends - please don’t say my name bc pretending to have some anonymity helps me share this personal stuff to the several thousand students on this page but I think this stuff needs to be said so I’m gonna share anyway)<br /><br />I think that from your numerous posts in this piazza giving seemingly &#34;great&#34; advice, it is pretty clear who you are haha</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2018-10-28T21:49:06Z"}, {"anon": "no", "bucket_name": "Week 10/28 - 11/3", "bucket_order": 86, "children": [], "config": {}, "created": "2018-10-28T22:20:14Z", "data": {"embed_links": null}, "folders": [], "id": "jntftskxvae5dc", "subject": "<p>This was an absolute AMAZING read. You are totally awesome for sharing. You&#39;ve helped so many people with this post response, remember that now and in the future :)</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "is6p6unggda5ox", "updated": "2018-10-28T22:20:14Z"}], "config": {}, "created": "2018-10-28T21:14:08Z", "data": {"embed_links": null}, "folders": [], "id": "jntdgrza8a1qi", "no_answer": 0, "no_upvotes": 0, "subject": "<p></p><p>(Note: some of the details here may identify me to some of my friends - please don’t say my name bc pretending to have some anonymity helps me share this personal stuff to the several thousand students on this page but I think this stuff needs to be said so I’m gonna share anyway)</p>\n<p></p>\n<p>I am currently in 4ish techs - (an upper div stat course, an upper div  math course, a lighter CS upper div, and an Econ course (which is basically an applied multivariable calculus course). I am also an 8 hr TA for a course. I have had a similar schedule (2-4 techs) since I’be been at Berkeley. </p>\n<p></p>\n<p>In my 2.5 years at Berkeley, I’ve gone the whole spectrum of being able to handle something like this, and I’ve made a lot of mistakes that I want to share in order for people to get some use out it and maybe have an easier time than I did.</p>\n<p></p>\n<p>I am going to be brutally honest, because you’re right in that most people don’t really share how stressed they are vs how they are managing it, and its something we need to over come. </p>\n<p></p>\n<p>Weekday Routine:</p>\n<p>Wake up 6:30am - get ready, eat breakfast (ya can’t think if you’re hungry)</p>\n<p>Get to campus at 8am either for class or for working on homework. </p>\n<p>Go to lectures, discussions, labs, and if I have any breaks in between class I work on homework. </p>\n<p>I either leave campus at 6 or 8pm depending if I have a late class.</p>\n<p>give myself an hour to eat dinner/shower</p>\n<p>Work on homework for another 2 hours</p>\n<p>Spend about 45 minutes - 1 hour getting ready for the next day (making lunch etc) or reading a book to decompress</p>\n<p>Sleep between 10pm and11pm. </p>\n<p></p>\n<p>Weekend Routine:</p>\n<p>Wake up between 8-9:30am (I like to sleep in sometimes ;) )</p>\n<p>Study on campus from 10ish - 4ish (depending on how productive I’ve been)</p>\n<p>Take 4ish -10pm as friend/me/chore time. </p>\n<p></p>\n<p>I’ve sacrificed various things in the past two years:</p>\n<ol><li>My first two years here  I scarified my social life. Watching all my freshman floor mates hanging out on a Wednesday night and I was like “don’t y’all have homework to do? I have so much!”. Spring semester freshman year I only had like one conversation a week with someone that wasn’t about the courses or the extracurriculars I was in. At the time, it didn’t bother me that much because I was so focused on getting things done. But this past summer I some pretty amazing social interactions and I realized that I really needed some more social time (for my sanity but also growth as a person) so that was my goal this semester. Now I hang out with friends a bit more often, and make it a priority to say yes to some things/events that I wouldn’t have gone too last year. I still probably hang out with friends than some people (most of my non-study friend hangouts are Friday and Saturday nights), but its getting better</li><li><ol><li>One tip I discovered this year was studying with people - we don’t actually work on the same assignments, but even just sitting with people and taking 5 minute breaks every hour to chat about random stuff goes a long way in cultivating your social health. </li><li><ol><li>Sometimes you can be a little less productive so you also have to know when you need to sequester yourself in the library to get stuff done. </li></ol></li></ol>\n</li><li>Sleep also used to be a big priority (I used to go to bed even earlier), but as I’ve made time for more social events, I have lost about an hour of sleep I used to get. I can manage it most of the time, but I’ve also learned to say no to extra events or hangouts when I’ve had a week of bad sleep because bad sleep is singlehandedly the worst thing to get me off track - a lack of sleep makes the world seem so much more depressing and awful. </li><li>I don’t have a set hour a day to go to the RSF and work out, so I make sure I get my blood pumping by walking to class everyone(I have a long walk up a hill) (I only take the bus if its pouring rain) and taking a lot stairs on campus. You do what you Gotta do. </li></ol>\n<p></p>\n<p>How do I stay on top of the work?</p>\n<ol><li>I spend a lot of times in office hours and piazza. I have a lot of questions when first encountering material and identifying what I don’t understand, and asking questions till I understand every intricacy goes a long way in helping me understand the material. </li><li>Keeping up with lectures - I go to most of my lectures, and sometimes I’m like “why am I spending an hour and a half in this room I could be doing so much more” but whenever I don’t go to lecture I never end up watching the video which is worst. So don’t fall behind. </li><li>figure out what supplemental material you need to help you learn the subject. I like to read textbooks in addition to lectures (bc most of them are written well) but other people prefer Khan academy videos and the like. </li></ol>\n<p></p>\n<p>How do I deal with Stress?</p>\n<p>I’m a very anxious person, and I’ve gone through many stages of handling stress in the past two years. Freshman spring semester, I actually began having panic attacks from the stress of trying to finish all of my assignments and get good grades. I ended up seeing a therapist for that semester, who gave me some great coping strategies (side note: don’t hesitate to reach out about mental health - the Tang center offers services. There’s no shame in getting therapy). I also had a lot of stress because coming from high school, I had tied a lot of my self worth into my grades. Berkeley STEM classes were hard, and it was devastating to me to do bad on exams. But after two years of getting sometimes bad exams scores and still ending up ok, I’ve learned to let myself be sad for a bit after a bad score and then I move on. </p>\n<p>Case in point: I got less than 40% (raw) on a final in the spring. When I got the score back, I ugly cried for about 30 minutes, and then I went to a concert and moved on. I still ended up with a B&#43; in the course! Curves are your friend lol. </p>\n<p>Some things that help me: </p>\n<p>When you have a lot of commitment , if you think about everything you have to do in the next few weeks its very easy to panic and be overwhelmed. I’ve found that if I only focus on a week at a time, or even a day at a time, I can prevent the paralyzing panic of “o my god o my god o my god”. What is due first? Let me do that assignment. What is next? And so on. </p>\n<p></p>\n<p>This semester, which is the most workload I’ve ever had, I’ve gotten into the habit of channeling my nervous energy into adrenaline and focus for assignments - like “I don’t have time for a breakdown right now I’ve got shit to do”. So like the nervousness is channeled into motivation to get stuff done. This is NOT a healthy long term coping mechanism. The repression of anxiety will build up and spill out every few weeks. And then you have a small breakdown. When that happens, its important to either 1) take some time for yourself - forget about your assignments for a couple hours, take a walk, read a book or 2) find a good friend and talk to them about it, so that they can be like “its gonna be ok” while they listen to you. </p>\n<p>It’s also ok to let it out in a good cry once in a while - its therapeutic and healthy. </p>\n<p>In fact, I write this right after a small breakdown myself - I have a midterm tomorrow and maybe I shouldn’t have gone out twice this weekend, because now Im unmotivated and tired and pretty stressed and not sure how I’m going to pull it together, but I also know that if I had spent another weekend of pure studying and no interaction ( like I did last weekend) I would go insane. </p>\n<p>It’s also good to talk about it! People don’t talk about their stress enough here at Cal, and it really helps. This post was actually somewhat therapeutic. Find some friends that you can let a little steam off with (don’t dump it all onto one friend though - its too much for both of you. ). </p>\n<p></p>\n<p>Lastly, you find yo</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_2", "updated": "2018-10-28T21:14:08Z"}, {"anon": "no", "bucket_name": "Week 10/28 - 11/3", "bucket_order": 86, "children": [], "config": {}, "created": "2018-10-28T22:23:01Z", "data": {"embed_links": null}, "folders": [], "id": "jntfxd4f8t61rp", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Student Answer, that was a really great response :)</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "is6p6unggda5ox", "updated": "2018-10-28T22:23:01Z"}, {"anon": "stud", "bucket_name": "Week 10/28 - 11/3", "bucket_order": 86, "children": [{"anon": "stud", "bucket_name": "Week 10/28 - 11/3", "bucket_order": 86, "children": [], "config": {}, "created": "2018-11-03T00:59:44Z", "data": {"embed_links": null}, "folders": [], "id": "jo0qq5nb5vgzw", "subject": "<p>Since you know how to study and get good grades, any tips? I can&#39;t seem to score on exams to save my life.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_5", "updated": "2018-11-03T00:59:44Z"}, {"anon": "stud", "bucket_name": "Week 10/28 - 11/3", "bucket_order": 86, "children": [], "config": {}, "created": "2018-11-03T02:37:14Z", "data": {"embed_links": null}, "folders": [], "id": "jo0u7jfh4416h5", "subject": "<p>Different guy here</p>\n<p></p>\n<p>Most important thing would be study habits - make sure you&#39;re keeping a steady effort through the semester rather than cramming. Some people can get by with decent grades from cramming, but I feel like they could do a lot better if they didn&#39;t. For CS classes at least - keep up with lecture and start assignments early. Makes a world of difference. If your study habits are A1 and you feel like you understand the material well, read on -</p>\n<p></p>\n<p>I think performing on exams is a lot like performing in sports. You might be fine during practice (i.e. studying), but if you get nervous when it&#39;s go time (the exam) it can really screw you up. Some people have test anxiety - unfortunately I don&#39;t have much to say about this, other than consider that one exam in the long run won&#39;t affect your life too much.</p>\n<p></p>\n<p>Personally, the day I have a midterm I use that as an excuse to not do ANY work, for a few hours at least. For the few hours before the exam, I&#39;ll watch YouTube, cook dinner (since midterms are usually at night), twiddle my thumbs, whatever - anything that isn&#39;t classwork, for ANY class. You want your brain to be rested, at the very least out of academic cram mode. I&#39;ve found that this helps with anxiety as well.</p>\n<p></p>\n<p>Wish you the best :)</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_6", "updated": "2018-11-03T02:37:14Z"}, {"anon": "stud", "bucket_name": "Week 10/28 - 11/3", "bucket_order": 86, "children": [], "config": {}, "created": "2018-11-03T23:38:57Z", "data": {"embed_links": null}, "folders": [], "id": "jo23a4df7of25y", "subject": "OP who made this comment. The biggest indicator for success is taking MANY past exams in test conditions early, ie give yourself a timer, bring a cheat sheet. For this to work, you need to be caught up on the material. Previewing a few weeks of the course/doing the first bit of work also helps. <div><br /></div><div>Also I hate to say this but testing comes pretty naturally to me, so I don’t know how much of this advice will be useful. :((((</div>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_4", "updated": "2018-11-03T23:38:57Z"}, {"anon": "stud", "bucket_name": "Week 11/4 - 11/10", "bucket_order": 85, "children": [], "config": {}, "created": "2018-11-07T04:56:10Z", "data": {"embed_links": null}, "folders": [], "id": "jo6oxmmswue5tr", "subject": "<p>Practice tests are KEY. </p>\n<p></p>\n<p>I did an experiment last semester where I had a really difficult course load and two of my courses had midterms on the same day, and assignments due a few days later. </p>\n<p></p>\n<p>Looking at my schedule I knew that it was not humanely possible for me to attend every class, finish all the assignments, take enough practice tests, get enough sleep, and all my other obligations in the time that I had (and I started thinking about this a week or two in advance so it wasn&#39;t like the night before). </p>\n<p></p>\n<p>So I was like &#34;Ok, me thoroughly completing and understanding the hw and project that is due a few days later will be my studying - I will make sure I know this concept and flex my brain muscles. I will do that for studying instead of practice tests&#34;. </p>\n<p></p>\n<p>It didn&#39;t work. </p>\n<p></p>\n<p>I got 1 SD below the mean on one midterm and 0.3 SD below the mean on the other midterm. </p>\n<p></p>\n<p>And this happened twice. For midterm 1 and midterm 2 in both classes. </p>\n<p></p>\n<p>And so for the final, I was like &#34;ok I need to get my shit together in class #1&#34;. So during dead week, I took 3-4 practice tests. And most importantly, not only did I take the practice tests, and like force myself to spend at least 10 minutes on every problem (even if I was stuck), I also thoroughly corrected the tests. For every answer I got wrong, I made sure I understood what logical mistake led me to the incorrect answer, and I understood why the solution was correct. For every problem I got stuck on and left blank, I made sure I understood why the official solution worked, and I tried to find <em>what line of reasoning would have gotten me unstuck during an exam. </em>For example, I might have been trying to prove the forward implication of a statement and got stuck, when I actually should have realized that the contrapositive was much easier to prove and gone down that direction. And if I didn&#39;t understand the official solution (which was quite often because they weren&#39;t written the best), I sat in office hours and bugged the TA&#39;s until I understood. This strategy is what helps me prepare the best for exams. And after this strategy, I got &#43;0.75 above the mean on the final. </p>\n<p></p>\n<p>Properly taking practice tests one of the best strategies for exams. </p>\n<p>Also &#43;1 other anon&#39;s comment about not cramming - you need to let the material sink in over a matter of weeks - what you learn in a few days/overnight is only surface level. </p>\n<p></p>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "j84vts9t9a719k", "name": "Vivek Datta", "photo": null, "photo_url": null, "role": "student", "us": false}], "tag_good_arr": ["j84vts9t9a719k"], "type": "feedback", "uid_a": "a_2", "updated": "2018-11-07T04:56:10Z"}, {"anon": "no", "bucket_name": "Week 12/2 - 12/8", "bucket_order": 81, "children": [], "config": {}, "created": "2018-12-08T11:11:03Z", "data": {"embed_links": null}, "folders": [], "id": "jpfcz56k8dp3mr", "subject": "<p>These responses are amazing, you are all helping so many people with these :)</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "is6p6unggda5ox", "updated": "2018-12-08T11:11:03Z"}], "config": {}, "created": "2018-11-01T18:53:51Z", "data": {"embed_links": null}, "folders": [], "id": "jnyy7s6g72i6ni", "no_answer": 0, "no_upvotes": 0, "subject": "<p>I&#39;ll be posting some persona info, so please don&#39;t expose my identity if you figure out/guess who I am. Feel free to text me asking if this is me though.</p>\n<p></p>\n<p>a. What are you taking and what&#39;s your extra curricular activities?</p>\n<p></p>\n<p>4 techs, since doing a CS &#43; technical major. Extra curriculars including TAing, csm, reading, running, and hanging out with friends.</p>\n<p></p>\n<p>b. Whats your daily routine?</p>\n<p></p>\n<p>Wake up, either grab clothes I prepped from night before, or find some clean clothes, but em on, do the morning hygene stuff. Head to class or someplace to do work. I don&#39;t eat breakfast, but usually I eat lunch between 11-2pm, and by then I&#39;d like to have some work done. I have classes/club stuff throughout the day until 8, and then I am free to go eat dinner and hang out with friends/do work. </p>\n<p>Throughout the day I either go to lecture, or skip it if its webcasted and I want to hang out with friends instead/go to something else.</p>\n<p></p>\n<p>I usually do homework last minute, which is a bad habit, but it&#39;s worked for me so far. I run on the weekends, and sleep in. I think I spend too much time with friends lol.</p>\n<p></p>\n<p>c. What do you sacrifice(not do) in order to succeed and/or survive with a busy schedule?</p>\n<p>Deep understanding of materials. I know how to study and so I get good grades, but I don&#39;t put as much effort into each class as I would if I had a lot more time. </p>\n<p>I don&#39;t exercise as much as I want to. I don&#39;t have as much free time for extra learning/courses like I did in high school. Some days I get pretty tired by the end of the day and just play on my phone mindlessly which I don&#39;t like about myself. I don&#39;t eat breakfast. </p>\n<p></p>\n<p>Sometimes I procrastinate so much that I have homeworks/projects due the next day and I work late into the night. Never all nighters tho, and never multiple late night days in a row.</p>\n<p></p>\n<p>d. How stressful does it get? Normally people at Berkeley don&#39;t talk about how stressed they are, so it&#39;d be nice to get a real perspective.</p>\n<p>Honestly I don&#39;t really get stressed. I know i&#39;ll do fine in my classes, and if not, it&#39;s chill.</p>\n<p></p>\n<p>e. What tips do you have to balance so much work? Work in study groups? Live in office hours? No more hangouts with friends?</p>\n<p>Preview the material beforehand if you can. This helped me a lot in 61a/math 54. Study groups aren&#39;t super helpful for me, but slc/office hours are.</p>\n<p></p>\n<p>f. Do you have time to relax and do nothing/watch netflix?</p>\n<p>Yes definitely. I think this is really important for my general happiness.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_4", "updated": "2018-11-01T18:53:51Z"}], "config": {}, "created": "2018-10-28T17:05:02Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["peer_directed", "eecs", "lscs", "cs-intended"], "history": [{"anon": "stud", "content": "<p>Although I don&#39;t plan on taking so many commitments, I do want to take at least 2 difficult CS classes next semester, and apply for tech clubs. However, I like to sleep at least 7 hours a night, and exercise 30min-1hour daily. I also want to socialize with friends through parties on weekend and join a fun club for an interest of mine.</p>\n<p></p>\n<p>For those who do so much and succeed(or don&#39;t):</p>\n<p></p>\n<p>a. What are you taking and what&#39;s your extra curricular activities?</p>\n<p>b. Whats your daily routine?</p>\n<p>c. What do you sacrifice(not do) in order to succeed and/or survive with a busy schedule?</p>\n<p>d. How stressful does it get? Normally people at Berkeley don&#39;t talk about how stressed they are, so it&#39;d be nice to get a real perspective.</p>\n<p>e. What tips do you have to balance so much work? Work in study groups? Live in office hours? No more hangouts with friends?</p>\n<p>f. Do you have time to relax and do nothing/watch netflix?</p>", "created": "2018-10-28T17:05:02Z", "subject": "How to juggle 3&#43; techs, academic clubs/frats, sleep and exercise?", "uid_a": "a_0"}], "i_edits": [], "id": "jnt4kfn2o4x15g", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 8109, "num_favorites": 32, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654548089194, "tag_good": [{"admin": false, "endorser": {"j9j0udrxjjp758": 1521427072}, "facebook_id": null, "id": "j6lewwo2ic82zi", "name": "Owen Zhang", "photo": "1522084310_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/j6lewwo2ic82zi/1522084310_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j84vts9t9a719k", "name": "Vivek Datta", "photo": null, "photo_url": null, "role": "student", "us": false}, {"admin": false, "endorser": {"jhw82c92o5p1dh": 1532404312}, "facebook_id": null, "id": "hzd1lb5fiuc2sq", "name": "Nimalen Sivapalan", "photo": "1456610056_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/hzd1lb5fiuc2sq/1456610056_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j3hwokaffi34ce", "name": "Joy Dong", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6nu4j7a2be46b", "name": "Shaantam Chawla", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6lrx7lxeqz3e4", "name": "Tsai-Jwu (Judy)", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j5t4jng127q29e", "name": "Hideaki Yoshida", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "k5k3fsp6g1u6lv", "name": "Dayne Tran", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["j6lewwo2ic82zi", "j84vts9t9a719k", "hzd1lb5fiuc2sq", "j3hwokaffi34ce", "j6nu4j7a2be46b", "j6lrx7lxeqz3e4", "j5t4jng127q29e", "k5k3fsp6g1u6lv"], "tags": ["cs-intended", "eecs", "lscs", "peer_directed", "student"], "type": "question", "unique_views": 882}