{"bookmarked": 2, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "jp07ktdbtr23mx", "type": "create", "uid": "icdxydvnk125h8", "when": "2018-11-27T20:43:24Z"}], "children": [], "config": {}, "created": "2018-11-27T20:43:24Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements"], "history": [{"anon": "no", "content": "<p><strong></strong></p>\n<p>Hello Nicole,<br /><br />We understand that sometimes your semester has not gone as planned, and you may be struggling in one or more of your classes. If you find yourself in this situation, please <a href=\"https://berkeley.us16.list-manage.com/track/click?u=e87fa971126ebb54207b9e016&amp;id=0ff1f6d6a9&amp;e=2abc3f37e2\" target=\"_blank\">contact your ESS Adviser</a>. After discussing your circumstances with your ESS Adviser, you may be able to pursue one of the below options:<br /><br /><a href=\"https://berkeley.us16.list-manage.com/track/click?u=e87fa971126ebb54207b9e016&amp;id=ef9086c74f&amp;e=2abc3f37e2\" target=\"_blank\">Green Petition</a>: The green petition can be used for one late change to class schedule (one late add, one late drop, one late change to grading option, or one late change to units for a variable unit course). You can use the green petition <strong>one time</strong> during your undergraduate career in the College of Engineering. You must meet all of the following requirements after the green petition is processed in order for it to be approved:</p>\n<ul><li>Unless you are graduating at the end of the semester or have been previously approved for a reduced course load for the semester, you must still be enrolled in at least 12 units.</li><li>Unless you have completed all of your major/degree requirements, you must still be enrolled in at least 2 technical courses that fulfill requirements for your major.</li><li>You must still be enrolled in all courses that can satisfy a requirement for your major on a letter graded basis.</li></ul>\n<p><strong>The Fall 2018 deadline to submit the green petition is 4:45 p.m. on Friday, December 7.</strong><br /><br /><a href=\"https://berkeley.us16.list-manage.com/track/click?u=e87fa971126ebb54207b9e016&amp;id=a0d8a1b860&amp;e=2abc3f37e2\" target=\"_blank\">Blue Petition</a>: You may submit this petition to request late changes to your class schedule if you have experienced extenuating circumstances after the add/drop/change of grading option deadlines. Extenuating circumstances may include a serious illness, significant mental health issues, death of a close family member, etc. Documentation must be submitted with the blue petition. Your ESS Adviser will inform you of the outcome of your blue petition once it has been reviewed by the Dean&#39;s Committee. <br /><br /><strong>The Fall 2018 deadline to submit the blue petition, with detailed statement and sufficient documentation, is 3:00 p.m. on Friday, December 7.</strong><br /><br /><a href=\"https://berkeley.us16.list-manage.com/track/click?u=e87fa971126ebb54207b9e016&amp;id=46394e8182&amp;e=2abc3f37e2\" target=\"_blank\">Withdrawal</a>: You may choose to drop all of your classes for the semester by requesting to withdraw. You are advised to <a href=\"https://berkeley.us16.list-manage.com/track/click?u=e87fa971126ebb54207b9e016&amp;id=2169dec6e0&amp;e=2abc3f37e2\" target=\"_blank\">contact your ESS Adviser</a> to inform your adviser of your intention to withdraw. To submit a withdrawal request, select &#34;Add a Withdrawal Request&#34; located on your CalCentral Dashboard and choose Fall 2018 as the semester. Please be aware that students who withdraw after the eighth week of the semester are not permitted to enroll in the following semester. When your withdrawal is processed, your Fall 2018 and Spring 2019 classes will be dropped. You may then work with your ESS Adviser in the spring semester if you wish to return Fall 2019. Before withdrawing, international students should contact the <a href=\"https://berkeley.us16.list-manage.com/track/click?u=e87fa971126ebb54207b9e016&amp;id=54e4943dda&amp;e=2abc3f37e2\" target=\"_blank\">Berkeley International Office</a>, and financial aid recipients should contact the <a href=\"https://berkeley.us16.list-manage.com/track/click?u=e87fa971126ebb54207b9e016&amp;id=4a62db4cba&amp;e=2abc3f37e2\" target=\"_blank\">Financial Aid Office</a>.<br /><br /><strong>The Fall 2018 deadline to submit your withdrawal request on CalCentral is 3:00 p.m. on Friday, December 7.</strong><br /><br />If you wish to discuss any concerns with your ESS Adviser, please <a href=\"https://berkeley.us16.list-manage.com/track/click?u=e87fa971126ebb54207b9e016&amp;id=d99fe21803&amp;e=2abc3f37e2\" target=\"_blank\">make an appointment</a> or come to drop-in hours on Wednesdays, 9:00-11:30 or 1:00-3:30.<br /><br />Engineering Student Services</p>", "created": "2018-11-27T20:43:24Z", "subject": "EECS Major Late Change of Schedule", "uid": "icdxydvnk125h8"}], "i_edits": [], "id": "jp07ktd7ydq3mw", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 8274, "num_favorites": 2, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654547945524, "tag_good": [], "tag_good_arr": [], "tags": ["announcements", "instructor-note"], "type": "note", "unique_views": 570}