{"bookmarked": 9, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jqkatlyzqrf3ak", "type": "create", "uid_a": "a_0", "when": "2019-01-06T02:49:19Z"}, {"anon": "stud", "data": "jqkaubb8u8b3iu", "type": "update", "uid_a": "a_0", "when": "2019-01-06T02:49:52Z"}, {"anon": "stud", "data": "jqkavn1o43r262", "type": "update", "uid_a": "a_0", "when": "2019-01-06T02:50:54Z"}, {"anon": "stud", "data": "jqkaz1fev2t2wn", "type": "update", "uid_a": "a_0", "when": "2019-01-06T02:53:33Z"}, {"anon": "no", "to": "jqkatlyviqp3aj", "type": "followup", "uid": "ijbyyqoowfj720", "when": "2019-01-06T05:19:34Z"}, {"anon": "stud", "to": "jqkatlyviqp3aj", "type": "followup", "uid_a": "a_1", "when": "2019-01-06T07:05:39Z"}, {"anon": "stud", "to": "jqkatlyviqp3aj", "type": "feedback", "uid_a": "a_2", "when": "2019-01-06T20:16:10Z"}, {"anon": "stud", "to": "jqkatlyviqp3aj", "type": "feedback", "uid_a": "a_3", "when": "2019-01-08T07:13:24Z"}, {"anon": "stud", "to": "jqkatlyviqp3aj", "type": "feedback", "uid_a": "a_2", "when": "2019-01-08T07:58:55Z"}, {"anon": "stud", "to": "jqkatlyviqp3aj", "type": "feedback", "uid_a": "a_3", "when": "2019-01-08T08:13:55Z"}, {"anon": "stud", "to": "jqkatlyviqp3aj", "type": "feedback", "uid_a": "a_1", "when": "2019-01-08T09:26:44Z"}, {"anon": "stud", "to": "jqkatlyviqp3aj", "type": "feedback", "uid_a": "a_2", "when": "2019-01-08T19:36:50Z"}, {"anon": "stud", "to": "jqkatlyviqp3aj", "type": "feedback", "uid_a": "a_3", "when": "2019-01-08T21:17:14Z"}, {"anon": "stud", "to": "jqkatlyviqp3aj", "type": "feedback", "uid_a": "a_4", "when": "2019-01-09T00:32:50Z"}, {"anon": "no", "data": "jqprgw4kfew5l7", "to": "jqkatlyviqp3aj", "type": "s_answer", "uid": "is6pa2e9c481b9", "when": "2019-01-09T22:34:10Z"}, {"anon": "no", "data": "jqproq0gh4z41z", "type": "s_answer_update", "uid": "is6pa2e9c481b9", "when": "2019-01-09T22:40:16Z"}, {"anon": "stud", "to": "jqkatlyviqp3aj", "type": "feedback", "uid_a": "a_5", "when": "2019-01-09T23:38:23Z"}], "children": [{"anon": "no", "bucket_name": "Week 1/6 - 1/12", "bucket_order": 65, "children": [], "config": {}, "created": "2019-01-06T05:19:34Z", "data": {"embed_links": null}, "folders": [], "id": "jqkg6u1hib78m", "no_answer": 0, "no_upvotes": 0, "subject": "<p>I think it could depend on what specifically you want to do in grad school, but I would generally recommend stats to prepare for ML grad school. I think stats would give you more of the theoretical foundation, which may be harder to learn on your own.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "ijbyyqoowfj720", "updated": "2019-01-06T05:19:34Z"}, {"anon": "stud", "bucket_name": "Week 1/6 - 1/12", "bucket_order": 65, "children": [{"anon": "stud", "bucket_name": "Week 1/6 - 1/12", "bucket_order": 65, "children": [], "config": {}, "created": "2019-01-06T20:16:10Z", "data": {"embed_links": null}, "folders": [], "id": "jqlc7v9p27b39l", "subject": "<p>Who hurt you? </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_2", "updated": "2019-01-06T20:16:10Z"}, {"anon": "stud", "bucket_name": "Week 1/6 - 1/12", "bucket_order": 65, "children": [], "config": {}, "created": "2019-01-08T07:13:24Z", "data": {"embed_links": null}, "folders": [], "id": "jqnf4xg2x6h27s", "subject": "<p>they&#39;re right although a bit brusque; the DS major is not built on theoretical foundations and isn&#39;t appropriate for grad school </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2019-01-08T07:13:24Z"}, {"anon": "stud", "bucket_name": "Week 1/6 - 1/12", "bucket_order": 65, "children": [], "config": {}, "created": "2019-01-08T07:58:55Z", "data": {"embed_links": null}, "folders": [], "id": "jqngrgo3g4ggd", "subject": "<p>First, that&#39;s not what the person said. If they had put in a somewhat blunt manner that the DS major does&#39;t adequately prepare students for advanced degrees, I would have not written my initial comment. Instead, they chose to use language that was both denigrating and useless. Calling a major a &#34;joke&#34; does not serve to advance any knowledge nor does it respect the guidelines set out for discourse on this forum. Second, the DS major here is one of the most open-ended degrees one can acquire meaning that if one were to have aspirations of grad school, they could certainly attain the proper &#34;theoretical foundations&#34; for such a path. For example, a student primarily interested in ML could take EECS 126 for their probability requirement, Info 154 or 159 and Stat 135 for their computational requirement, CS 189 for their machine learning requirement, and EECS 127 and Math 118 for a domain emphasis in Applied Math. This took me 5 minutes to look up and barring any redundancy in classes I may not be aware of, certainly meets most definitions of adequate theoretical foundations. There seems to be this narrative on piazza that DS is a bad major for students who couldn&#39;t declare CS when in reality DS offers so much choice and freedom that to pigeonhole it doesn&#39;t make any sense and to call it lacking in mathematical rigor, frankly, stupid. It&#39;s up to the individual the level of rigor they want and whether you believe that is a good or bad thing is another topic of discussion, but to claim that the major is incapable of providing critical mathematical foundations for graduate school is just plain wrong. Moreover, before anyone responds claiming I am arguing against a straw man and that DS is not as looked down upon as I am claiming it is, just a few posts ago someone said that DS100 was good enough to make you a python monkey, but nothing more which even if correct, is so incredibly out of line for a platform like piazza that the fact that someone was comfortable saying that and more importantly barely called out is completely emblematic of how DS is treated by the larger CS community at Berkeley. Why can&#39;t we all just learn (or choose not to learn) cool math together without having to downplay each others&#39; majors? </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_2", "updated": "2019-01-08T07:58:55Z"}, {"anon": "stud", "bucket_name": "Week 1/6 - 1/12", "bucket_order": 65, "children": [], "config": {}, "created": "2019-01-08T08:13:55Z", "data": {"embed_links": null}, "folders": [], "id": "jqnhaqndvom105", "subject": "<p>Let me rephrase; I spoke quickly. I meant that many people who take the DS major (without CS) plan to follow a path that do not take classes like 126, 127, stat 135, etc. As much as what you said is true by the books, the way it is currently, many people who are going to DS are using it as a backup major for CS if they can&#39;t declare. And to be honest, if you are unable to declare in CS, then it is unlikely (possible, but takes great effort) that you will succeed in many of these upper divs (lacking mathematical maturity.) </p>\n<p></p>\n<p>Majors people have turned to after unable to declare cs like applied math or cogsci have often been joked around at Berkeley; it&#39;s a problem that isn&#39;t unique to DS. </p>\n<p></p>\n<p>The point is that if you are going to grad school, you should first and foremost take the classes that you are interested in / relevant to your studies. </p>\n<p></p>\n<p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2019-01-08T08:13:55Z"}, {"anon": "stud", "bucket_name": "Week 1/6 - 1/12", "bucket_order": 65, "children": [], "config": {}, "created": "2019-01-08T09:26:44Z", "data": {"embed_links": null}, "folders": [], "id": "jqnjwea3ig838k", "subject": "<p>OP of the comment here: My comment was specifically aimed at the person who asked the question, not at all DS majors. What I meant to say was that, in my opinion, it is absolutely useless for someone to get a double major by doing DS when you already have a core major like CS, Stats or Applied Math and this is an opinion that has resonated multiple times on this forum, including instances where academic advisers themselves suggested the same.<br />The classes that you mentioned above are integral classes for other majors, not DS. Yes, DS majors can choose to take them but the majority of the DS majors who actually end up taking those classes/can handle them are primarily CS or Stat double majors and my point is that you don&#39;t have to add DS as a double major in order to take the classes you need.<br /><br />Lastly, about the &#34;joke&#34; part, I apologize for the naivety of my language. But if you&#39;re taking offence regarding DS majors getting downplayed, I think the facts cannot be ignored: much of the questions asked on the DS Piazza come from people who are figuring out how they can declare the major after either failing or doing poorly (or P/NP-ing) classes such as CS61A/B, Math 53/54/1AB, which are core foundational classes essential for doing well in theoretical upper-div EECS/Stat/Math classes and even grad school.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_1", "updated": "2019-01-08T09:26:44Z"}, {"anon": "stud", "bucket_name": "Week 1/6 - 1/12", "bucket_order": 65, "children": [], "config": {}, "created": "2019-01-08T19:36:50Z", "data": {"embed_links": null}, "folders": [], "id": "jqo5oz7w5i04q6", "subject": "<p>I&#39;ll be responding to primarily to the first commenter here, but I insist that both of you take a second to look at my arguments again. First, whether most DS majors choose to embark upon classes like 126, 127, etc is entirely irrelevant. The original post asked which of DS/Stats could adequately prepare a student for a future in ML. I am arguing that the DS major, through the fact that it is a largely multidisciplinary major, can in fact provide the foundations for ML and is not a &#34;joke.&#34; Whether most students choose to take those upperdivs is unrelated to this fact since I am attesting to the potential of the major. Moreover, since the OP is asking about the potential to learn ML from Stats/DS, the amount of students taking 126, 127, etc is rendered even more useless. Furthermore, if the initial comment was phrased as &#34;don&#39;t do CS and DS since they are largely redundant and will share too many classes to constitute a distinct learning experience&#34; I would have no problem. However, the comment was framed such that not only is DS a joke of a major, but if you&#39;re already doing CS it&#39;s even more of a joke. This is an indefensible comment that does not arise from naivety, but rather a dismissal of DS as a major. Second, the assertion that because Applied Math and Cogsci are disparaged by CS/EECS majors, DS being downplayed is no surprise or exception entirely misses the point of my frustration. If you want to be on the first floor of Moffitt calling DS a joke, that&#39;s entirely acceptable given the guidelines set out for open and public discourse. However, piazza is not a place for this kind of discussion and it is from my experience that DS is the most often of the &#34;backup CS majors&#34; to be openly ridiculed in this way. Now of course there is bias in my sample as DS is a relatively novel major when compared to Applied Math and Cogsci and, because of that fact, could be garnering more attention from the less polite among us; however, there is clear and recent evidence of disparaging comments being made on piazza and no matter your opinion on the content of the major, these kinds of statements are unhelpful and detrimental to students. Lastly, the claim that 126, 127, etc are not core classes for DS is equally true of CS if one were to choose a future where that material would be irrelevant (eg SWE, Consulting, etc); however, if a DS or CS student wanted to undertake an advanced degree in ML, then of course they would be core classes for both majors. In addition to this fact, your claims about the mathematical maturity in the DS population go entirely unsubstantiated and more so rely on a heavily biased sample. Piazza would naturally attract more students who are doing poorly and asking for course advice since that is what the piazza was set up to do, assist students who need help with decision making.</p>\n<p></p>\n<p>To wrap this all up, it may seem that I am some overly-triggered student launching a crusade against a single comment, but in reality, I believe that it is important to check these sorts of comments so that other students don&#39;t read them and think that it&#39;s okay or normal to simply bash an entire population of the student body. It is not about being sensitive to every little fact or detail, it&#39;s about encouraging fruitful discussion and contesting illogical and unhelpful claims.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_2", "updated": "2019-01-08T19:36:50Z"}, {"anon": "stud", "bucket_name": "Week 1/6 - 1/12", "bucket_order": 65, "children": [], "config": {}, "created": "2019-01-08T21:17:14Z", "data": {"embed_links": null}, "folders": [], "id": "jqo9a3lu2rx5p7", "subject": "<p>People ask on piazza to know the in-practice truth. We can read the major info online and about syllabus material but we come here to see how hard the courseload really is or how the major plays out in real life. The fact remains that <em>if you can declare cs, you would declare cs over ds. </em>Anyone who’s taken 126 knows that the class is majority EECS with some CS, and a sprinkling of any other majors. </p>\n<p></p>\n<p>You need to realize that, yes, the DS major is good in theory and has the possibility to create a well rounded program. But you need to focus more on the fact that it’s being used as a backup for weaker students or a extra double major for students who would’ve taken extra classes anyways. Hell, I could declare DS on top of CS easily given I’ve taken ds100,126, etc. already. </p>\n<p></p>\n<p>Anyways, as the first round of DS majors haven’t graduated just yet, we have still to see how they will fare in industry. My guess is that, like applied math and cogsci majors, it will be a matter of looking at the courses taken anyways. </p>\n<p></p>\n<p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_3", "updated": "2019-01-08T21:17:14Z"}, {"anon": "stud", "bucket_name": "Week 1/6 - 1/12", "bucket_order": 65, "children": [], "config": {}, "created": "2019-01-09T00:32:50Z", "data": {"embed_links": null}, "folders": [], "id": "jqog9mzs5az58c", "subject": "<p>new anon here. I think everyone is right in a way. there are students taking DS as backup major and only taking the relatively &#34;straightforward&#34; (still hard) courses needed to graduate.</p>\n<p>However, i think we should remain respectful to the major because there are students that are doing DS because they are legitimately interested in data science. Downplaying the major would be downplaying these people.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_4", "updated": "2019-01-09T00:32:50Z"}, {"anon": "stud", "bucket_name": "Week 1/6 - 1/12", "bucket_order": 65, "children": [], "config": {}, "created": "2019-01-09T23:38:23Z", "data": {"embed_links": null}, "folders": [], "id": "jqptrh7zm0p5pq", "subject": "<p>oh for (bleeped out word b/c its Piazza)&#39;s sake not this again. </p>\n<p></p>\n<p></p>\n<p>things that matter way more than your major:</p>\n<p>1) research you do</p>\n<p>2) classes you take</p>\n<p>3) projects you do</p>\n<p>4) pretty much anything else </p>\n<p></p>\n<p>ESPECIALLY for grad school research matters more than anything ... but don&#39;t take that from me take that from Scott Shenker who used to run grad school admissions... but what does he know. </p>\n<p></p>\n<p>for jobs: As long as you can demonstrate that you can do the work that&#39;s what matters. The vast majority of employers are happy to look at other non-cs and eecs majors provided you demonstrate on your resume your work. Companies are smart, they want the best fits for their job and they will go to huge lengths to look for this. Getting a referral or having a killer research project are way more important for scoring a cool gig. For many non traditional CS students </p>\n<p></p>\n<p>&#64;OP your EECS master race bias is also seen in the statement &#34;<em> </em>Anyone who’s taken 126 knows that the class is majority EECS with some CS, and a sprinkling of any other majors.&#34; Disappointing that this very discredited idea is still making arounds in Berkeley CS. For the record when I took it, it was enrolled in it the CS EECS split was surprisingly equal. </p>\n<p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_5", "updated": "2019-01-09T23:38:23Z"}], "config": {}, "created": "2019-01-06T07:05:39Z", "data": {"embed_links": null}, "folders": [], "id": "jqkjz9bpvfx7lw", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Don&#39;t waste your time doing the DS major here; its almost like a joke, especially if you&#39;re already doing CS..</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_1", "updated": "2019-01-06T07:05:39Z"}, {"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2019-01-09T22:34:10Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "no", "content": "<p>The comments on this thread are a firestorm, but I would recommend Statistics over DS as you will be taking more rigorous, theoretical, math-heavy courses which are appropriate to prepare you for ML grad school. You can also take these classes in Data Science, or CS, or Applied Math, or anything else really -it&#39;s technically possible to mold your program however you want to, there&#39;s a ton of freedom and classes are not nearly as hard to get into as people often make it out to be.</p>", "created": "2019-01-09T22:40:16Z", "subject": "", "uid": "is6pa2e9c481b9"}, {"anon": "no", "content": "<p>The comments on this thread are a firestorm, but I would recommend Statistics over DS as you will be taking more rigorous, theoretical, math-heavy courses which are appropriate to prepare you for ML grad school.</p>", "created": "2019-01-09T22:34:10Z", "subject": "", "uid": "is6pa2e9c481b9"}], "id": "jqprgw4dr775l6", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}], "config": {}, "created": "2019-01-06T02:49:19Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["other"], "history": [{"anon": "stud", "content": "<p>I was a spring admit which means I would graduate during the fall. I&#39;m interested in studying ML in grad school which is one of the reasons why I believe that graduating in the spring would be a better fit for me. I&#39;d like to study at Berkeley for 9 semesters and a double major seems to give me that leeway. I&#39;m split on whether or not a Statistics or DS double would give me the best preparation for grad school. I feel like Statistics would help me mature more academically than DS, but feel like DS can cater more to ML. I&#39;m also open to Applied Math but it seems that Statistic or DS may prepare better. Any thoughts? Thanks!</p>", "created": "2019-01-06T02:53:33Z", "subject": "Double in Stats or Data Science for ML", "uid_a": "a_0"}, {"anon": "stud", "content": "<p>I was a spring admit which means I would graduate during the fall. I&#39;m interested in studying ML in grad school which is one of the reasons why I believe that graduating in the spring would be a better fit for me. I&#39;d like to study at Berkeley for 9 semesters and a double major seems to give me that leeway. I&#39;m split on whether or not a Statistics or DS double would give me the best preparation for grad school. I&#39;m also open to Applied Math but it seems that Statistic or DS may prepare better. Any thoughts? Thanks!</p>", "created": "2019-01-06T02:50:54Z", "subject": "Double in Stats or Data Science for ML", "uid_a": "a_0"}, {"anon": "stud", "content": "<p>I was a spring admit which means I would graduate during the fall. I&#39;m interested in studying ML in grad school which is one of the reasons why I believe that graduating in the spring would be a better fit for me. I&#39;d like to study at Berkeley for 9 semesters and a double major seems to give me that leeway. I&#39;m split on whether or not a Statistics or DS double would give me the best preparation for grad school. I&#39;m also open to Applied Math but it seems that Statistic or DS may prepare better. Any thoughts? Thanks!</p>", "created": "2019-01-06T02:49:52Z", "subject": "Double in Stats or Data Science for ML", "uid_a": "a_0"}, {"anon": "stud", "content": "<p>I was a spring admit which means I would graduate during the fall. I&#39;m interested in studying ML in grad school which is one reason why I believe that graduating in the spring would be a better fit for me. I&#39;d like to study at Berkeley for 9 semesters and a double major seems to give me that leeway. I&#39;m split on whether or not a Statistics or DS double would give me the best preparation for grad school. I&#39;m also open to Applied Math but it seems that Statistic or DS may prepare better. Any thoughts? Thanks!</p>", "created": "2019-01-06T02:49:19Z", "subject": "Double in Stats or Data Science for ML", "uid_a": "a_0"}], "i_edits": [], "id": "jqkatlyviqp3aj", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 8523, "num_favorites": 6, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654547718485, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "idvyyvxjglc", "name": "Pedram Pourdavood", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6d4undmzeh69g", "name": "Shivin Devgon", "photo": "1553216198_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/j6d4undmzeh69g/1553216198_35.png", "published": true, "role": "student", "us": false}], "tag_good_arr": ["idvyyvxjglc", "j6d4undmzeh69g"], "tags": ["other", "student"], "type": "question", "unique_views": 644}