{"bookmarked": 2, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "jrmaz70qvxk1qz", "type": "create", "uid": "icdxydvnk125h8", "when": "2019-02-01T17:08:54Z"}], "children": [], "config": {}, "created": "2019-02-01T17:08:54Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["announcements"], "history": [{"anon": "no", "content": "<p></p><p dir=\"ltr\">This year the Ramadan holiday falls during the spring 2019 final exam period (Monday, May 13-Friday, May 17). We would like to inform you of the Academic Senate policies that outline the responsibilities of both faculty and students with respect to course conflicts and accommodations of all types. These policies are available below, and are also written out at the end of this message. </p>\n<p dir=\"ltr\"></p>\n<ul><li>\n<p dir=\"ltr\"><a href=\"http://teaching.berkeley.edu/academic-calendar-and-student-accommodations-campus-policies-and-guidelines#anchor2\" target=\"_blank\">Accommodation of Religious Creed</a></p>\n</li><li>\n<p dir=\"ltr\"><a href=\"http://teaching.berkeley.edu/academic-calendar-and-student-accommodations-campus-policies-and-guidelines#anchor3\" target=\"_blank\">Conflicts Between Extracurricular Activities and Academic Requirements</a></p>\n</li></ul>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Faculty and students may refer to the <a href=\"https://teaching.berkeley.edu/checklist-scheduling-conflicts-academic-requirements\" target=\"_blank\">Checklist for Scheduling Conflicts with Academic Requirements</a> for guidelines in handling conflicts and accommodations. We encourage faculty and students to work together constructively to find the best feasible solution in each instance. </p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Students should note that it is their responsibility to inform faculty of their needs for accommodation.<strong> Because this reminder is coming in the second week, we ask that students request accommodations no later than February 15, 2019. </strong></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">During the spring 2019 final exam period, Cal Dining will provide to-go meal options in the dining commons. Student Affairs is also working on providing additional prayer and meditation spaces on campus. Details will be announced later this semester.</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">Best regards,<br />Paul Alivisatos</p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">================</p>\n<p></p>\n<p>ACCOMMODATION OF RELIGIOUS CREED</p>\n<p dir=\"ltr\">In compliance with Education code, Section 92640(a), it is the official policy of the University of California at Berkeley to permit any student to undergo a test or examination, without penalty, at a time when that activity would not violate the student&#39;s religious creed, unless administering the examination at an alternate time would impose an undue hardship which could not reasonably have been avoided. Requests to accommodate a student&#39;s religious creed by scheduling tests or examinations at alternative times should be submitted directly to the faculty member responsible for administering the examination.<br /><br />Reasonable common sense, judgment and the pursuit of mutual goodwill should result in the positive resolution of scheduling conflicts. The regular campus appeals process applies if a mutually satisfactory arrangement cannot be achieved.<br /><br />The link to this policy is available in the <a href=\"http://registrar.berkeley.edu/calendar\" target=\"_blank\">Religious Creed</a> section of the Academic Calendar webpage.<br /><br />Religious Holidays Calendar<br />A <a href=\"https://teaching.berkeley.edu/religious-holidays-2017-2018-academic-year\" target=\"_blank\">2018-19 Religious Holidays Calendar</a> has been compiled and is now posted on the Center for Teaching and Learning’s website. This calendar will be updated on an annual basis to assist faculty and staff in course and activity planning and to reference in the accommodation process.</p>\n<p dir=\"ltr\">CONFLICTS BETWEEN EXTRACURRICULAR ACTIVITIES AND ACADEMIC REQUIREMENTS<br />The Academic Senate has established Guidelines Concerning Scheduling Conflicts with Academic Requirements to address the issue of conflicts that arise between extracurricular activities and academic requirements. These policies specifically concern the schedules of student athletes, student musicians, those with out-of-town interviews, and other students with activities (e.g., classes missed as the result of religious holy days) that compete with academic obligations.<br /><br />These policies were updated in Spring 2014 to include the following statement:<br /><br />-The pedagogical needs of the class are the key criteria when deciding whether a proposed accommodation is appropriate. Faculty must clearly articulate the specific pedagogical reasons that prevent accepting a proposed accomm odation. Absent such a reason, the presumption should be that accommodations are to be made.<br /><br />The guidelines assign responsibilities as follows:<br /><br />-It is the instructor’s responsibility to give students a schedule, available on the syllabus in the first week of instruction, of all class sessions, exams, tests, project deadlines, field trips, and any other required class activities.<br /><br />-It is the student’s responsibility to notify the instructor(s) in writing by the second week of the semester of any potential conflict(s) and to recommend a solution, with the understanding that an earlier deadline or date of examination may be the most practicable solution.<br /><br />-It is the student’s responsibility to inform him/herself about material missed because of an absence, whether or not he /she has been formally excused.<br /><br />The <a href=\"https://academic-senate.berkeley.edu/committees/ugc\" target=\"_blank\">complete guidelines</a> are available on the Academic Senate website. Additionally, a <a href=\"https://teaching.berkeley.edu/checklist-scheduling-conflicts-academic-requirements\" target=\"_blank\">checklist</a> to help instructors and students comply with the guidelines is available on the Center for Teaching and Learning website.<br /><br />**Please note: Simultaneous proctored administration of a remote exam is an appropriate solution to exam security concerns. Berkeley faculty, faculty at the destination institution and the normal proctoring services here and remotely are presumed to be suitable sources of independent proctoring. Care should be taken that conflict of interest or the appearance of conflict of interest be avoided in undertaking proxy p roctorships. It is not a significant increase in faculty workload to have a suitable proctor pick up exam copy(s) several days in advance, followed by returning the completed exams with several days after administration. </p>", "created": "2019-02-01T17:08:54Z", "subject": "Ramadan &amp; Finals", "uid": "icdxydvnk125h8"}], "i_edits": [], "id": "jrmaz70mvvq1qy", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer_followup": 0, "nr": 8714, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654547504366, "tag_good": [], "tag_good_arr": [], "tags": ["announcements", "instructor-note"], "type": "note", "unique_views": 628}