{"bookmarked": 6, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "js1d6lyzqp37jz", "type": "create", "uid_a": "a_0", "when": "2019-02-12T06:07:12Z"}, {"anon": "stud", "to": "js1d6lyujqm7jy", "type": "followup", "uid_a": "a_1", "when": "2019-02-12T16:01:22Z"}, {"anon": "stud", "to": "js1d6lyujqm7jy", "type": "followup", "uid_a": "a_2", "when": "2019-02-12T19:03:07Z"}, {"anon": "stud", "data": "js2b9d3yqmh689", "to": "js1d6lyujqm7jy", "type": "s_answer", "uid_a": "a_3", "when": "2019-02-12T22:01:08Z"}], "children": [{"anon": "stud", "bucket_name": "Week 2/10 - 2/16", "bucket_order": 58, "children": [], "config": {}, "created": "2019-02-12T16:01:22Z", "data": {"embed_links": null}, "folders": [], "id": "js1yepkqleb36y", "no_answer": 0, "no_upvotes": 0, "subject": "<p>I am a DSP student with learning disabilities who takes a reduced course load, but I can&#39;t help you here because I am not comfortable giving my full name to piazza and they will ban me. But I am breaking my usual silence because I don&#39;t want you to feel like you are alone. I&#39;m not aware of having met another EECS/CS DSP student who needs to take a reduced course load either, so I have always felt alone. I&#39;m not sure how much I could help anyway, but if nobody better suited shows up, maybe there is a way that we can both email an advisor who can put us in touch through email or something.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_1", "updated": "2019-02-12T16:01:22Z"}, {"anon": "stud", "bucket_name": "Week 2/10 - 2/16", "bucket_order": 58, "children": [], "config": {}, "created": "2019-02-12T19:03:07Z", "data": {"embed_links": null}, "folders": [], "id": "js24wflspdd7o7", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Another CS DSP student here. Older students might be better at giving advice on what CS classes pair well together (I&#39;m curious about their answers too), but didn&#39;t want you to feel like you&#39;re alone. I suspect there are probably a good number of students with different challenges in the department since it&#39;s so big... but it would be nice if there was an easier way for us to connect with each other and feel less isolated.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_2", "updated": "2019-02-12T19:03:07Z"}, {"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2019-02-12T22:01:08Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>I can&#39;t speak to a reduced course load because of a learning disability, but I&#39;ve had reduced course loads/minimum course loads pretty much every semester I&#39;ve been here for a variety of reasons, including medical. I won&#39;t lie, it&#39;s hard to plan out your schedule and stay in balance and on track. In EECS it is possible to graduate on time with some finessing of your schedule.</p>\n<p></p>\n<p>I would not take two project classes together, first and foremost. Two project classes are always incredibly difficult, for everyone; unfortunately all of the classes on your list except 170 are project classes. I&#39;ve personally found 160 and 169, despite being project classes, to be very chill classes. Yes, they are projects-based classes, but neither are based on difficult theoretical concepts that require a ton of effort to understand, let alone do practically. I&#39;d recommend taking them with the more difficult classes on your list, like 170. 162, from my understanding is also a very difficult class and very intensive. I believe 186 is a more moderate class, while 161 is going to have a lot of variation--I would take it after 70 and 170, and I suspect if you do you&#39;ll have an easier time of it and it will significantly reduce your course load. I found 61b and 61c to be manageable, while EE16b was very time consuming. Disclaimer though: I took a very different set of courses, so I can&#39;t ascribe exactly for this set--I&#39;ve taken 161 (though I dropped it since I struggle with math), 160, and 169. The rest is based on what I&#39;ve heard from classmates and on piazza.</p>\n<p></p>\n<p>I think your fall and spring plans are good, though I might take 170 with a different upper div, like 169. It would depend on how much time you felt you committed to CS 70 and how well you felt you did. 160/169 and 162 would probably be a decent option if you have good groups. 161/186 would probably be manageable, and 16b with whichever of 160/169 you have left. With that said though, multiple project based classes in a semester are always going to be difficult. I would recommend substituting one of your upper divs for CS 168, which is another chill class (despite being project based) and will help you balance your schedule better. </p>\n<p></p>\n<p>I&#39;m going to digress slightly and get on my soapbox. The number one thing to do is meet with your ESS advisor, if you are not already, at least once a semester. I usually make an appointment at the beginning of the semester to discuss how my classes are going, what I see as potential challenges, and how to overcome them (and double check, since I am paranoid, that I am on track to graduate on time). At the end of the semester, I make another to go over what went well, what I need to work on, and what I struggled with, and plan out my schedule for the next semester. My advisor is amazing for advice on what classes have good support structures, which one&#39;s he&#39;s heard are really time intensive, and just listening as I walk through whatever issue I have. Frankly, he&#39;s been my biggest support within Berkeley. If, midway through the semester, something&#39;s falling apart, they&#39;re the absolute best resource for helping you dig yourself out. I know that didn&#39;t really answer your question directly, but that&#39;s something that I think is really relevant and has helped me cope/been my single best resource.</p>\n<p></p>\n<p>I don&#39;t know how much this will help, since my situation was different than yours. I&#39;ll list out what my schedule was too, just in case that helps. I took/am taking C100 (another chill class), 160, 168, 169, and a 194 as my upper divs. I took EE16A/Math 54 (we still had to take it); just 16B; 169/194; 53/160; C100/61c. 70/168; 7b/61b. </p>", "created": "2019-02-12T22:01:08Z", "subject": "", "uid_a": "a_3"}], "id": "js2b9d3r94t688", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jjrna3cwv6tta", "name": "Kersten Naab", "photo": "1548643827_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jjrna3cwv6tta/1548643827_35.png", "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["jjrna3cwv6tta"], "type": "s_answer"}], "config": {}, "created": "2019-02-12T06:07:12Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["other", "eecs"], "history": [{"anon": "stud", "content": "Any other DSP students here to give advice?<div>Hi! I’m an EECS freshman in the DSP. I am planning to take a reduced courseload starting next year and take my h/ss classes over the summers. For EECS I’ve done 61a and 16a so far, and am currently in physics 7b and math 53. Last semester I took 13 units and this semester I’m in 12. It has been very difficult for me to stay caught up so I know a reduced courseload is the right choice. But, I am having a bit of difficult planning out the order of my classes because I don’t know anyone else with a learning disability who has taken upper division CS classes. I haven’t seen any mention of DSP on this Piazza either, but I’m sure someone here must be in DSP too, right?</div><div><div>One concern of mine is that I might want to take CS170 and CS61C at the same time. (61b/70 fall, 61c/170 spring). It would be my only two classes, but I struggle a lot with my disability so advice given to other people doesn’t apply as much.</div><div>I loved CS61a more than any class I’ve ever taken in my life. EE16a was a lot of work for me—I did very well on the exams, but homework was extremely time consuming even with the accommodation.</div><div>If any other EECS folk have taken a reduced courseload (or have felt this struggle) due to a disability, please let me know your experience with these classes. Is it easier to take CS 170 with a different upper division class? The classes I’d like to take are 160, 161, 162, 169, 186, 170, 70, 61b, 61c, and ee16b. Any suggestions on how to pair those up for the next 5 semesters? I also might wanna do CS9F or one of those.</div><div>I want to take my CS lower divisions and CS 170 ASAP because I thought those are really important for my other classes. I want to take CS 169 ASAP too because I know it isn’t offered every year, but I bet I can get more out of that class if I take it after 170, right? Would it be easier to do 160 or something and 170 at the same time and next take 61C at the same time as 169? I want to know how to get the most out of my classes. I also am considering taking EECS 149 and graduating in 6 semesters from now instead of 5, but I think that would kinda be a waste of time. Unless it would make it a lot easier to manage the other classes that I want to take, or if it would be really useful for me even though I’m more interested in coding than EE.</div></div>", "created": "2019-02-12T06:07:12Z", "subject": "DSP EECS/CS students", "uid_a": "a_0"}], "i_edits": [], "id": "js1d6lyujqm7jy", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 8745, "num_favorites": 3, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654547430061, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jjrna3cwv6tta", "name": "Kersten Naab", "photo": "1548643827_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jjrna3cwv6tta/1548643827_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"j7s01y165odq5": 1}, "facebook_id": null, "id": "i58t7vymmr135t", "name": "Kevin A Marroquin", "photo": null, "photo_url": null, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6lew0wjj462j5", "name": "Cara Wolfe", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jcaukmnvxg16au", "name": "Alexia Colmenero", "photo": "1576615754_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/jcaukmnvxg16au/1576615754_200.jpg", "published": true, "role": "student", "us": false}], "tag_good_arr": ["jjrna3cwv6tta", "i58t7vymmr135t", "j6lew0wjj462j5", "jcaukmnvxg16au"], "tags": ["eecs", "other", "student"], "type": "question", "unique_views": 518}