{"bookmarked": 7, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jsy37inwh8i6mt", "type": "create", "uid_a": "a_0", "when": "2019-03-07T03:44:22Z"}, {"anon": "stud", "to": "jsy37inr5ie6ms", "type": "followup", "uid_a": "a_1", "when": "2019-03-07T11:34:56Z"}, {"anon": "no", "to": "jsy37inr5ie6ms", "type": "followup", "uid": "is6p6unggda5ox", "when": "2019-03-07T21:41:25Z"}], "children": [{"anon": "stud", "bucket_name": "Week 3/3 - 3/9", "bucket_order": 99, "children": [], "config": {}, "created": "2019-03-07T11:34:56Z", "data": {"embed_links": null}, "folders": [], "id": "jsyk0nl6cp05ww", "no_answer": 0, "no_upvotes": 0, "subject": "Why study abroad at that point? Why not just go abroad?", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_1", "updated": "2019-03-07T11:34:56Z"}, {"anon": "no", "bucket_name": "Week 3/3 - 3/9", "bucket_order": 99, "children": [], "config": {}, "created": "2019-03-07T21:41:25Z", "data": {"embed_links": null}, "folders": [], "id": "jsz5olyfp6h2cw", "no_answer": 0, "no_upvotes": 0, "subject": "<p>There will be a few main differences:</p>\n<p>Study Abroad = A.</p>\n<p>Traveling Abroad = B.</p>\n<p></p>\n<p><strong>1. Staying in 1 city for a long time</strong></p>\n<p>A. Live in a certain city for the entire program, which is probably 6-8 weeks during summer? That&#39;s a long and amazing time to &#34;live vs see&#34; a place(imagine waking up and casually strolling down the Vatican City to chill. Imagine doing that 5-10 times. For some, this could be an amazing experience. For some, it can get old). Perhaps someone would enjoy studying abroad in any city, but i&#39;d imagine this isn&#39;t the case. If you really enjoy visiting a city for 5 days, there are two feelings: Satisfied leaving, or wishing you stayed longer. The latter is a good candidate for studying abroad. For someone, visiting Barcelona for 4 days is more than enough, and studying abroad would not be a great experience there. But for that same person, visiting Florence for 4 days may be satisfying, but they enjoyed it and love it so much that studying abroad there would be a phenomenal experience. Everyone is different, so it&#39;s hard to say.</p>\n<p></p>\n<p>B. There&#39;s actually nothing stopping you from getting an AirBNB, Hostel, or Sublet in a city for 1-2 months, and staying there. It might be much more difficult to find a long term place you&#39;re comfortable with and within budget, but it&#39;s certainly a choice. There could be some issues with staying in an AirBNB with yourself but i&#39;ll address it below..</p>\n<p></p>\n<p><strong>2. Visiting many cities around your study abroad destination</strong></p>\n<p>A. It&#39;s definitely doable and an option, especially if you don&#39;t have classes Fridays and Mondays(if both, you have 5 days to visit another city, which is more than enough for most places). I know in Europe, ticket prices round trip won&#39;t be too expensive, even in the summer(at times, X -&gt; Y would cost $150&#43;). However, you will have homework to do.</p>\n<p></p>\n<p>B. In theory, you don&#39;t have any work obligations, so this is essentially all you&#39;re doing. If you&#39;re looking to see as many cities(while enjoying them), you can have many 5 day trips(some cities less, some more, but 5 works for me).</p>\n<p></p>\n<p><strong>3. Prefer socializing and not solo traveling</strong></p>\n<p>A. You&#39;re basically forced to socialize with people, and it essentially becomes a group. Pros and cons to this, especially since there is no academic goal or club structure in which people are incentivized to get along. But if you want people to socialize with while you&#39;re travel, this basically guarantees that. However, it doesn&#39;t guarantee you will get along with them, and doesn&#39;t guarantee you won&#39;t feel certain feelings like loneliness or missing home and family. Not a discouragement, but a realistic perspective in which you just won&#39;t know how you&#39;ll feel regardless if you have people to hangout with. However, if you do the program with friend(s), that could really enhance your experience. But once again, no guarantees.</p>\n<p></p>\n<p>B. You can travel with friend(s). One reason solo travel is nice, is because you choose how you spend your day. With friends, or random study abroad peers, there could be pressure to accommodate. However, generally everyone is feeling this way, and usually, plans are well accommodated for everyone. Also, if you travel solo, you can stay in hostels. HostelWorld is a great website that has reviews and you can purchase stays. Solo or smaller sized rooms are more expensive, but most hostels have cheap accommodation(6-12 people per room with bunk beds). Honestly, hostels are fine as long as there is AC/Heater, clean sheets, clean restrooms. You&#39;ll probably be tired by end of the night and pass out without worrying about being in a room full of people. Yes, people could snore or turn on the lights, but if you&#39;re a deep sleeper, no problem. If you&#39;re a light sleeper, it&#39;s luck of the draw. The best part about hostels is that people are very friendly, and generally want to hangout. There are day tours of cities, and nighttime organized hangouts, including going to bars and clubs together(I know drinking age is 18 in Italy, unsure about other places, in case that&#39;s your thing).</p>\n<p></p>\n<p>4. <strong>Time</strong></p>\n<p>A. If you want to study abroad and finish degree requirements, then there really is no other option. But if you&#39;re done with the degree, these courses, unless you&#39;re super interested, could be a poor use of your free time. I hear a lot about people who want to learn a new language, so if you take a language course at the destination, that works.</p>\n<p></p>\n<p>B. Without classes, you have plenty of more time to explore.</p>\n<p></p>\n<p>5. <strong>Cost</strong></p>\n<p>A. I haven&#39;t done the math, but for programs at Cal, studying abroad is probably overpriced. By overpriced, I mean if you paid for accommodation, transportation, and tickets that would have been provided by the program, I am not 100% sure, but I imagine it will be way cheaper than the program. In addition, I believe you will pay regular Cal tuition, which, imo, is quite expensive. There are community colleges that offer study abroad, and anyone can enroll in a community college for a semester(including you after graduating from Cal), so that is an option, and will most likely be significantly cheaper.</p>\n<p></p>\n<p>B. Probably much cheaper. Hostels can be as cheap as $15 a night(even ones with great reviews). Use SkyScanner or Google Flights to pick flights(generally cheaper than trains, but some people don&#39;t like the wait, airports are generally a little bit outside the city centers, trains are generally in the city center, and some people love the scenery seen during train rides).</p>\n<p></p>\n<p><strong>6. Program Events</strong></p>\n<p>A. Organized events like excursions to other cities, fancy dinners, cooking classes, there are tons of things programs will probably do that&#39;s fun.</p>\n<p></p>\n<p>B. You can just do all of these things without the program.</p>\n<p></p>\n<p><strong>7. Conclusion</strong></p>\n<p>I&#39;ll add more if I think of anything else, but in conclusion...studying abroad is a great option, but I don&#39;t believe you will be missing out on a particular life experience by not studying abroad. It is true, many people tell me they regret not doing it, but those same people didn&#39;t go on a long vacation after graduation as well, or anytime really. So if you have the money, I recommend just going on a 1-3 month vacation after graduation, probably closer to the 1-2 month time in case of burnout or feelings of missing home.</p>\n<p></p>\n<p>I wouldn&#39;t worry. Make a list of cities you want to visit, ranking them could make your life a lot easier when deciding where to go, and when you have time, money, and desire, go check them out. Studying abroad is great(with pros and cons), and vacationing for 1-2 months is great(with pros and cons).</p>\n<p></p>\n<p>Feel free to email me if you have questions about particular cities. If i&#39;ve been, I can offer advice.</p>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "j6nu3kb12o13jp", "name": "Jennifer Xiao", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["j6nu3kb12o13jp"], "type": "followup", "uid": "is6p6unggda5ox", "updated": "2019-03-07T21:41:25Z"}], "config": {}, "created": "2019-03-07T03:44:22Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["eecs", "other"], "history": [{"anon": "stud", "content": "<p>I&#39;m a current EECS junior planning to graduate Spring 2020 and was wondering if it was possible to study abroad Summer 2020, after my senior year. Has anyone done this? What good programs are there to take CS classes abroad? </p>", "created": "2019-03-07T03:44:22Z", "subject": "Study Abroad Summer of Senior Year?", "uid_a": "a_0"}], "history_size": 1, "i_edits": [], "id": "jsy37inr5ie6ms", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 1, "no_answer_followup": 0, "nr": 8826, "num_favorites": 6, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654547357967, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "j3xjtuhov607fr", "name": "Kate McDowall", "photo": "1497849585_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/j3xjtuhov607fr/1497849585_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6nu3l1tkcr3k5", "name": "Owen Bai", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["j3xjtuhov607fr", "j6nu3l1tkcr3k5"], "tags": ["eecs", "other", "student", "unanswered"], "type": "question", "unique_views": 444}