{"bookmarked": 4, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "ju6csyasa6b5x3", "type": "create", "uid_a": "a_0", "when": "2019-04-07T03:14:51Z"}, {"anon": "stud", "data": "juand4ph1um4o8", "to": "ju6csyao2v5x2", "type": "s_answer", "uid_a": "a_1", "when": "2019-04-10T03:21:33Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2019-04-10T03:21:33Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>Depends on what you&#39;re interested in, although I&#39;d highly recommend both classes.</p>\n<p></p>\n<p>I have taken both (and TA&#39;d for DS100). In my experience, I&#39;ve used a lot more of what I have learned from DS100 in internships (SWE) and find it to be more of a practical introduction. Some people would say you could learn the topics on your own. I agree, to a certain extent, but it&#39;s definitely a huge head start if you want to work on Data Analysis in industry. It&#39;s not too theory heavy, so if you&#39;re looking for that you should checkout Stat140, CS189, etc. It&#39;s much lighter in workload than CS162, so if you think you have a lot on your plate already DS100 may be a better option.</p>\n<p></p>\n<p>On the other hand, I thought CS162 was one of the best classes I took at Berkeley (I&#39;m sure many people would disagree). It is quite challenging and a ton of work, so I&#39;m not sure taking it over summer would be a good idea. There&#39;s a lot of content to digest and it takes time to learn. The projects are also time consuming and I think your summer could be better spent doing research, internships, or relaxing :) While it&#39;s a hard class, I thought the content covered was great. It forces you to dive deep into design considerations, think hard about how operating systems work and learn about some very relevant challenges in software engineering. The projects, although difficult, really pushed me to think things through before implementation and consider what could go wrong before I even started coding. It also taught me to trust others and work well as a team. I can&#39;t say you will have the same experience but I really enjoyed this class.</p>\n<p></p>\n<p>I would consider what you want to do in the future and see how both of these classes line up in your plans. Either way, I think you&#39;ll find yourself learning something useful!</p>", "created": "2019-04-10T03:21:33Z", "subject": "", "uid_a": "a_1"}], "id": "juand4p6jee4o7", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}], "config": {}, "created": "2019-04-07T03:14:51Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["eecs"], "history": [{"anon": "stud", "content": "<p>So I&#39;m planning on taking cs 161 and cs 170 this fall, and I was wondering if anyone knew if data 100 or cs 162 would be a better for my third class? Also, I was wondering if it would be worth it to take 162 over the summer since I heard that it&#39;s a really useful class and I don&#39;t know if I&#39;d be able to get the most out of it by rushing it over the summer. Any advice on that would be appreciated. Thank you. </p>", "created": "2019-04-07T03:14:51Z", "subject": "cs 162 vs data 100", "uid_a": "a_0"}], "i_edits": [], "id": "ju6csyao2v5x2", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 9019, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654547236334, "tag_good": [], "tag_good_arr": [], "tags": ["eecs", "student"], "type": "question", "unique_views": 332}