{"bookmarked": 4, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "juuvn3mctn35cb", "type": "create", "uid_a": "a_0", "when": "2019-04-24T07:08:39Z"}, {"anon": "stud", "to": "juuvn3m76du5ca", "type": "followup", "uid_a": "a_1", "when": "2019-04-24T08:26:30Z"}, {"anon": "stud", "to": "juuvn3m76du5ca", "type": "feedback", "uid_a": "a_0", "when": "2019-04-24T08:42:51Z"}], "children": [{"anon": "stud", "bucket_name": "Week 4/21 - 4/27", "bucket_order": 50, "children": [{"anon": "stud", "bucket_name": "Week 4/21 - 4/27", "bucket_order": 50, "children": [], "config": {}, "created": "2019-04-24T08:42:51Z", "data": {"embed_links": null}, "folders": [], "id": "juuz08zxs8d1c7", "subject": "Hey!! Thank you so much for all the info , will definitely check them out! I was wondering if you wanna add me on Facebook / email so we can discuss more about our shared passion? Feel free to shoot me an email at yudi98&#64;berkeley.edu . Thanks again!!", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_0", "updated": "2019-04-24T08:42:51Z"}], "config": {}, "created": "2019-04-24T08:26:30Z", "data": {"embed_links": null}, "folders": [], "id": "juuyf7zlbge11k", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Take a grad class like 262. I haven&#39;t taken it but it goes over modern distributed systems. Also, if you want to develop these technologies, you should know the material in 162 (concurrency and synchronization especially) though if it is just to use them, you probably don&#39;t.</p>\n<p></p>\n<p>Since this is a rapidly developing field, you can also learn a lot from reading stuff online about how different companies use things like Kubernetes/Mesos (and Docker), Kafka, and other distributed systems in their engineering blogs. For example, here are the blogs of the creators of Kafka, <a href=\"https://www.confluent.io/blog/\" target=\"_blank\">Confluent, </a>and the creators of <a href=\"https://www.cockroachlabs.com/blog/\" target=\"_blank\">CockroachDB </a>(a web-scale distributed database).  </p>\n<p>Then you can try out this stuff (for example spinning up toy clusters) on your own projects though you probably won&#39;t reach the scale needed to see anything interesting. If you are interested in developing these types of technologies, most of their associated projects are open-source, and you can also contribute via github or you can do research for someone on campus.</p>\n<p></p>\n<p>You can also ask OCF staff members about these technologies. Some of them work as SREs/ Production Engineers and are knowledgeable about scalability and high-availability best practices used at large companies.</p>\n<p></p>\n<p>Hope that helps! I&#39;m like you. I really enjoy this type of system design.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_1", "updated": "2019-04-24T08:26:30Z"}], "config": {}, "created": "2019-04-24T07:08:39Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["other"], "history": [{"anon": "stud", "content": "I’m really passionate about systems design, i.e. micro-services and having message brokers in between , load balancing the different connections etc that sort of things when architecting a modern distributed app. Can someone recommend some good courses to take that suits this interest? I’ve heard that 162 is a course that is core to systems design but I feel that the design in 162 is too low-level (building an OS is too low level compared to app-level systems design) and I’m more interested in high-level designs like the description above, and hence was hoping for some more insights. Also, what other courses are recommended that will help me pursue my interest? <div><br /></div><div>Thanks!!</div>", "created": "2019-04-24T07:08:39Z", "subject": "Systems design courses", "uid_a": "a_0"}], "i_edits": [], "id": "juuvn3m76du5ca", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 1, "no_answer_followup": 0, "nr": 9333, "num_favorites": 5, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654546784672, "tag_good": [], "tag_good_arr": [], "tags": ["other", "student", "unanswered"], "type": "question", "unique_views": 322}