{"bookmarked": 6, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jvejyy7tfx0557", "type": "create", "uid_a": "a_0", "when": "2019-05-08T01:37:20Z"}, {"anon": "no", "data": "jveu9ars2nr5vg", "to": "jvejyy7nagc555", "type": "s_answer", "uid": "is6p94rzyszeb", "when": "2019-05-08T06:25:19Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2019-05-08T06:25:19Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "no", "content": "<p>I would highly recommend 194, especially if you&#39;re going into cyber-security. The class may not be offered often after next semester, but 161 is almost always offered every semester, so I would take 194 if there is a conflict. 161 is probably webcasted, so that shouldn&#39;t be a big issue in any case. 194&#39;s workload is very consistent, a problem set each week consisting of 3 fairly challenging problems. Compared to 170, each problem would usually be an mediumly hard question in a 170 homework. I would consider 194&#39;s workload pretty light if you did well in 70/170 (especially reductions and mod arithmetic), and otherwise somewhere in the middle.</p>\n<p></p>\n<p>194 is a very mathematic/theoretical class, so it would have little to do with 162. 161 might be a little helpful with 162, but I don&#39;t think there is a big focus on security in 162. 161 would not help at all with 170. However,194 and 170 would be a great combination, as there is a some overlap between the two classes. They&#39;re both very heavy on formal proofs. I would say that 194 has some less intuitive assumptions, for example some proofs have you assume that there exists some encryption schemes that fulfills this specific type of security and construct another encryption scheme that fulfills a more strict definition of security. 170 proofs are a bit more straightforward, at least in how the problem is formulated; they usually give you a problem and you have to solve it in a certain time/space complexity.</p>\n<p></p>\n<p>It&#39;s possible if you&#39;re not a junior right now that 261 and/or 276 will be offered in the future and you may be able to take 276, which would make 194 not as necessary.  Nevertheless, I don&#39;t think it would hurt to take it.</p>\n<p></p>\n<p>Weaver has a very distinctive lecture style. He put a lot of his own personality, experiences, opinions, jokes, etc in his lectures. There&#39;s a lot of opinions on both sides about this, I would search about it on piazza. Raluca is a good lecturer that explains concepts pretty clearly. I don&#39;t have much experience with Wagner, though.</p>\n<p></p>\n<p></p>", "created": "2019-05-08T06:25:19Z", "subject": "", "uid": "is6p94rzyszeb"}], "id": "jveu9ark5975vf", "is_tag_endorse": false, "tag_endorse": [], "tag_endorse_arr": [], "type": "s_answer"}], "config": {}, "created": "2019-05-08T01:37:20Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["eecs"], "history": [{"anon": "stud", "content": "<p>Hi, I&#39;m a student who wants to go into cyber security once I graduate, and I was wondering if anyone has taken 194 before and could tell me how much of a workload that class is, and what topics are covered in it. Also, since 161 and 194 are in the same time slots, I was wondering if anyone could tell me which one would be better to take with 162 and 170. And if anyone could tell me what 161 is like with Weaver vs with Wagner and Raluca Ada Popa, that would be much appreciated. Thank you. </p>", "created": "2019-05-08T01:37:20Z", "subject": "161 vs 194", "uid_a": "a_0"}], "i_edits": [], "id": "jvejyy7nagc555", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 9549, "num_favorites": 1, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654546537746, "tag_good": [], "tag_good_arr": [], "tags": ["eecs", "student"], "type": "question", "unique_views": 562}