{"bookmarked": 3, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jvj0zuwrunp49s", "type": "create", "uid_a": "a_0", "when": "2019-05-11T04:45:00Z"}, {"anon": "stud", "to": "jvj0zuwmbpb49r", "type": "followup", "uid_a": "a_1", "when": "2019-05-11T22:23:38Z"}], "children": [{"anon": "stud", "bucket_name": "Week 5/5 - 5/11", "bucket_order": 46, "children": [], "config": {}, "created": "2019-05-11T22:23:38Z", "data": {"embed_links": null}, "folders": [], "id": "jvk2t9zegiezr", "no_answer": 0, "no_upvotes": 0, "subject": "<p>Financial Aid covers most if not all the costs I believe for tuition. 6 units min. 10th on waitlist, you&#39;ll probably get in, depending on size of class. Well, housing is housing, costs will be basically the same as they are now, but your housing would be mid June-Aug 10ish, so you&#39;ll be looking at subletting for 2 months, and might have to pay more for beginning of june and rest of august.</p>\n<p></p>\n<p>Child care, not sure.</p>\n<p></p>\n<p>It seems there are a lot of variables and so it&#39;s in your best interest to talk to an academic counselor who may have more time to consider all your factors and give solid advice. My gut feeling is that if you&#39;re worried about all these factors, you should just not take summer class, take it during the school year in which you are already obligated to pay all these costs and find child care. Use your summer to build your skills and yourself, whether that&#39;s research, internship, side projects.</p>\n<p></p>\n<p>You can talk to the professors but I imagine their answers will be similar to mine. Doesn&#39;t hurt to ask though. Summer class I took basically was my life for 8 weeks. I took 2 days off the entire 8 weeks, and even that was too much for me personally. You might be different.</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_1", "updated": "2019-05-11T22:23:38Z"}], "config": {}, "created": "2019-05-11T04:45:00Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["other"], "history": [{"anon": "stud", "content": "<p>I not too long ago enrolled in CS189 for the summer, and I&#39;m #10 on the waitlist. I&#39;ve never taking a summer class at Berkeley, and I was wondering if anyone had any experience with, or just flat out know, my chances of getting in.</p>\n<p>That being said I&#39;m worried about FA, housing, child care, etc over the summer if I choose to go all in with taking this class as opposed to other options. Should I shoot an email to the professor and ask? Should I just chance it?</p>\n<p></p>\n<p>Thank you!</p>", "created": "2019-05-11T04:45:00Z", "subject": "Summer 2019: CS189", "uid_a": "a_0"}], "i_edits": [], "id": "jvj0zuwmbpb49r", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 1, "no_answer_followup": 0, "nr": 9582, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654546574932, "tag_good": [], "tag_good_arr": [], "tags": ["other", "student", "unanswered"], "type": "question", "unique_views": 480}