{"bookmarked": 11, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jvk8imxz72a1oi", "type": "create", "uid_a": "a_0", "when": "2019-05-12T01:03:20Z"}, {"anon": "stud", "to": "jvk8imxs7z41oh", "type": "followup", "uid_a": "a_1", "when": "2019-05-12T02:19:23Z"}, {"anon": "stud", "data": "jvkbd02wdx361o", "to": "jvk8imxs7z41oh", "type": "s_answer", "uid_a": "a_2", "when": "2019-05-12T02:22:56Z"}, {"anon": "stud", "to": "jvk8imxs7z41oh", "type": "followup", "uid_a": "a_3", "when": "2019-05-12T04:27:44Z"}, {"anon": "stud", "to": "jvk8imxs7z41oh", "type": "feedback", "uid_a": "a_4", "when": "2019-05-12T04:52:31Z"}, {"anon": "stud", "to": "jvk8imxs7z41oh", "type": "followup", "uid_a": "a_5", "when": "2019-05-12T14:24:22Z"}, {"anon": "stud", "to": "jvk8imxs7z41oh", "type": "feedback", "uid_a": "a_6", "when": "2019-05-12T18:35:51Z"}, {"anon": "stud", "to": "jvk8imxs7z41oh", "type": "feedback", "uid_a": "a_5", "when": "2019-05-12T20:16:13Z"}, {"anon": "stud", "to": "jvk8imxs7z41oh", "type": "feedback", "uid_a": "a_7", "when": "2019-05-12T23:30:27Z"}, {"anon": "stud", "to": "jvk8imxs7z41oh", "type": "followup", "uid_a": "a_8", "when": "2019-05-13T00:46:37Z"}, {"anon": "stud", "to": "jvk8imxs7z41oh", "type": "feedback", "uid_a": "a_8", "when": "2019-05-13T01:06:50Z"}, {"anon": "stud", "to": "jvk8imxs7z41oh", "type": "feedback", "uid_a": "a_0", "when": "2019-05-13T06:06:33Z"}, {"anon": "stud", "to": "jvk8imxs7z41oh", "type": "feedback", "uid_a": "a_9", "when": "2019-05-16T20:49:42Z"}, {"anon": "stud", "to": "jvk8imxs7z41oh", "type": "feedback", "uid_a": "a_0", "when": "2019-05-24T04:25:10Z"}, {"anon": "no", "to": "jvk8imxs7z41oh", "type": "feedback", "uid": "is6p6y4cble5r5", "when": "2019-05-24T19:27:23Z"}], "children": [{"anon": "stud", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 118, "children": [{"anon": "stud", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 118, "children": [], "config": {}, "created": "2019-05-16T20:49:42Z", "data": {"embed_links": null}, "folders": [], "id": "jvr4npz4s1x9", "subject": "<p>What classes did you take after 61C that interested you? I also really love 61C and am taking it right now.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_9", "updated": "2019-05-16T20:49:42Z"}, {"anon": "stud", "bucket_name": "Week 5/19 - 5/25", "bucket_order": 117, "children": [], "config": {}, "created": "2019-05-24T04:25:10Z", "data": {"embed_links": null}, "folders": [], "id": "jw1l0fdgsb6vi", "subject": "<p>Yeah what classes were good for you?</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_0", "updated": "2019-05-24T04:25:10Z"}, {"anon": "no", "bucket_name": "Week 5/19 - 5/25", "bucket_order": 117, "children": [], "config": {}, "created": "2019-05-24T19:27:23Z", "data": {"embed_links": null}, "folders": [], "id": "jw2h8ot9m7y3gu", "subject": "<p>Hey, I&#39;m the first anon (commenting non-anonymously so y&#39;all can contact me if you&#39;re interested to hear more!) I completely forgot I&#39;d commented here! My favorites have been:</p>\n<ul><li>151 - if you enjoyed the CPU design project in 61C, the 151 project is a beefed-up version using a more industry standard flow (Verilog with the Xilinx toolchain). IMO the most useful class project I&#39;ve ever done. Huge workload so don&#39;t underestimate it, but worth every second.</li><li>162 - again, huge workload but great for delving more into the software side of 61C. Again, very interesting and useful projects.</li><li>152 - this gets more into what I would consider the hardware-software interface, touching on both datapaths/memory hierarchies and approaches to writing software. Takes pretty much every element of 61C to a new level of depth and complexity.</li></ul>\n<p>Highly recommend all three!</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "is6p6y4cble5r5", "updated": "2019-05-24T19:27:23Z"}], "config": {}, "created": "2019-05-12T02:19:23Z", "data": {"embed_links": null}, "folders": [], "id": "jvkb8g3t43u1xf", "no_answer": 1, "no_upvotes": 0, "subject": "<p>Getting to take more specialized upper-div classes was something that was really empowering to me - based on my interests from lower-divs (I really enjoyed 61C), I took more specialized classes and found a niche for myself. Getting to take classes that were specialized gave me both the skills and confidence to start engaging in research, and I ended up in a place where I had something I could claim I was pretty good at! So I think a good starting point is to start isolating the things you enjoyed in lower-divs and engage with them in more advanced coursework - I don&#39;t know if that&#39;s a prerequisite to get to the place you want to be, but it helped for me :)</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_1", "updated": "2019-05-12T02:19:23Z"}, {"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2019-05-12T02:22:56Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>One really good way I&#39;ve noticed to bolster your passion/understanding in a certain field is to undertake a project that interests you. At the end of the day, the reason you&#39;re studying this material is so that you can learn to apply it. So try and find an idea that you find interesting; maybe it&#39;s an app that keeps track of your past homework assignments, or a google extension that allows you to instantly share webpages, or an RC car that has obstacle avoidance. Then, use what you already know, google, and other online course sites (like coursera) to figure out more about the thing you are trying to create. In building the product, you&#39;ll end up developing an appreciation for the field of study you are pursuing and that will make classes you take more interesting and informative. Hope this helps!</p>", "created": "2019-05-12T02:22:56Z", "subject": "", "uid_a": "a_2"}], "history_size": 1, "id": "jvkbd02pws761n", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "j3l3zadxpy7594", "name": "Viraj Attre", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvgwu8z5z5gy", "name": "Ashwin Vangipuram", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "iscem14kbsu5vi", "name": "Keerthi Bhattaram", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jzqdjhamcv15kk", "name": "Aditya Dev Varma", "photo": "1598914264_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jzqdjhamcv15kk/1598914264_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "kpxf83tq4f35ul", "name": "Haosheng Li", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["j3l3zadxpy7594", "jktvgwu8z5z5gy", "iscem14kbsu5vi", "jzqdjhamcv15kk", "kpxf83tq4f35ul"], "type": "s_answer"}, {"anon": "stud", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 118, "children": [{"anon": "stud", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 118, "children": [], "config": {}, "created": "2019-05-12T04:52:31Z", "data": {"embed_links": null}, "folders": [], "id": "jvkgpdv3sv94a1", "subject": "<p>^^^ strongly second this.</p>\n<p></p>\n<p>Research isn&#39;t for everyone, it certainly isn&#39;t for me (although I&#39;ve never tried it so I don&#39;t know if I should be talking, lol... but it doesn&#39;t appeal to me that much). There&#39;s nothing wrong with you if you don&#39;t have some passion for research lighting a fire up under you - maybe it lies somewhere else. Maybe it doesn&#39;t even lie within CS, and all the CS you learn will be merely a tool in your future work instead of your focus. Always be open to other possibilities :)</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_4", "updated": "2019-05-12T04:52:31Z"}], "config": {}, "created": "2019-05-12T04:27:44Z", "data": {"embed_links": null}, "folders": [], "id": "jvkfti3sklt4f9", "no_answer": 0, "no_upvotes": 0, "subject": "<p>I definitely agree with the above followup re: upper div courses. I was just grinding through all of the lower divs freshman and sophomore year and not enjoying myself, but once I started taking upper div courses, i was like &#34;omg this stuff is so cool! I had forgotten why I chose this major until I got to this course&#34; - once I got to take the classes that I wanted (you have major requirements, but usually there is a broad range to choose from ), and no longer was forced to slog through lower divs, I became much more passionate about the material. </p>\n<p></p>\n<p>As a different perspective, I also saw people around me doing crazy research and was frustrated for a while why I couldn&#39;t get as invested in that style as everyone else. I also felt frustrated that I was working through all of these classes with nothing to show except an ability to complete homeworks. Once I stepped back and realized the research grind was never really gonna be my thing, I was able to focus my attention on something that did bring me joy: teaching. Getting involved with course staff has given me many things: the ability to help other students have a better experience in a course than I may have (or have one just as good as I did), and teach them material they will use throughout the rest of college (really rewarding); a community of people who I enjoy spending time with; and a much deeper understanding of the material (you think you know a course when you get an A in it but you don&#39;t really know it until you have to explain it to someone in multiple ways). So if you haven&#39;t found your niche in the current research path, try a different angle! </p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_3", "updated": "2019-05-12T04:27:44Z"}, {"anon": "stud", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 118, "children": [{"anon": "stud", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 118, "children": [], "config": {}, "created": "2019-05-12T18:35:51Z", "data": {"embed_links": null}, "folders": [], "id": "jvla46sed454yz", "subject": "<p>A startup is almost certainly not the way to go if you&#39;re interested in retiring quickly, not only because the odds of a startup succeeding are pretty low but because it is usually much quicker and less risky to get rich by working at an existing company whose value you think will skyrocket soon. Highly recommend this talk by Dustin Moskovitz (who has cofounded two different billion dollar companies now): <a href=\"https://www.youtube.com/watch?v=ZoqgAy3h4OM\" target=\"_blank\">link</a>. </p>\n<p>Since industry is probably your best bet, you need to find a way to become invaluable to the point that you can leverage your skills to continuously increase your income over a short period of time. That means you probably need to become very specialized in some area. Of course, grinding leetcode and practicing for interviews is an incredibly important first step, but you&#39;ll need much more if you plan on saving significant amounts of money while enduring high costs-of-living near SF. If you don&#39;t plan on going to grad school, becoming specialized in something before you graduate will take immense amounts of time and dedication. Make a list of subfields withing EECS, read their individual Wikipedia pages, narrow down your choices to something you find interesting, then take every class Berkeley offers that is connected to that subfield and find other ways to supplement your learning. </p>\n<p>If spending time is the prerequisite to affection, hopefully you will come to genuinely enjoy some subfield of computer science and decide to not simply pursue it for money, but even if you don&#39;t, you&#39;ll probably still be able to get rich. </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_6", "updated": "2019-05-12T18:35:51Z"}, {"anon": "stud", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 118, "children": [], "config": {}, "created": "2019-05-12T20:16:13Z", "data": {"embed_links": null}, "folders": [], "id": "jvldp9i0pkkpm", "subject": "<p>Interesting take. I didn&#39;t consider the fact that startups fail all too often. The list of subfields idea sounds good, I&#39;ll look into it. Thanks</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_5", "updated": "2019-05-12T20:16:13Z"}, {"anon": "stud", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 118, "children": [], "config": {}, "created": "2019-05-12T23:30:27Z", "data": {"embed_links": null}, "folders": [], "id": "jvlkn1l9kfr48a", "subject": "<p>If you are doing cs only for the money I would start by re-evaluating your priorities on a higher level IMO</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_7", "updated": "2019-05-12T23:30:27Z"}, {"anon": "stud", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 118, "children": [], "config": {}, "created": "2019-05-13T01:06:50Z", "data": {"embed_links": null}, "folders": [], "id": "jvlo2zypxtz2zg", "subject": "<p>Well, if you want to make big bucks and retire early, I would hope you at least enjoy coding. If you do not enjoy coding at all, you might want to look into other fields. Of course, many people work jobs they hate and could learn to like it if they are on cruise control, but i&#39;m not quite sure if it was worth it to them. You have a choice, assuming you don&#39;t have to support others, to pick a career you feel will at the very least be decently fun. You will spend 8&#43; hours a day doing it, and 250&#43;(too lazy to do the math) days a year doing your job. So you probably think SWE is the most money potential(Doctors make more, but lots of school), and you might be right(i&#39;m not familiar with consulting and finance careers in terms of money), but if you do not enjoy it, I don&#39;t think the money is worth it. Why?</p>\n<p></p>\n<p>Because working using salary, you&#39;ll still probably have to work 15-20 years before you can retire really comfortable. But even at this, you will probably live a really normal life. I think you&#39;ll be able to take modest vacations, but you probably won&#39;t be able to live a luxurious retirement. You will have to work more than that. In addition, this will require lots of saving(and some people think investing in stock market is way to go, others have other ideas for how to invest their money), which will possibly lower the quality of your life even more, depending on your interests.</p>\n<p></p>\n<p>You mention startups. Most startups fail, this could be a stressful time period, and if you&#39;re involved in the CS parts, may involve lots of coding. You could certainly be the 5th or 6th person on a startup team and if it&#39;s really big, you should make a lot of money. Gary Vaynerchuk has some videos on startup life and the pursuit of wealth doing it. I was never interested in startups so I don&#39;t really watch his content, but i&#39;ve seen some videos and think it could be helpful.</p>\n<p></p>\n<p>If you&#39;re just about the money making retire early life, then I don&#39;t see the purpose of teaching and research unless you want to improve your resume to get your first job after graduation. Once you have 1-2 years of experience, I hear that will be the main focus for recruiters.</p>\n<p></p>\n<p>If you want to increase your salary, moving around companies every 2-3 years could help. It&#39;s generally the best way to increase total compensation, although not always the case.</p>\n<p></p>\n<p>I met someone who bought a 2 bedroom house in Virginia or something like that for 100-150K? Living costs in SF/South-Bay and other places are quite high, but the salaries here are much higher.</p>\n<p></p>\n<p>PM make good money, and you might want to look into other fields as well. I personally don&#39;t think you should optimize salary. I think you should optimize happiness, and I think salary could be a big part of that, but that is where balance comes in.</p>\n<p></p>\n<p>Regardless, I think if you just code a lot on the side, do interview prep, maybe intern at a company that pays a lot like Facebook, and just work there and move around to increase your salary, save up and do some non-risky investment if you want, then maybe cash out somewhere away from Bay Area and retire early.</p>\n<p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_8", "updated": "2019-05-13T01:06:50Z"}], "config": {}, "created": "2019-05-12T14:24:22Z", "data": {"embed_links": null}, "folders": [], "id": "jvl14rxru0w5w4", "no_answer": 0, "no_upvotes": 0, "subject": "<p>&#64;all responses, what if you&#39;re only interested in the field for money? what&#39;s the best way to a lot of bucks and the quickest retirement plan, in your opinion? Precedent would say that you need to have a successful startup to sell or make great profit off of yourself, but I generally lack creativity and ideas in that department just don&#39;t come to me. Turning to the job sector, the interview process itself is difficult for me to get past, so I&#39;ve been spending more time trying to get over that hump, just so that I can have a backup plan if I never manage to startup. Any ideas on how to organize my time and effort towards both of these possible avenues to attain my goals? What about academics and extracurriculars such as research/teaching, do they align at all with my goals, or should I generally drop those extra burdens and focus elsewhere?</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_5", "updated": "2019-05-12T14:24:22Z"}, {"anon": "stud", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 118, "children": [{"anon": "stud", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 118, "children": [], "config": {}, "created": "2019-05-13T06:06:33Z", "data": {"embed_links": null}, "folders": [], "id": "jvlysfpt3nd68c", "subject": "<p>OP here, damn ty sm...Like for real &lt;3&lt;3&lt;3. I think I also should get back to studying for finals, but wow, I felt so dumb when I posted the original question and like this advice is so good, just in terms of being able to get on ad over to the next thing, being able to accurately reflect on myself while still being able to grow, and all that. Just wow. Thank you again.</p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_0", "updated": "2019-05-13T06:06:33Z"}], "config": {}, "created": "2019-05-13T00:46:37Z", "data": {"embed_links": null}, "folders": [], "id": "jvlnczviyeo7lt", "no_answer": 0, "no_upvotes": 0, "subject": "<p><strong>&#34;I&#39;m a sophomore that due to health problems&#34;</strong></p>\n<p>Hope you&#39;re doing better and find solutions to improve your health. College can be a tough environment, bundled with all this work, grades, expectations, peers, desires, etc. Definitely wish a summer of healing and growth for you.</p>\n<p></p>\n<p></p>\n<p><strong>&#34;haven&#39;t really gotten as far as my peers [e.g. CS 189, grad courses, etc.].&#34;</strong></p>\n<p>Well, you do go to a school that gets ranked #1 in CS and is highly ranked (sometimes Top 5) in the world. Many of your peers are some of the brightest ex high school students in the world, and that comes with a lot of reasons for that, like national winners of competitions, elite athletes, people who can juggle 5-6 rigorous courses while balancing athletics, SAT studying, etc, even people who came to Berkeley with great CS foundation or advanced skills(I once asked a TA how he/she were so good at the material in the course, and their response was something along the lines of &#34;I did it all through high school&#34;). In addition, the elite students in a pool of community college and/or other universities who decided to apply to Cal are also here, with parallel accolades as the ex high school students. So in a sense, take a moment to think about how amazing the peers around you may be, and that your current state isn&#39;t necessarily a deficiency in any sense, but rather, you&#39;re just in an incredible place of students.</p>\n<p></p>\n<p>But also, I think taking 189 and grad courses is extraordinary. Yes, perhaps many of your peers are extraordinary as I said above, but that doesn&#39;t have to be the baseline for success, nor should you, as a sophomore, feel unsuccessful not taking these classes. Good for those who take it, but you can take them your 2nd semester of senior year, or never take them and have a great life and career after college.</p>\n<p></p>\n<p><strong>&#34;I learned how to code through 61A/B, have done EE16A/B, and have a basic understanding of statistics from Stat 134, but beyond that, I don&#39;t really think I&#39;m good at anything.&#34;</strong></p>\n<p>Don&#39;t undermine yourself. 16A &#43; 16B &#43; 134 is great knowledge, even if you think your understanding is basic. Do you think you could learn more? The next step is leveling up your understanding, if you&#39;re interested in the material. and 61B is an amazing class that is the foundation for passing interviews and excelling in the workplace. For those who mentioned teaching above, 61B is very rewarding to teach others, at least in my experience. I&#39;d say you know a lot as a sophomore, and that isn&#39;t just to make you feel better. I think you&#39;re selling yourself short by comparing yourself to others. It&#39;s natural, but give yourself some love. I think there is something amazing about those who have issues in their lives outside of school, but still persevere in their courses and finish it with an understanding of the material.</p>\n<p></p>\n<p></p>\n<p><strong>&#34;I look around and see my peers being ready to lead awesome independent research or work on super cool projects and I can&#39;t help but feel a little regretful and jealous. I&#39;ve worked in labs before, but haven&#39;t really learned anything other than following instructions from grad students/researchers and churning out trivial work.&#34;</strong></p>\n<p>Well, you&#39;re so young in your CS career. You&#39;ve only officially had 2 years of training, and a majority of that time is spent on growing as a person, figuring out college and all its expectations, rules, and environments. You have tons of other classes, family/friend stuff, your personal health that&#39;s still growing, you&#39;re still trying to figure yourself out. Just the fact you&#39;ve worked in labs is impressive, even if it wasn&#39;t the work you wanted to do. Talk to your peers and figure out how you can take on your own research you enjoy, and if it&#39;s even worth it. We all come from different backgrounds, had different mentors(family/teachers/friends etc), and when you&#39;re so young and don&#39;t understand how life fully works, you&#39;re bound to not code in high school or prepare prior to college or not have the best mindset and study habits and plan to crush it your first semester. We&#39;re all on a different clock and path, ya know? These are correctable, and if you believe you can work smarter, harder, develop a better plan, and push through some pain for consistent effort to improve your health, environment, and actions this summer, so that perhaps, if you really want these things, you can strive to get them.</p>\n<p></p>\n<p>Someone will always have a bigger house, more money, more prestige, more friends, better pictures, better resume, more knowledge, probably lots of people. But if you were in a world in which only you had a home, would you be satisfied with its size? How about your income, and your # of friends, etc. The less I compared and the more I looked inwards, the easier I found it to be content while simultaneously being excited to grow on a daily basis. If it was easy to not compare to others, I think people wouldn&#39;t compare to others, but I hope this analogy helps. I&#39;ve felt the way you felt in the past, and these changes in my mindset really helped.</p>\n<p><strong> </strong></p>\n<p><strong>&#34;Anyway, yeah, do any of y&#39;all have some advice as to how I can get better, or what specific things I can do, etc.? I know this is a very common question, and I&#39;ve read a ton on this Piazza board, but I find it difficult to come up with a tangible plan beyond just graduating from here with a mild ability to do tests and homework but not really build or creatively think about too many things.&#34;</strong></p>\n<p>1. Focus on finals. Don&#39;t worry about this right now. I suggest just filling your schedule fully with studying and exercise and sleep.</p>\n<p>2. Audit yourself. Could be as simple as taking a blank sheet of paper or online note, and writing out what you want in life, potential purpose in life(although that&#39;s hard to say, especially while in college), ideal habits, how you actually spend your days, and what habits you can replace the bad habits with to achieve your goals. Can talk with friends for support or honest feedback, and/or figuring out how your peers achieve their goals. </p>\n<p>3. Probably setting aside time everyday, almost like a mandatory class, to work on side projects. If you can find a research position or teaching position you enjoy, I still recommend setting time to code on your own. Even if it&#39;s 15 min a day, let&#39;s say 60 days pass by. That&#39;s 15 hours of work. Seems small, but that&#39;s 15 minutes of focused attention. Can you imagine how much you can progress with 15 uninterrupted hours?</p>\n<p>4. In addition, taking the building of habits slow. It can be very uncomfortable getting rid of habits that may no longer serve you. These habits give us some kind of reward(think social media and the feelings you get when scrolling down a news feed, and how you feel when you&#39;re not doing it or want to do it but can&#39;t). Having a support system I found is very helpful, especially if they hold you accountable. But I know not everyone can necessarily get one, so just know it&#39;s not necessary. I think taking it slow, maybe even 1 habit at a time, is helpful. I&#39;m not implying you have any bad habits, since you&#39;re absolutely doing well so far in school by understanding those classes, but just in case you feel you do. Priority should be getting your health issues solved, if they are solvable.</p>\n<p>5. Put yourself out there and through your preparation, apply to clubs and other situations you feel could give you these cool experiences your peers have. Even if you feel unqualified, you never know. They might just like you, or you might be qualified. Rejection sucks. It really does. It builds character, can help you improve if you don&#39;t know what to improve, and the opposite action guarantees failure. Yes, certain risks can have higher consequence than not taking the action(think SAT questions - points), but in most cases, it&#39;s worth the risk of failure.</p>\n<p></p>\n<p>I gotta get back to work, but hope this helps.</p>", "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jkimyxx2ufj2qu", "name": "Grace Jung", "photo": null, "photo_url": null, "role": "student", "us": false}], "tag_good_arr": ["jkimyxx2ufj2qu"], "type": "followup", "uid_a": "a_8", "updated": "2019-05-13T00:46:37Z"}], "config": {}, "created": "2019-05-12T01:03:20Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["peer_directed"], "history": [{"anon": "stud", "content": "<p>I&#39;m a sophomore that due to health problems haven&#39;t really gotten as far as my peers [e.g. CS 189, grad courses, etc.]. I learned how to code through 61A/B, have done EE16A/B, and have a basic understanding of statistics from Stat 134, but beyond that, I don&#39;t really think I&#39;m good at anything. I look around and see my peers being ready to lead awesome independent research or work on super cool projects and I can&#39;t help but feel a little regretful and jealous. I&#39;ve worked in labs before, but haven&#39;t really learned anything other than following instructions from grad students/researchers and churning out trivial work. </p>\n<p></p>\n<p>Anyway, yeah, do any of y&#39;all have some advice as to how I can get better, or what specific things I can do, etc.? I know this is a very common question, and I&#39;ve read a ton on this Piazza board, but I find it difficult to come up with a tangible plan beyond just graduating from here with a mild ability to do tests and homework but not really build or creatively think about too many things.</p>", "created": "2019-05-12T01:03:20Z", "subject": "How Can I Start Being More Proactive in my Academics?", "uid_a": "a_0"}], "history_size": 1, "i_edits": [], "id": "jvk8imxs7z41oh", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 1, "nr": 9587, "num_favorites": 22, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654546580572, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvhopc26l6a8", "name": "Laiming Huang", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvh8i561k5t7", "name": "Warren Alphonso", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p6nezwwv5jd", "name": "Aryana Shabestari", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvhcjpozd5xg", "name": "Atharva Mehendale", "photo": "1596323170_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jktvhcjpozd5xg/1596323170_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6lewo9fvug2vw", "name": "Tom Cheah", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j3l3z9ni3ff58o", "name": "Jason Xie", "photo": null, "photo_url": null, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "iy1ry3sa3e13ta", "name": "Claire Li", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvi4a5x5a6qc", "name": "Anni Qi", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j6nu4j7a2be46b", "name": "Shaantam Chawla", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"global": 1565840066, "jw6kndsic346lm": 1562564221}, "facebook_id": null, "id": "jktvexhlmpa3zk", "name": "Sunay Poole", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"global": 1584487673, "jz3nrud5bim5td": 1576367081, "k5iux9o5vvc5c9": 1587836161, "ke845vklu6nlh": 1601676703}, "facebook_id": null, "id": "jc8a4c4dl3u6dc", "name": "Bijan Fard", "photo": "1529342919_35.png", "photo_url": "https://cdn-uploads.piazza.com/photos/jc8a4c4dl3u6dc/1529342919_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jzqdjhamcv15kk", "name": "Aditya Dev Varma", "photo": "1598914264_200.jpg", "photo_url": "https://cdn-uploads.piazza.com/photos/jzqdjhamcv15kk/1598914264_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "kpxf83tq4f35ul", "name": "Haosheng Li", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jktvhopc26l6a8", "jktvh8i561k5t7", "is6p6nezwwv5jd", "jktvhcjpozd5xg", "j6lewo9fvug2vw", "j3l3z9ni3ff58o", "iy1ry3sa3e13ta", "jktvi4a5x5a6qc", "j6nu4j7a2be46b", "jktvexhlmpa3zk", "jc8a4c4dl3u6dc", "jzqdjhamcv15kk", "kpxf83tq4f35ul"], "tags": ["peer_directed", "student"], "type": "question", "unique_views": 1034}