{"bookmarked": 5, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "jvmzhlqouif4d2", "type": "create", "uid": "is6p9qkip6cyv", "when": "2019-05-13T23:13:54Z"}, {"anon": "stud", "to": "jvmzhlqjzc74d1", "type": "followup", "uid_a": "a_0", "when": "2019-05-13T23:34:21Z"}, {"anon": "stud", "data": "jvn0f8dfuuf3js", "to": "jvmzhlqjzc74d1", "type": "s_answer", "uid_a": "a_1", "when": "2019-05-13T23:40:02Z"}, {"anon": "stud", "data": "jvn0khleog87jg", "type": "s_answer_update", "uid_a": "a_1", "when": "2019-05-13T23:44:08Z"}, {"anon": "stud", "data": "jvn0ky42q002j", "type": "s_answer_update", "uid_a": "a_1", "when": "2019-05-13T23:44:29Z"}, {"anon": "no", "to": "jvmzhlqjzc74d1", "type": "followup", "uid": "is6p94rzyszeb", "when": "2019-05-14T06:34:46Z"}, {"anon": "no", "to": "jvmzhlqjzc74d1", "type": "feedback", "uid": "is6p9qkip6cyv", "when": "2019-05-14T18:37:55Z"}, {"anon": "no", "to": "jvmzhlqjzc74d1", "type": "feedback", "uid": "is6p9qkip6cyv", "when": "2019-05-14T18:41:23Z"}, {"anon": "no", "to": "jvmzhlqjzc74d1", "type": "followup", "uid": "is6p9qkip6cyv", "when": "2019-05-14T18:45:29Z"}], "children": [{"anon": "stud", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 45, "children": [{"anon": "no", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 45, "children": [], "config": {}, "created": "2019-05-14T18:41:23Z", "data": {"embed_links": null}, "folders": [], "id": "jvo570ajcxa5df", "subject": "<p>In that case, then I think 189 really wouldn&#39;t be the ideal course for me and i&#39;d rather spend my time taking other courses. I skimmed over the material for 189 and I found it to be too &#39;mathy&#39; of a class for me to really enjoy. Not that I don&#39;t like Math but that it focuses on the side of Math that I really don&#39;t find interesting. </p>\n<p>Thank you very much for this insight. </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "is6p9qkip6cyv", "updated": "2019-05-14T18:41:23Z"}], "config": {}, "created": "2019-05-13T23:34:21Z", "data": {"embed_links": null}, "folders": [], "id": "jvn07x00nz01fv", "no_answer": 0, "no_upvotes": 0, "subject": "<p>IMO if you are not interested in Machine Learning and didn&#39;t like SVD/PCA/sampling then perhaps don&#39;t consider 127/189/126. </p>\n<p>From my experience, </p>\n<p>- taking difficult courses (as those three are) that you don&#39;t care about just makes the experience all the more miserable. It&#39;s hard, you don&#39;t care, and it sucks. </p>\n<p>-A lower grade in 127/189/126 may not look as good, even if its a &#34;cool&#34; field - I am the type of person that would rather see someone took lots of classes they enjoyed, developed a passion for a certain area, and excelled in it, than try a course just because everyone else was. </p>\n<p>-also SVD/PCA/sampling are pretty core topics so that&#39;s not a great sign for your interest for the field as a whole. </p>\n<p></p>\n<p>However, perhaps you just didn&#39;t like the way SVD/PCA/sampling was presented (I didn&#39;t enjoy most of my lower divs), so when you need a break over the summer or next year skim through the lecture materials of each course to see if how they are presented are more interesting to you. Note that the fall and spring offerings of 189 are pretty different at the moment so make sure to look at the right semesters. </p>\n<p></p>\n<p>I understand your desire to take more classes though - there are so many classes I want to take here, to also get the most of the education I am paying for. However, I personally would want to take more time to dive even deeper in the subjects that I know that I love, precisely because I love them so much. </p>\n<p>You have some time - while taking 61c over the summer just ponder this conumdrum!</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid_a": "a_0", "updated": "2019-05-13T23:34:21Z"}, {"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2019-05-13T23:40:02Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>If you liked controls, why not add 1 to EE 127 and make it EE 128? EE 128 is literally all controls.</p>\n<p></p>\n<p>In all seriousness, if are tired of systems, try robotics. Robotics doesn&#39;t necessarily entail machine learning/AI if you don&#39;t want it to. There&#39;s other stuff that&#39;s more &#34;tangible&#34; such as controls as you mentioned. You&#39;re an EECS major so you could actually go into building/firmware writing. Leave the ML to the statisticians if you don&#39;t personally like doing it.</p>\n<p></p>\n<p>Maybe try 106A or 120?</p>\n<p></p>\n<p>Regarding number of classes, I wouldn&#39;t sweat it. Yes people take 8 or 9 upper divs, but they end up using at most the knowledge from 2 or 3 of them, if any at all. You&#39;re hired to do something specific by a company, not just be a general computer scientist. As long as you&#39;re good at systems and have 2/3 systems UDs you did well in, your employer doesn&#39;t care if you know ML or not if you&#39;re hired to write a compiler.</p>", "created": "2019-05-13T23:44:29Z", "subject": "", "uid_a": "a_1"}, {"anon": "stud", "content": "<p>If you liked controls, why not add 1 to EE 127 and make it EE 128? EE 128 is literally all controls.</p>\n<p></p>\n<p>In all seriousness, if are tired of systems, try robotics. Robotics doesn&#39;t necessarily entail machine learning/AI if you don&#39;t want it to. There&#39;s other stuff that&#39;s more &#34;tangible&#34; such as controls as you mentioned. You&#39;re an EECS major so you could actually go into building/firmware writing. Leave the ML to the statisticians if you don&#39;t personally like doing it.</p>\n<p></p>\n<p>Maybe try 106A or 120?</p>\n<p></p>\n<p>Regarding number of classes, I wouldn&#39;t sweat it. Yes people take 8 or 9 upper divs, but they end up using at most the knowledge from 2 or 3 of them, if any at all. You&#39;re hired to do something specific by a company, not just be a general computer scientist. As long as you&#39;re good at systems and have 2/3 systems UDs you did well in, you&#39;re employer doesn&#39;t care if you know ML or not if you&#39;re hired to write a compiler.</p>", "created": "2019-05-13T23:44:08Z", "subject": "", "uid_a": "a_1"}, {"anon": "stud", "content": "<p>If you liked controls, why not add 1 to EE 127 and make it EE 128? EE 128 is literally all controls.</p>\n<p></p>\n<p>In all seriousness, if are tired of systems, try robotics. Robotics doesn&#39;t necessarily entail machine learning/AI if you don&#39;t want it to. You&#39;re an EECS major so you could actually go into building/firmware writing. Leave the ML to the statisticians if you don&#39;t personally like doing it.</p>\n<p></p>\n<p>Maybe try 106A or 120?</p>", "created": "2019-05-13T23:40:02Z", "subject": "", "uid_a": "a_1"}], "id": "jvn0f8d4xlf3jr", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "iscem14kbsu5vi", "name": "Keerthi Bhattaram", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p6uis14y5ot", "name": "Elena Jia", "photo": "1545635952_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/is6p6uis14y5ot/1545635952_35.png", "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["iscem14kbsu5vi", "is6p6uis14y5ot"], "type": "s_answer"}, {"anon": "no", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 45, "children": [{"anon": "no", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 45, "children": [], "config": {}, "created": "2019-05-14T18:37:55Z", "data": {"embed_links": null}, "folders": [], "id": "jvo52jyhchl216", "subject": "<p>Thank you for your reply. As other posters have commented, I don&#39;t think I&#39;d enjoy CS189 having not really liked the SVD, PCA/Sampling and classifications parts of EE16B since it looks like 189 relies more on some of these concepts. </p>\n<p>However, the idea of taking a more theoretical class sounds very interesting. I didn&#39;t even that Berkeley offers a WHOLE course on cryptography. That&#39;s definitely a class I now plan on taking having enjoyed the RSA parts of CS70!</p>\n<p></p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid": "is6p9qkip6cyv", "updated": "2019-05-14T18:37:55Z"}], "config": {}, "created": "2019-05-14T06:34:46Z", "data": {"embed_links": null}, "folders": [], "id": "jvnf8kbfoke1zi", "no_answer": 0, "no_upvotes": 0, "subject": "It sounds like you want more technical CS breadth. If you want to take 189 to expand your breadth of knowledge, I think it&#39;s more important to take 126 or 127. I think these classes is more foundational and provide the CS breadth that you seem to be seeking. If you resound with some of the topics, maybe you could think about going further down ML, but if you don&#39;t at least you will still develop some further foundation.<div><div><br /></div><div>I also don&#39;t think taking ML for the hipster points is a good reason to take it; you should take it out of interest.</div><div><br /></div><div>If you want breadth, I would try to take these classes sooner than your &#34;core&#34; classes that you want to take no matter what. This way, if something piques your interest, you have an opportunity to change your plans and move forward with that new plan. There&#39;s robotics with 106A, Graphics with 184, 151/2 for low pevel stuff, potential special topics classes, etc.</div><div><br /></div><div>Also, I would recommend 164 if you plan to specialize in systems. I would see how well you do or how much you like 61C and 162 as an indicator of whether you want to move forward with it.</div><div><br /></div><div>Finally, I would recommend taking a more theoretical class on top of 170 before graduating. I had a lot of fun in Cryptography and I was disappointed not to have taken it sooner. As a side note, 164 also has a tidbit of language theory behind it.</div></div>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "is6p94rzyszeb", "updated": "2019-05-14T06:34:46Z"}, {"anon": "no", "bucket_name": "Week 5/12 - 5/18", "bucket_order": 45, "children": [], "config": {}, "created": "2019-05-14T18:45:29Z", "data": {"embed_links": null}, "folders": [], "id": "jvo5c9vvq4886", "no_answer": 0, "no_upvotes": 0, "subject": "<p>The student response is very insightful. I hadn&#39;t considered robotics at all since I seem to forget that Berkeley EECS has an EE department that offers a wide selection of classes. I will definitely look into 106A and 120 and see how they&#39;d complement my education here. You&#39;re also right in that I&#39;ll only end up using knowledge from maybe 2 or 3 classes. Thank you very much!</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "is6p9qkip6cyv", "updated": "2019-05-14T18:45:29Z"}], "config": {}, "created": "2019-05-13T23:13:53Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["faculty_advising", "eecs"], "history": [{"anon": "no", "content": "<p>Hello everyone,</p>\n<p></p>\n<p>I&#39;m a rising EECS senior trying to come up with a class schedule for the coming academic year &#43; an extra semester that am confident I&#39;ll get approved for. Basically, I want to take an extra semester so I can be able to take more CS classes. I&#39;m thinking 7 computer science upper divs minimum. I could graduate on time but my need for the extra semester is based on my belief, whether true or untrue, that exposure to different sub-fields within CS is very important. Before I get to my main reason for posting here, is there an advantage in taking more CS classes than the 5 that are required to walk out with a CS degree? Personally, I seem to think that 5 classes are a little too few and I won&#39;t be making the most of all available offerings in terms of CS classes here at Cal. Hence the reason for taking the extra semester. Cost, for me, is not the issue but rather the thought of graduating with an inadequate set of skills required for the tech industry at the moment. Now, various other people, including faculty have expressed the opinion that the lower division classes are all one needs to work in industry, which while true, beats the purpose of coming to Cal to study EECS in the first place. Will I end up a half-baked graduate if I just take the minimum 5 CS/EE upper-divs required, or is it perfectly okay to just get 5 upper-divs done and call it a day? This will help me decide on whether or not taking the extra semester is necessary. In general, i&#39;ll feel bad if I don&#39;t at least explore the various classes here. As an international student, and like everyone else, I want to get the full value of the education that am paying high dollars for. Are there any perceived advantages in people who graduated having met the bare minimum requirements versus those who took, say, 8 or even 9 upper-div classes? Does anyone else feel like 5 upper-div requirements is maybe too lenient.....?</p>\n<p>Now, onto my main reason for posting:</p>\n<p>I&#39;m considering the Computer Systems track, and I plan on having the following schedule for, well, the three semesters that I intend on being a student here: </p>\n<p></p>\n<p>side-note: Am also enrolled in CS61C for this summer, and I feel like I shouldn&#39;t take any other class alongside it. Not even an easy humanities class for the GPA boost. I intend to focus all my time and energy on this particular class since it forms the basis of everything systems related.</p>\n<p></p>\n<p>Currently taking:<br /><br /></p>\n<p>- CS 170 (popular opinion has it that it&#39;s one of the most, if not the most, important undergrad CS classes at Cal)</p>\n<p></p>\n<p>Fall 2019:</p>\n<p></p>\n<p>- CS 162  (currently position 51 on the waitlist)</p>\n<p>- CS 161 (currently on the waitlist for 161 at position 50)</p>\n<p></p>\n<p>Spring 2020:</p>\n<p></p>\n<p>- CS 168</p>\n<p>- CS 186</p>\n<p></p>\n<p>Fall 2020:</p>\n<p>- This is the semester I intend on taking classes outside of the Systems track since I&#39;ll have taken almost all possible systems classes at the undergraduate level. Save for maybe CS164)</p>\n<p>- Additionally, we all know that AI and Machine Learning are the cool fields to pursue at the moment and I don&#39;t want to miss the train. Plus AI or Machine Learning on a resume/transcripts just looks &#39;badass&#39; and screams &#39;woke and cultured&#39; in the CS realm (you know what I mean?) Now this is the confusing part, am torn between taking the EECS127 &#43; CS189 combo (maybe EECS126&#43;CS189, whichever works) or straight up finish up with the last of the systems track classes, CS164 with a dose of CS 188. </p>\n<p>- Am not very interested in Machine Learning, or basically anything that involves dealing with data (FYI, i didn&#39;t particularly enjoy the lasts parts of EE16B on SVD/PCA/sampling) so i&#39;d like to hear about the usefulness of 189 over, say 188 which I&#39;d enjoy since I enjoyed the controls part of EE16B (excluding the parts I mentioned earlier)</p>\n<p>- Alternatively, I could choose to explore a totally different area and just take CS184 and perhaps a low work-load EE class.</p>\n<p></p>\n<p>Long post, but any insight is welcome. </p>\n<p></p>\n<p>Thanks!</p>", "created": "2019-05-13T23:13:54Z", "subject": "Senior Year course-load &#43; Key decisions.", "uid": "is6p9qkip6cyv"}], "i_edits": [], "id": "jvmzhlqjzc74d1", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 9596, "num_favorites": 7, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654546473073, "tag_good": [], "tag_good_arr": [], "tags": ["eecs", "faculty_advising", "student"], "type": "question", "unique_views": 909}