{"bookmarked": 3, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "ilkj0661fb33wi", "type": "create", "uid_a": "a_0", "when": "2016-03-09T07:30:27Z"}, {"anon": "no", "data": "ill29ybxdjnjc", "to": "ilkj065ywl93wg", "type": "i_answer", "uid": "ibtip4ceues3g0", "when": "2016-03-09T16:29:56Z"}, {"anon": "no", "data": "ilmyuf0qkoq34b", "type": "i_answer_update", "uid": "ibtip4ceues3g0", "when": "2016-03-11T00:29:24Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2016-03-09T16:29:56Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "no", "content": "<p>**Please see updated information specific to transferring to EECS from another COE major.**</p>\n<p></p>\n<p>Students should meet with their assigned ESS advisor who will help them with the change of major process.</p>\n<p></p>\n<p><strong>Electrical Engineering &amp; Computer Science <br /></strong>Will automatically accept students who meet criteria (1) and (2)<br />(1) GPA of 3.3 or better in all technical course work completed to date (includes math and basic sciences in addition to engineering) and who have a minimum 3.3 in EECS courses (see list below). </p>\n<p><br />(2) Making satisfactory progress towards core classes for the major, defined as follows </p>\n<p>Students who have completed N semesters, for N = 1, 2, 3, or 4, must have completed at least N of EE 20, EE 40, EE 16A, EE 16B, CS61A, CS61B, CS61C, CS 70.</p>\n<p> </p>\n<p>Students who have completed N semesters, for N = 5 or greater, must have completed all of EE 20 or EE 16A, EE 40 or EE 16B, CS61A, CS61B, and CS61C and must have completed at least N-4 upper division courses in EECS.</p>\n<p> </p>\n<p>E 7 cannot be used toward the above.  It can be substituted once admitted for CS 61A (though not at all advised for students interested in Computer Science), but can’t be used to meet minimum eligibility requirements. <br /><br /></p>\n<p>(3) Students with less than a 3.3 in technical courses are not eligible. </p>\n<p></p>\n<p>(4) Must apply by no later than the end of the junior year, including adding as a second major. </p>\n<p></p>", "created": "2016-03-11T00:29:24Z", "subject": "", "uid": "ibtip4ceues3g0"}, {"anon": "no", "content": "<p>Change of major information within the COE can be found <a href=\"http://engineering.berkeley.edu/academics/majors-minors/change-major\" target=\"_blank\">here</a>. You need to meet the criteria below in order to be considered for a change of major. Please note that ESS recommends applying for the change by the end of your sophomore year and at least 2 semesters before graduating. If you have any questions, I would suggest meeting with your ESS advisor.</p>\n<p></p>\n<p></p>\n<p>Applications for a change of major will be considered only when all of the following requirements have been met:</p>\n<ul><li>At least one semester has been completed at Berkeley.</li><li>Student is in good academic standing.</li><li>Student has made satisfactory academic progress during his or her semesters of enrollment.</li><li>The planned program shows a realistic trajectory for completing all degree requirements within the time allotted by the college.</li><li>Students who have met the above criteria and have a UC technical GPA of 3.0 or higher are more likely to be approved. Some majors require a technical GPA greater than 3.0 for admission, and completion of more than one semester. Students should consult with their ESS adviser for specific information on their intended major.</li><li>It should be noted that the above criteria are required for consideration, but are not a guarantee of admission. Many of our majors are highly impacted and are thus very limited in the number of requests they can accommodate.</li></ul>\n<p>Contact your ESS adviser to discuss your plans and pick up a change of major application. It’s best to submit the application no later than the end of sophomore year. The application must be submitted a minimum of two semesters prior to the anticipated date of graduation. It must include an academic plan that shows how the requested change will not delay graduation.</p>", "created": "2016-03-09T16:29:56Z", "subject": "", "uid": "ibtip4ceues3g0"}], "id": "ill29ybukubjb", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "hzab6kpr3c048h", "name": "Justin Luke", "photo": "1473540382_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/hzab6kpr3c048h/1473540382_35.png", "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["hzab6kpr3c048h"], "type": "i_answer"}], "config": {}, "created": "2016-03-09T07:30:26Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": {}, "folders": ["eecs"], "history": [{"anon": "stud", "content": "If I&#39;m anticipating switching to EECS from another Engineering major, when do I have to submit the necessary forms?", "created": "2016-03-09T07:30:27Z", "subject": "Switching to EECS", "uid_a": "a_0"}], "i_edits": [], "id": "ilkj065ywl93wg", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 976, "num_favorites": 1, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654555783284, "tag_good": [], "tag_good_arr": [], "tags": ["eecs", "student"], "type": "question", "unique_views": 398}