{"bookmarked": 5, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jxaup74qrbj6yx", "type": "create", "uid_a": "a_0", "when": "2019-06-24T20:46:00Z"}, {"anon": "no", "data": "jxcgwogreq46m9", "to": "jxaup74m7hy6yw", "type": "s_answer", "uid": "is6p815tz306kj", "when": "2019-06-25T23:55:27Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2019-06-25T23:55:27Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "no", "content": "<p>I&#39;m not sure if I would discount the possibility of taking 152 so far in advance if I were you. This might just be me talking, but literally every &#34;ideal&#34; schedule I&#39;ve come up with has been eliminated by course scheduling realities, so it might turn out that you will be able to take 152. In any case, if you somehow manage to retain a genuine interest in the material after taking 61C, I&#39;d heavily recommend taking 152. I actually ended up liking it a lot more than 61C (proceeds to describe why you might like it as well). 152 is made special by a few things:</p>\n<p></p>\n<p>1) It&#39;s probably the smallest CS class (not including 151, but there&#39;s a lot of overlap in the people who take these two courses). This means that basically everyone else in the class is in it because they have some sort of passion for the material. A direct result of this is that doing the (written) homework in a group can be an incredibly rewarding learning experience, and office hours discussions yield tangible results. 61C really lacked this, in my opinion. A resulting &#34;con&#34; would be that the curve can be intense, especially since maybe half of the students in the class are TAs.</p>\n<p></p>\n<p>2) The labs are very demanding but also quite rewarding. They involve applying the concepts from class to get concrete results; my favorites were labs 3 and 4, where we developed a good branch predictor and optimized assembly code for vector machines, respectively. The real kicker here is that these aren&#39;t available to the public, as far as I know. Certainly, the lab documents are all on the website, but I think only lab 3 is in any way replicable given just that.</p>\n<p></p>\n<p>3) 152&#39;s cast is full of &#34;all-stars&#34;. Prof. Asanovic wrote a part of the appendix of the textbook for the course. His PhD thesis is directly relevant to the course content because he came up with vector machines (read that again to make sure you understand what I&#39;m saying). 152 carries over 61C&#39;s &#34;info dump&#34; slideshow lecture style, which isn&#39;t the greatest, but, other than that, Prof. Asanovic is a really good lecturer. His follow-up questions ensure that students actually understand what is going on, and I&#39;d go as far as to say that the slides don&#39;t impart all that much on their own (hearing them explained is tremendously valuable, which is why office hours are even more important). The TAs are really good at what they do too. Plus, David Patterson makes an appearance near the end of the course to talk about computer architecture for machine learning, so that&#39;s a bit of a once-in-a-lifetime experience (this guy wrote the textbook). And, as I mentioned before, the students are also quite competent.</p>\n<p></p>\n<p>So, yeah, try to take 152 if you can. It&#39;s really useful for programmers to get a good feel of how processors actually work, so you had better take 162 at the very least if software development is your goal. If you <em>really really </em>can&#39;t take 152, I can tell you that I did well in the class and did not even get the textbook, since I didn&#39;t like 61C&#39;s, so I doubt that that provides too much value over the lecture slides (even if it is a bit of a seminal work). Doing the 252 paper readings is an option, but those kind of assume a bit more maturity, so that&#39;s not a great alternative either. Doing the homework problems (and maybe the exams and/or their review worksheets) after carefully reading through the slides (or watching the lectures from whichever MIT OCW course, which is probably the same thing but just dated) is probably your best bet for internalizing the material, but I have to emphasize that this is a poor substitute for the real thing. You&#39;re really forgoing a lot when you don&#39;t have the opportunity to ask questions in study/lab groups and office hours. On the plus side, 152 could be infuriatingly difficult sometimes, so you might be dodging a bullet. Just a very memorable bullet. Best of luck either way!</p>", "created": "2019-06-25T23:55:27Z", "subject": "", "uid": "is6p815tz306kj"}], "id": "jxcgwogkh006m8", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvhopc26l6a8", "name": "Laiming Huang", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "is6p6j9n6u55fp", "name": "Katie Gu", "photo": "1513749563_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/is6p6j9n6u55fp/1513749563_35.png", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"j9ladzzp4wmh": 1524243875, "jyq487ctcwuk8": 1571117164}, "facebook_id": null, "id": "is6p9a8vasskl", "name": "Alex Thomas", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jgzrvhr0eop6on", "name": "Vidhan Jain", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {"jpslgn3m4lsk6": 1555223627, "ke0mwss5bxj4hs": 1600242896}, "facebook_id": null, "id": "jhobhold1yokb", "name": "Kaushik Sankar", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "j9u9cphgdri3nr", "name": "Priyam Mohanty", "photo": "1568403351_200.jpg", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/j9u9cphgdri3nr/1568403351_200.jpg", "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "jzlnpfrl2qk2e6", "name": "Justin Xia", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["jktvhopc26l6a8", "is6p6j9n6u55fp", "is6p9a8vasskl", "jgzrvhr0eop6on", "jhobhold1yokb", "j9u9cphgdri3nr", "jzlnpfrl2qk2e6"], "type": "s_answer"}], "config": {}, "created": "2019-06-24T20:46:00Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["peer_directed"], "history": [{"anon": "stud", "content": "<p>Hi all! I am asking this question because I can’t fill this course into my class schedule for future semesters since there are other courses that are more relevant to SWE job, but I still don’t want to lose the knowledge from 152. I may self-study it after completing 61C at school during other summer seasons. I can’t find webcast recording for 152 on the webcast catalog, but I can find lecture slides on 152’s website. Can anyone offer any advice as to whether the slides are enough, or what other resources I may need to study it? </p>\n<p></p>\n<p>Thank you so much!</p>", "created": "2019-06-24T20:46:00Z", "subject": "Best way to self-study for CS 152?", "uid_a": "a_0"}], "i_edits": [], "id": "jxaup74m7hy6yw", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 9788, "num_favorites": 6, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654546272689, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jktvhopc26l6a8", "name": "Laiming Huang", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}, {"admin": false, "endorser": {}, "facebook_id": null, "id": "juydyvgw1s05t1", "name": "Jerry Zhang", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_good_arr": ["jktvhopc26l6a8", "juydyvgw1s05t1"], "tags": ["peer_directed", "student"], "type": "question", "unique_views": 390}