{"bookmarked": 3, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "no", "data": "jyg44wcy207bk", "type": "create", "uid": "jy4rswsditj4ke", "when": "2019-07-23T17:48:43Z"}, {"anon": "stud", "data": "jykrcv6ktd36ge", "to": "jyg44wcw9k1bj", "type": "s_answer", "uid_a": "a_0", "when": "2019-07-26T23:49:50Z"}], "children": [{"bucket_name": "Today", "bucket_order": 3, "children": [], "config": {}, "created": "2019-07-26T23:49:50Z", "data": {"embed_links": []}, "folders": [], "history": [{"anon": "stud", "content": "<p>Note: I took these classes, though not at the same time. Also, I will answer based on not knowing your prior math/CS experience since you haven&#39;t provided that.</p>\n<p>61A: The path to doing well in CS 61A is a bit more straightforward as their point-based grading policy makes it easy to track your progress in the class. In general, you should try to complete all the assignments and projects, and do all of the extra credit (if possible), since there is no uncertainty as to whether you will receive full credit on these or not (these assignments use an autograder, and you can submit your assignment until you get full points on it). For the tests, you&#39;ll likely need to do as many practice exams as you can find time for/as much as you need to feel good about the topics. If you get full credit on all the assignments, you are already at a point where you can basically fail all the exams and still pass. I would advise to do the assignments and try your best on exams, and you should be fine.</p>\n<p>-As a former AI for this course, the students who had prior programming background (python especially) typically needed to spend less time studying the material, as a lot of the exams depend on your knowledge of python.</p>\n<p></p>\n<p>CS 70: This is not a programming course, so far more students struggle with this course than with 61A since this kind of math is new even for people who have prior CS experience (unless you specifically have experience with proof-based math or probability). That being said, this class is graded on a curve, so it&#39;s a bit harder to tell how well you are doing in the class as opposed to CS 61A. Also, you don&#39;t have any projects, but the home works take quite a while. In my experience, this class will require you to be on top of the material--previewing notes before lecture, consistently working on HW throughout the week, going to discussion and office hours regularly when you need help, etc. whereas in 61A it may not hurt as much to forego a discussion once in a while, for example. It is possible that this class will take less time than CS 61A in terms of time spent in class and doing HW, but it will take some time just to gain a proper grasp of the material (re-reading the lectures and notes until you are comfortable), so it evens out.</p>\n<p></p>\n<p>TLDR: CS61A takes a lot of time, but is usually less of a shock in terms of difficulty, while 70 typically proves to be more challenging content but might take *slightly* less time than 61A. Many people have done these simultaneously and did fine. Just be on top of the material and do not procrastinate, but once you gain a rhythm you should be fine.</p>", "created": "2019-07-26T23:49:50Z", "subject": "", "uid_a": "a_0"}], "id": "jykrcv6co0p6gd", "is_tag_endorse": false, "tag_endorse": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "jyqmmve6kkb5ur", "name": "Rithwik Sudharsan", "photo": null, "photo_url": null, "published": true, "role": "student", "us": false}], "tag_endorse_arr": ["jyqmmve6kkb5ur"], "type": "s_answer"}], "config": {}, "created": "2019-07-23T17:48:43Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["cs-intended", "eecs"], "history": [{"anon": "no", "content": "<p>Hi guys,</p>\n<p>             I am gonna be taking CS70 and CS61A in my first semester most probably. Can you please give me advice to do best in these two classes .</p>\n<p>                                                                             Thank you!</p>\n<p>                                                                              </p>", "created": "2019-07-23T17:48:43Z", "subject": "Tips for CS70 and CS61A", "uid": "jy4rswsditj4ke"}], "i_edits": [], "id": "jyg44wcw9k1bj", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 0, "no_answer_followup": 0, "nr": 9878, "num_favorites": 0, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654546171876, "tag_good": [], "tag_good_arr": [], "tags": ["cs-intended", "eecs", "student"], "type": "question", "unique_views": 385}