{"bookmarked": 5, "bucket_name": "Today", "bucket_order": 3, "change_log": [{"anon": "stud", "data": "jyotba36esl5t6", "type": "create", "uid_a": "a_0", "when": "2019-07-29T19:55:40Z"}, {"anon": "no", "to": "jyotba34weq5t5", "type": "followup", "uid": "is9ein4lpno52m", "when": "2019-07-29T21:44:07Z"}, {"anon": "stud", "to": "jyotba34weq5t5", "type": "feedback", "uid_a": "a_0", "when": "2019-07-30T00:16:10Z"}], "children": [{"anon": "no", "bucket_name": "Week 7/28 - 8/3", "bucket_order": 34, "children": [{"anon": "stud", "bucket_name": "Week 7/28 - 8/3", "bucket_order": 34, "children": [], "config": {}, "created": "2019-07-30T00:16:10Z", "data": {"embed_links": null}, "folders": [], "id": "jyp2mai2txp2ge", "subject": "<p>Thank you! I guess I ll put math 110 on the top priority for now.  I have no idea what IEOR classes feel like and what they focus on in their optimization class. There is little information given. </p>", "tag_good": [], "tag_good_arr": [], "type": "feedback", "uid_a": "a_0", "updated": "2019-07-30T00:16:10Z"}], "config": {}, "created": "2019-07-29T21:44:07Z", "data": {"embed_links": null}, "folders": [], "id": "jyox6r52uo930v", "no_answer": 0, "no_upvotes": 0, "subject": "<p>I haven&#39;t taken 160 so can&#39;t speak to that but I will speak on my experience taking Math110 in fa18 and then EECS127 in sp19. </p>\n<p></p>\n<p>Math110 taught be the basics of how to think about linear algebra in a more &#34;proof based&#34; viewpoint. Math 54 for me was pretty computational, and didn&#39;t involve a ton of proofs. 110 helped me practice the type of thinking that is common in linear algebra proofs and and further cover basic linear algebra knowledge. </p>\n<p></p>\n<p>I felt that 127 assumed a basic familiarity with linear algebra proofs coming into the course (there was a diagnostic quiz in the second lecture that I felt perfectly capable of doing with Math110 but not capable of doing if I only had 54), and thus having 110 under my belt helped a lot. </p>\n<p></p>\n<p>The first 3-4 weeks of 127 were mostly linear algebra focused (less on pure optimization), but I really enjoyed that because the concepts covered in 127 were stuff that was not stressed in 110 (such as positive definite matrix properties, Singular Value Decomposition, etc), so I was able to further develop my understanding of linear algebra and its popular concepts. </p>\n<p></p>\n<p>Math110 was pretty theoretical/conceptual, so it was nice to learn the theory first, and then in 127 we learned some practicable applications of least squares and linear algebra. One example in a discussion worksheet showed how the median is a &#34;robust&#34; (in a quantifiable, scientific manner that you will learn) measure of the mean using linear algebra topics like vectors, least squares, etc. I thought that was so cool.</p>\n<p></p>\n<p>If you really like linear algebra as just a subject in itself (which was my mindset - it was the type of math that really clicked with me), then 110&#43;127 will be an amazing opportunity to spend even more time learning about its amazing subjects. </p>\n<p></p>\n<p>tl;dr: Can&#39;t say anything about 160, but Math110 was a very natural course to take the semester before 127. </p>\n<p></p>\n<p>Caveat: I took 127 with Bayen and Ranade, this advice might not apply if you are taking 127 solely with El Ghaoui (though I think both Ranade and El Ghaoui are teaching in sp20 so it should still be good)</p>", "tag_good": [], "tag_good_arr": [], "type": "followup", "uid": "is9ein4lpno52m", "updated": "2019-07-29T21:44:07Z"}], "config": {}, "created": "2019-07-29T19:55:40Z", "data": {"embed_links": []}, "default_anonymity": "no", "drafts": null, "folders": ["suggestion_box"], "history": [{"anon": "stud", "content": "<p>Hi, I&#39;m a senior Data Science major and am struggling on choosing between Math 110 and IEOR160 for my next semester&#39;s schedule. Basically, EECS127, Math 110, IEOR160 are all within my domain emphasis requirement. But right now, I have 0 confidence in handling eecs127 for next semester. So I hope to choose a course that helps me review computational Linear Algebra and prepare me better for Optimization. If IEOR160 and MATH110 are the only two I could choose, which one would serve me better for that purpose?  Appreciate any insights or suggestions! Thanks!</p>", "created": "2019-07-29T19:55:40Z", "subject": "IEOR160 or MATH110 in preparing for EECS127?", "uid_a": "a_0"}], "i_edits": [], "id": "jyotba34weq5t5", "is_bookmarked": false, "is_tag_good": false, "my_favorite": false, "no_answer": 1, "no_answer_followup": 0, "nr": 9910, "num_favorites": 2, "q_edits": [], "request_instructor": 0, "request_instructor_me": false, "s_edits": [], "status": "active", "t": 1654546100245, "tag_good": [{"admin": false, "endorser": {}, "facebook_id": null, "id": "j6iprl4mznu6lk", "name": "Fredrick Fan", "photo": "1548908845_35.png", "photo_url": "https://d1b10bmlvqabco.cloudfront.net/photos/j6iprl4mznu6lk/1548908845_35.png", "published": true, "role": "student", "us": false}], "tag_good_arr": ["j6iprl4mznu6lk"], "tags": ["student", "suggestion_box", "unanswered"], "type": "question", "unique_views": 250}